{"video_id": "99htOScdK84", "title": "The Bible with Authority and Authenticity—April 13, 2025", "published_at": "20250413", "transcript": "Good morning. We're going to get started here. You have some sheets with the the lesson this morning. So, you can follow along. You can take that lesson sheet home. You can review it. You can look up those verses in a Bible. Learn how to use your Bible. Um, practice pray. You read those scriptures. Some of us sometimes we don't know what to pray. And you can read all these things and you can pray and you can ask God to help you understand, open it up to you. Uh it's very important that word of God is so powerful. What a powerful word it is. As the scriptures say, his word is above his name. Hosea 4:6 says, \"For lack of knowledge, my people are destroyed.\" My people are destroyed for lack of knowledge. Uh we got a guy up here. He's getting slapped around, right? Because he doesn't have knowledge. He walked into somebody's hand like this. You want to have knowledge and you uh hearing God starts with knowledge of the what? The Bible, the scriptures. You know, God will speak to you and say, \"Hey, go over here. Go to this book. I've spoken it all. I'm not going to respeak everything to you. It's here. And then I will use that to speak to you and speak to your life. So, it's important for us to get what? Knowledge. Knowledge of the Bible. And in your work, you need knowledge to do your job. You got to know where this is that. I'm sorry. We have you got to know where all your things are at. You got to know how to use them. If it's a technology job, you got to understand the technology. Uh, whatever job you're doing, a doctor, you have to have knowledge. Every job takes some knowledge. The Bible from the North Pole to remote island, God's word provides knowledge for wise decisions. So, you can be uh alone somewhere on an island. And if you have a Bible with you, you can make good decisions. You can get knowledge. Prayer, praise, and worship should lead us to obey the word and the key to the godly life. We're going to be looking at the scriptures this morning. I want to remind you of a few things. The Dead Sea Scrolls were found in the 1950s and they confirm the legitimacy and authenticity of the Bible and the scriptures. They were recently found in the in 1950s. Okay? And they were ancient writings of the scriptures. Second Peter 1:19 says, \"God and uh I'm sorry, God and Peter.\" It says, \"We have the prophetic word confirmed. No prophecy of scripture is of any private interpretation.\" Uh, we used to say that a little differently. I can't remember how they used to say it. I'm trying to remember. Uh, we have a more sure word of prophecy. That's all this is saying. Hey, the word has been confirmed. The prophecy is here. It's in the Bible and it's been confirmed. It's been confirmed by facts, by truth. Prophecy never came by the will of man, but holy men of God spoke as they were moved by the Holy Spirit. It's important for us to understand that yes, the Bible was written by man, but God spoke through them. Okay? God spoke through them and used them to write the scriptures. So, the scriptures aren't just uh written by man. They are the inspired by the Holy Spirit. I'm sorry. There's a guy I can't tell if he's in your car back there. Okay. Coming out of another car. Okay. Pardon me. I'm sorry. There's playing tricks on my brain. Last week in the two weeks prior, we're talking about the triumphs and the power of the blood. And that's why we sang the power of blood this morning. The power of the blood. We learned that the blood of Jesus Christ cleanses from what? All sin. There is nothing that the blood of Jesus cannot cleanse. It's that powerful. The blood of Jesus Christ makes us victorious over Satan. It says that they overcame Satan by the what? Blood of the lamb. The blood of the lamb is that powerful. The blood of the lamb saves us from what? The God's wrath. At the end, he's going to be upset that nobody responded or that people aren't responding to his word. And so, he's like, \"What are you guys thinking? What are you doing? I created you for this and you're doing that.\" He's upset. But you have the blood of Jesus Christ and it saves you from that. Amen. The blood has purchased us that cost. Jesus gave his life. It cost him something. There's nothing free going around. He purchased you. He paid for it by what? His blood. He gave up his life. And if we are now purchased by him that means we belong to him that we serve him and we follow him and when we don't do that we are saying to God and his blood I don't want it. Amen. Justified that blood justifies us. It reconciles us. Yes. Uh Adam at the beginning, the falling away, right? The falling away of man that we all were uh fell away. We've sinned and fallen short of the glory of God. Blah blah blah. I want to be close to God. And the thing that justifies me and reconciles me is the what? What is it? The blood. And by his blood, we are invited to know him. We can touch God. We can see God like they did on the mountain. And we can hear God. We can have a clean conscience by his blood. No guilt in our heart, in our mind. Of course, you know, if you're doing what's wrong, you're going to have you should have guilt. The Holy Spirit's like, \"Hey, that was dumb. Repent.\" But you can have a clean conscience. You don't have to walk around after you've asked for his forgiveness and his blood and his cleansing. You don't have to go around beating yourself up about everything. Okay? That blood is that powerful. Life is in the blood. We also understood that the life of the body, just like the life of the body is in the blood, the life of your spiritual man is in the blood of Jesus Christ. And you want his blood flowing in your spirit. And his blood works in you to change you. works in you to develop you, works in you to make you what he wants to make you. And what does he want to make you at this last part? He wants to make you what? A king, a queen, and a what? Priest. King meaning ruler. Okay, we have men and women, right? A king meaning you rule over the kingdom of darkness. It doesn't rule over you. You rule over this world. We have dominion. In Genesis, it says we have dominion over this world. The marijuana plant doesn't control us. The alcohol doesn't control us. All those substances, the cocaine, all no, it doesn't rule over us. We rule over it. Amen. And people are letting it rule over their lives and it's destroying people. They say that we have a crisis in America. fentinol and all these drugs, opioid crisis because people are letting these things rule over them. And that is not God's purpose. He wants you to be a ruler and priest. Yes, you can be a teenager, you can be a young person, you can be a young man, a young woman, you can be whatever you are and you can get cleansed by the blood and you can have access, a key be given to you to go into the holy of holies. Because in the scriptures, the only person allowed going in the holy of holies in the Old Testament was who? The high priest. And so God has made you a what? a priest because you can go into the holiest place by the blood of the lamb. Did you know that? So here we have a list of all these things, right? You see all these things, they are available to you. They are available to us. But many people will let them sit on the table and walk by them. And it's important that we don't let we we got to stop walking by the promises that God has for us. The blood of Jesus Christ does so much and is so powerful, but we can walk right by its capabilities for our lives. Amen. So, are you going to let it Are you going to walk by them? No. You're going to what? I'm going to grab them and apply them. Amen. So going back to the word, the Bible, the truth. You see, we get knowledge and we read this stuff about the blood. Where did we get that? We got that from the what? We from the Bible. Amen. We got it from the Bible. All this stuff about the blood came from where? The Bible. The scriptures, the you got to have knowledge of it. And when you get that knowledge, you get that word. It's in there. Allelujah. We're going to look at some natural things. The way that people look at how ancient books are measured. They look at the author. They look at the date that it was written. They look at the earliest copy since it was written or that the event happened. They look at the number of manuscripts that there are and the accuracy of those manuscripts. And so I have a a quack- quack up here, a duck next to a little chick. And you see which one is authentic, right? A little chick over there. He's authentic. He's the real thing. And it's the same way with the Bible. What is authentic? Ancient writings. Authentic ancient writings. We want to compare some ancient texts. Plato date was written, the date it was written was 347 BC. The earliest copies 900 AD. That is a big span. That's over a thousand years. The time Oh, yeah. It says right there, 1200 years. The time span from it was when it was written to the earliest copy was how many years? 1200. Easy, right? This is got it. There are how many manuscripts? Seven. Accuracy unknown. Homer, when was it written? 900. Earliest copy 400. That's how many years in between? 500 years. Oh, the answer's right there. How many manuscripts are there? 643. The accuracy is what? 95%. And we read they they will say the historians will say, \"Oh, Homer is the real thing.\" And everything they're writing about is it's historic. But then we come to the Bible, the New Testament. Here it is written 40 between 40 and 100 AD. Earliest copy is 125 AD. And the time span from when it was written to the earliest copy is how many? 25 to 50 years. The manuscripts, how many manuscripts are there? 24,000 and they are 99% accurate between the manuscripts and has nothing to do with the truth in them. just maybe uh misspellings, grammar slips of the pen. And so we see that the New Testament is the according to secular standards is the most authentic ancient writing in the world. Did you know that Old Testament very similar? We don't have as many uh manuscripts as we do the New Testament but still uh it was written from a th00and BC to 365. The earliest copy is in 300 BC. The time span is 100 years. There are thousands of manuscripts and the accuracy is 95%. It's an older book so you know we uh things are harder to come by. What can I say? But there are minor errors spelling slips of the pen but the Old Testament is still accurate. what we have today. And so the New Testament, the Old Testament, according to secular standards, according to what people find, look at ancient texts and say, \"Is this accurate?\" New Testament, the Old Testament are excellent ancient writings, the most excellent in the world. And you can have confidence that the book and the writing is what? Genuine, authentic, the real thing. And so when you get that Bible in your hands, you're holding something that is authentic. It's genuine. People, the folks that go look, the archaeologists, they will use what? The Bible to go and look up their finds and look at where does the Bible say it was at this time. Did you know that? And there's something else as well you don't remember. Uh, if you want more res sources on this, there's some YouTube videos. You can go find this on YouTube all day and they they show you all all day, all all night how authentic the Bible is. There's a man named Josh McDow. He made a YouTube video. Excellent. Uh there's a young man coming up right now. His name is Wesley Huff and he is showing how authentic the scriptures are. And uh it's very powerful to have that. You got to you got to know those things. It's important because when people tell you the Bible is just this or some man just spoke it or you know it's been uh uh changed so many times. It's not true guys. The New Testament is 99% accurate. It didn't change from one voice to the next. It's been the same. Okay? They're not changing the word all the time like the Muslims will say. It's not true. It's accurate. the scriptures are accurate. And so we want to know what the purpose of the Bible is. And the purpose in the Old Testament, the prophets from Genesis to Malachi, prophets foretold the Messiah's coming for 4,000 years. When you read Genesis through Malachi, if you let God open it up to you, he's got illustrations in stories. All those stories at some point are illustrating and foretelling of the Messiah. They're foretelling of the Messiah. Who's the Messiah? Jesus Christ. The New Testament was written so you may believe Jesus is the Messiah and may have eternal life through him. John 20:31. These are written that you may what? Believe that Jesus is the Christ, the son of God, and the believing you may have life in his name. It says it right here in the scriptures. This was written so you may believe that Jesus is the son of God. John 4:25, \"The woman said to him,\"I know that Messiah is coming who is called Christ, and when he comes, he will tell us all things. I know he's coming.\" And who's she talking to? She's talking to Jesus. And Jesus said to her, \"I who speak to you am he.\" Uh somebody told me yesterday that God spoke to women or revealed himself to women first. Who who told me that? Is that you? Yes. My wife was meant she was reminding me God revealed himself to women first. And she said he says clearly to this woman who he is. No, you know, no gray area. I who speak to you, I am he. Clear. Amen. It's important that we get away from this, you know, men are women better than women kind of thing or that uh women are subservient or secondass. It's not true, folks. Jesus Christ, he went right through and he spoke to the women. He loves women and men. The scriptures say there are neither fa male nor female in his eyes. He speaks to us. He loves us. John 9:35 Jesus heard that they had cast him out and when he had found him he said to them do you believe in the son of God? Uh this is talking about the man who was blind and he answered and said who is he lord that I may believe in him and Jesus said you have both seen him and it is he who is talking with you and the blind man is like where or no he's not blind anymore he got healed he got healed by who? Jesus Christ. And now he's talking to Jesus and he's like, \"Who's the guy who healed me? Who did it?\" And Jesus is standing there and he says, \"You have seen him and it is he who is talking with you.\" So Jesus is not mincing words. He's not confusing. He's saying, \"I am the Lord. I am the son of God.\" And he said, \"I believe.\" And he worshiped him. Actually, let me check this out. 9:35. Let me go back one slide. Uh 4:25. Okay. Yeah. So, the women got it first. Oh my goodness. For judgment. I have come into this world that those who do not see may see and those who see may be made blind. And so God is healing people. He's healing the deaf, the lame, and the blind here in this case because this blind man has been healed and he can see now. And we need to be healed of our blindness. We have spiritual blindness. Many people have blindness. They can't see the scriptures when they read them. They can't see the beauty. They can't see what God is saying. People are blind. They can't see how they're treating someone. and they can't see how they're affecting and behaving. They can't see it. They're blind. And they need Jesus Christ. You need Jesus Christ. You've got to get his word into you so you can give him an opportunity to open up your eyes. You don't want to go through life blind because you're going to fall into what? the ditch. If they follow the blind and the blind lead the blind and they both fall into what? The ditch. If you're following somebody who is blind, you think they're not because maybe they're a friend, maybe they're someone you love and you're following them. They're going to lead you where? In the ditch. You've got to follow and hear whose voice? Jesus. Above everyone else's. And that will be the solution that will be that will save you and I want I just want to express all of us in this room and a lot of people you know there's there's blindness in your life that you need God to open up to you. At some point in our lives, we have some blindness that needs to be opened up. And Jesus Christ is the one to do that. It's very important for us to come to him. That's why we come to him every week. We come to him and worship him. We gather unto him. So what? We can get that blindness open. We can get that hardness of hearing. You know, it's not like once you got once you see now that you see everything. You still need your eyes open to see the next thing. I mean, just because your eyes are open doesn't mean you you see in the Bible everything and understand everything. You keep you need to keep opening letting him open up your eyes. The purpose of the scriptures in 1 John 5:10, he who believes in the son of God has the witness in himself that this is the testimony that God has given us eternal life and this is life in his son. These things I have what written to you that you may know that you have what? Eternal life. These scriptures were written so that we would know that we would have eternal life. Do you know? Do you know? Are you just believing on one scripture or are you getting all those scriptures together and having a full understanding of your relationship and knowing Jesus Christ so that you can have eternal life. So important. John 5:24, \"Very truly I say to you, whoever hears my word and believes in him who sent me has eternal life and will not be judged, but has crossed over from life to death.\" See, when we uh believe, okay, remember belief is not just a a faith in your head. Belief is borne out. Faith, it says in the scriptures, the is the sub substance of things hoped for and the what? the evidence of things not seen. Okay. Many examples and people in the Bible showed the evidence of their belief, trust and faith in Jesus Christ. The evidence that the disciples saying that they believed in Jesus, what was their evidence? What was their evidence? No, the evidence of the disciples their the evidence their faith they followed him. Sorry, I guess that was an open question. They followed him. Disciple means you're following your listen. Your discipline to that person and their evidence is that they kept following Jesus. Yes, they follow they they scattered when he died but they kept following him. Amen. but has crossed over from death to life. And so when we put our trust and belief in him and we follow him, we have eternal life. And immediately in this life, you can cross over from death to life. And you don't have to be afraid. If you don't know if you have eternal life, you've got a problem. You got to put more of God's word into you. You got to seek God some more. Uh God, do I have eternal life? Yeah, of course. It's in What does the word say? You got to get that word into you. You don't want to live thinking uh all scared because you don't know what the scriptures say. And we want to know what the scriptures say so we can respond to them. If you there's something you're not doing, you got to respond to it so you can have eternal life and be in right right relationship with him. But has crossed over from death to life. Miss Winston crossed over from death to life. They wanted me uh they were concerned about Miss Winston and they wanted me to come and maybe pray over her or all that. But she had already prayed. It's important to understand that she had already prayed. She had already crossed over from death to life a long time ago. And so her death when her body died, it's just a transition from this world to the next. And we can be happy for Miss Winston. John 9:27, \"My sheep hear my voice. I know them. They follow me and I give them eternal life.\" There it is again. He's he's kind of selling a different part of this now. That my sheep hear my voice. Are you hearing his voice? Are we hearing his voice? Do we follow him? I give them eternal life. They shall never perish. Neither shall anyone snatch them from my hand. Don't you like that? Jesus is is is protecting you. He's backing you up. People trying to snatch you. Jesus says, \"No.\" Hallelujah. Thank God. Thank God we're not just subject to whatever jerk wants to destroy us. No. God's got a hold of us. He's not going to let anyone snatch us out of his hand. Thank the Lord. Luke chapter 1:3. It seemed good to me, having had perfect understanding of all things from the very first, to write to you an orderly account, most excellent Theophilos, that you may know the certainty of those things in which you were instructed. So the purpose of the scriptures was to lay out an orderly account of what had happened in Jesus's life that we may know the certainty. You see this book is available to you. Do you understand? Do you understand? We can have certainty. You have an authentic ancient writing. You have an authentic New Testament. You have that book. It is authentic. It's genuine. It's available to you. has got an orderly account of Jesus Christ, his life. You don't have to wonder. You don't have to guess. There it is. Jesus did many other things. John 21:25. If every one of them were written down, I suppose that even the whole world would not have room for the books that would be written. When I was a kid, they would give me reading assignments and I would be like this. You know, I was not interested in the reading assignment. I was interested in making something happen. You know, make doing something with my hands, throwing it to play with a ball, going to play outside, throw the throw the so ball at me. Let's play dodgeball. I want to dodge some something. I want to win at a game. Okay. I was not I didn't like, you know, when they put me at the schoolwork, it was like, \"Okay, yes, I'll read it.\" Uhhuh. Okay. Uhhuh. Can you imagine if there were a ton of books and we would have to read them all about Jesus? Now, on one end, it'd be great. Oh, we get all this detail. Oh my gosh, I love that. So wonderful. But on the other end, be like, uh, I can't get through all this. And the kids would be like, I'm not doing that. the teenagers just be like Jesus who so we have a book. Amen. And God has summarized it. It's the summary and it's amaz and it's it's it's got a lot in it. But the purpose of those scriptures are to give an orderly, genuine, accurate account of Jesus Christ. and what has been written down is enough for us to go off of and for us to believe and put our trust in him. Amen. Remember the gospels, if you didn't know, Matthew, Mark, Luke, and John are the Gospels, and they all almost are about the same thing. They're all talking about Jesus Christ, his coming on the earth, his death, his burial, and resurrection. It's the same story from different people's perspective. Okay? And they all talk in a different way and they confirm. So, not only is the New Testament accurate, but there's also in the New Testament four different people who are witnesses given an account of what is happening and they're confirming it the story. Some things are in one book that are not in another. So, that's one of the the nice things. because we get some nuggets that are in one, not the other. John 20:30, I'm sorry, Luke 24:27, beginning with the pro Moses and all the prophets, he explained to them what was said in the scriptures concerning himself. Amen. So again here the scriptures show us uh Jesus is talking about everything that Moses and the prophets said. We have the Old Testament, right? Jesus goes back to the Old Testament. He was showing them all the things concerning himself. You know Moses is an example of Jesus. When you read Moses, you got to think this is Jesus. What is he doing now? How does that relate to Jesus? How does that correlate? You got to let the spirit open it up to you. John 20:30, Jesus performed many other signs in the presence of his disciples which are not recorded in this book. But these are written that you may believe that Jesus is the Messiah, the son of God, and that believing you may have life in his name. And so that's why the Bible was written. We can have confirmation of what he did, what he did in his life, the miracles that he performed. Romans chapter 15:4, last but not least, whatever things were written before were written for what? Our learning for us to learn that we through the patience and comfort of the what? Scriptures might have hope. The Bible, the scriptures are meant to give us what? Hope. Amen. If the scriptures aren't giving you hope, you got a problem. Now, it may be because you know what the scriptures are saying and you don't want to do it and you're going to be like, \"Uh, yeah, there's no hope in the scriptures.\" Well, that's because you're not doing what it says, right? But if you obey it, if you follow it, hear it, and respond to it, there is great hope in the scriptures. Now all these things happened to them as examples, and they were written for our admonition, upon whom the end of the ages have come. 1 Corinthians 10:11, all these things happened to them as examples. You know, examples are very helpful. Uh I need examples in my work. Uh when I as a kid seeing examples when he's sharing uh the preacher was sharing a topic was helpful. An example at school is helpful. Right? Examples are very helpful. Amen. And those these examples in the Bible, Noah's flood, Sodom and Gomorrah, the Red Sea crossing, uh David's heart for God, they teach us how to live to the end of the ages. So important. Lastly, oh, how did I miss 2 Timothy 3:16 says, \"All scripture is God breathed and is useful for teaching and rebuking, correcting and training in righteousness so that the servant of God may be thoroughly equipped for every good work.\" And so this second Timothy, Paul, he confirms those scriptures. Does anybody have a Bible today? Anybody have a Bible with them? Can you hold it up? Who's got a Bible this morning? All right. Hold it up there. Hold it up. I got three Bibles today. Awesome. Hey, I'm just as bad. Don't worry. [Laughter] So all the words, all scripture is God what? Breathe. Useful for teaching and rebuking, correcting and training. Amen. So important. The Old Testament, we don't throw out the Old Testament. There's a lot of folks saying the Old Testament is no more. It's not true. Remember Jesus when he quoted when he would speak he quoted what? The Old Testament. He would say from the beginning God made them what? Male and female. That came from the Old Testament. Jesus is walking on the road to Amaze with those two guys as the scripture I just read. He said, \"I'm going to show you from Moses to the prophets all things concerning myself.\" He quoted what? The Old Testament. Let's not get rid of the Old Testament. Thank you, Beckham. I appreciate it. So, as a response this morning, let's respond. Take some time this morning, respond to his word, be a disciple. Amen. How many you want to follow Christ? Let's respond to him this morning. If I could have someone help me with this up here, you come grab it and that way I don't have to click. Light of the world, you step down into darkness. Open my eyes. Let me see. Okay. Could someone come and grab this, please? Anyone? Yes. Thank you so much. Right there. Go ahead and you can have you can sit back over there. There you go. There you go. And then see if it works. Does it work? So go forward. Oh, it's the Yeah, there you go. The arrow. Not Not the bunny. Come back over here. Let's see if this works. There you go. Oh, there you go. That next one. and back. So these two. Okay. Yes. That's right. You got it. All right. Will you stand with me? Let's take a moment here to respond to the light of the world. Amen. Hallelujah. Light of the world, you step down into darkness. Open my eyes. Let me see beauty that made this heart adore you. Hope of a life spent with you. Hallelujah. Let's lift up our hands. Here I am to worship. Here I am to bow down. Here I am to say that you're my God. You're all together lovey, allto together worthy, all together wonder. Oh to be. King of all days. Oh so highly exalted. Glorious in heaven above humbly pause for a moment just I'm sorry we want to encourage you this morning at this time we want to respond to Christ we're here to sing and give glory to him let's we want to take a moment here to concentrate on God gentlemen if you could please uh quiet down we appreciate it and we can save it for after we're going to have lunch and fellowship time in a minute. Okay. Appreciate it. Thank you. Let's give God glory and respond to him. King of all days, oh so highly exalted, glorious in heaven above. Humbly you came to the earth. You created all four of saint became poor. So here I am to worship. Here I am to bow down. Here I am to say that you're my God. You're all together love me. Allto together worthy. All together wonderful to me. Here I am to worship. Here I am to bow down. Here I am to say that you're my God. You're all together loveying. Allto together worthy. All together was wonderful to me. I'll never know how much it cost to see my sin upon that cross. I'll never know how much it costs to see my sin. upon that [Music] cross. Here I am to worship. Here I am to bow down. Here I am to say that you're my God. You're all together love. All together worthy, all together one to me. This time we're going to lift up our voices in one accord and pray that God will reveal his word unto us. We're going to commit to putting that word into us and that we're going to ask that God open that word up to us. Amen. Let's lift up our voices. God, we come before you this morning. Lord God, we commit, Lord, to putting your word into our hearts. We commit to putting the knowledge of your word into our hearts. God, we understand this morning that your word is genuine. Lord, your word is real. Your word is above all your name, Lord Jesus. And God, we commit this morning, Jesus. Lord, to putting your word in our heart, God and Lord Jesus, we pray, God, that you would open up your word unto us, God, that you would make your word real unto us, Jesus, Jesus, Jesus, Jesus. Lord, oh Lord, we thank you this morning, God, I commit myself, Jesus. Lord Jesus, pray right now, God. Lord, I commit myself to putting the knowledge of your word, Jesus, in my my soul, my spirit, in my mind, God. And I pray, Lord Jesus, that you would use that word, Lord, that you would use that word, Lord God, open up your word unto me. Open up your truth unto me. Open up your scriptures, God. Lord, please, Lord, I ask you this morning, God, we ask you this morning, Jesus. Jesus, Jesus, Jesus, Jesus, Jesus, Jesus, Jesus. Here we are to worship. Here we are to bow down. Here we are to say that you're our God. You're all together loveying, alltogether worthy, allto together wonderful to me. [Music] Let's reach our hand to our neighbor. Pray for one another this morning that God would do this work in us. The scriptures say that we can be born of God and we want to come to that birth where we are children. Let's pray for one another. God would give us the desire for his word to put his word into our hearts. Let's lift up our voices right now for one another. God, we pray for your people. God, we pray Jesus for one another right now. Lord Jesus, we ask God, Lord, that you would put a desire in our hearts this morning, a desire, Lord Jesus, to read your word, to obtain knowledge of your word, God. Lord, to put your word into our hearts, Lord Jesus. We pray that we would have a desire in our hearts to take up the promises that you have given us by your blood, Lord Jesus, that we would not let any promise pass us by, Lord Jesus. God, Lord, that we would take you up on your offer, Lord God. Jesus, we pray for one another right now. We pray for your church, Jesus. Transform our desire, transform our will, Lord. Transform Jesus, Lord. what is important to us. Oh God, please God, open up our eyes. God, open up our eyes. [Music] Holy, holy God Almighty, great I am who is worthy. None beside thee. God Almighty, great I am. [Music] [Music] [Music] [Music] this morning. If you have a special need and you'd like the church to lift up their voice and pray for you this morning, just as with their heads bowed or eyes closed, just lift up your hand right where you're at. If you'd like the church to pray and lift up their voices as a as a body, as united, just lift up your hand right where you're at. And [Music] uh if it's a physical need, a spiritual need, whatever it may be, just lift up your hand high. Let's bow and let's pray for one another again this morning. Let's lift up our voices together as a church. Those who are standing next to somebody with their hand lifted, just put your hands on them, let's lay hands on one another this morning. And let's lift up our voices for one another right now. God, we pray, Lord, for your church. God, we pray for your church. God, we pray for your people. Lord, we lift them up to you right now, God. Lord, we pray, Jesus, Lord, for your body, Jesus. Jesus, we pray, Lord, by your power, God. Lord, you open the blind eyes, Lord. You You heal the deaf ear, God. You heal Jesus the lame man, God. Lord, you have the power to do all of these things, God. Oh God, we pray God, let there be a performance. Let there be a performance, Lord, in today. Lord God, at this time, at this moment, God, let there be a performance, Lord, of healing. Let there be a performance of your touch. Let there be a performance of your freedom, God. Let there be a performance, oh God. Lord, of your hand, of your word, of Jesus, speak over us, God. Lord, touch us with your hand, God. Lord, move upon us by your spirit. Jesus, Jesus, heavenly father, we pray. We call unto you this morning, God. Lord, we lift up our voices. We pray for your church this morning. We pray for the needs, God. The hands that are lifted, Jesus, God, come with your mighty power, Lord. Come with your hand. Come, Lord Jesus. Jesus, Jesus. Heavenly Father, Father in heaven, Holy Spirit, we call on you. Jesus, Jesus, Lord, please. Lord Jesus, Lord Jesus, Lord, we pray for one another. Oh, you are the great I am. You are the great I am. You are the great I am, Lord. Oh, you are the great I am. You are the great I am. You are the great I am. Oh Lord. Yes, you are. You are the great I am. You are the great I am. You are the great I am. Halleluah. Holy, holy God Almighty, the great I am. You are worthy. None beside thee, God almighty, the great I am. [Music] Those online want to thank you for joining us. We trust you heard the word this morning. Do not let the blood of Jesus Christ and its power just pass you by. The scriptures have given us great promises by his blood. Don't leave them on the table. God wants to use God wants to do them in you. Take Jesus up on his promises. And this morning, we trust you heard the word to put the knowledge of the word of God in your heart that God may use it to transform you. Amen. Amen. Hallelujah. Thank you for joining us this morning. Those online, God bless you. Thank you. Live [Music] control to this city on a hill to a innumerable company of angels to Jesus Christ the firstborn. Amen. So we are here this morning to give him praise. The scriptures say when you come together bring a psalm, a hymn, bring a prophecy, a word of encouragement for the church. So those you uh keep that in mind. Please be willing to share what God has done in your heart, what the spirit is speaking to you during our times. Um in between songs, we have a time where you can worship and sing your own song. So we do this. Hallelujah Lord we thank you God. And that's your opportunity to sing your own spiritual song to Jesus. Okay? Just want to know that is your opportunity. We are giving you guys an opportunity. We are here this morning to meet with Christ as individuals. And that is our goal this morning. Our goal is not to sing uh the latest songs and have a concert. Our our goal this morning is to touch to to touch Christ, hear him, what he has to say to us, and give him glory. Amen. Amen. Amen. If you agree about that this morning, will you stand with me? And we're going to begin worship this morning. The scriptures say, \"Out of the mouth of babes and sucklings, I have ordained praise, strength to steal, to stop the enemy and the avenger.\" And no matter what's going on in your life, how old you are in God, how long you've been in a Christian, doesn't matter. It just matters if you are willing to give God praise. He will fight on your behalf. And we're going to start this morning with There is power in the blood. So let's sing this together. Would you be free from your burden of sin? There's power in the blood. Power in the blood. Would you or evil or victory win? There's wonderful power in the blood. There is power, power, wonder working power in the blood, in the blood of the lamb. There is power, power, wonder working power in the precious blood of the lamb. All right. If you believe in that power this morning, will you clap with us as we sing this unto him? Will you sing with all your heart? Amen. Would you be free from your burden of sin? There's power in the blood. There's power in blood. Would you or victory win? There's wonderful power in the blood. Oh, there is power, power, wonder working power in the blood of the lamb. There is power, power, wonder working power in the precious blood of the lamb. Would you be free from your passion and pride? There's power in the blood. Power in the blood. Come for a cleansing to Calvary. There's wonderful power in the blood. There is power, power, wonder working power in the blood. In the blood of the lamb. There is power, power, wonder working power. In the precious blood of a lamb, there is power, power, wonder working power. In the blood, the blood of the lamb, there is power, power, wonder working power in the precious blood of the lamb. In the precious blood of the lamb. In the precious blood of the lamb. in the lamb. Let's praise him this morning. God, we give you praise. We exalt you, Lord. We thank you. We thank you, heavenly father. We invite you right now, God. King of kings. Oh, king of kings. Holy is your name. We love you. We love you, Lord. We take the solid ground. I thank the master. Say, say, say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. Say, oh, say, say, say you believe it. Sing loud. Sing like a meaning. We know and we declare that Jesus is king. Some hope in what their eyes can see. We hope in the glorious sunse and returning [Music] king. Some are chasing the treasures of this world. We run to a glorious reward. The only name worth living for. Hallelujah. Say, say, say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. Oh. Say, say, say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. We set our hearts on what will last. Your word, your love, your faithfulness. Our hope is built on nothing less. We open wide our mouths to praise. Let this generation raise a song of freedom. All our days say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. Say say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. I believe I believe. I believe the kingdom of come. The king of son of God say the king of love. King of us. Oh I believe. I believe. Your kingdom come. Your kingdom come. Son of God. Son of God, the king of love. One more time. Jesus, I believe. Oh, I believe. The kingdom come. The kingom come. Son of God. Son of God. The king of love. The king of love. Say, say, say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. Say say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. Oh, I believe. I believe. Kingdom come. Kingdom come. Son of God. Son of God, the King of the King of Oh, I believe. I believe. The Kingdom comes. The King of God. Son of God. Son of God. King of love. King of S. Say, say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. Jesus is king. Hallelujah. Lord, we bless you Jesus. You are king. We praise you. We praise you. We praise you, Lord. We worship you, God. We exalt you. We exalt you, Lord. We worship. We thank the cheek. We thank our King Jesus. Thank you, [Music] Lord. We will dance. We will dance for your glory. We will dance for you. dance for your glory. We will dance for your glory, Lord. We will dance. We will dance. We will dance for your glory. We will dance. We will dance for your glory. We will dance for your glory. Lord, we will lift. We will lift up, shout to adore you. Every sound that we make is for you. We will dance for your glory, Lord. For salvation is in this place. You're the name by which we're saved. Jesus. Jesus. Let your name be lifted high as our thankful hearts now cry. Jesus. Oh [Music] Jesus, lift up, lift up your heads, you ancient gates, be lifted up, you ancient doors. The king is coming in. Oh, the king is coming in. We lift a shout to shake the skies. Lift up a cry. Be glorified. The king is coming in. For the king is [Music] coming. We will dance. We will dance for your glory. We will dance. We will dance for your glory. We will dance for your glory, Lord. We will lift up and shout to adore you. Through every sound that we make, it is for you. We will dance for your glory, Lord. For salvation is in this place. You're the name by which we're saved. Jesus. Jesus. Let your name be lifted high. As our faithful hearts now cry, Jesus Jesus, lift up your hands. Oh, lift up your head. You ancient ge lifted up to ancient doors. The king is coming in. Oh, the king is coming in. We lift a shout to shake the skies. Lift up a cry to be glorified. The King is coming in. The King is coming in. Lift up your heads, you ancient gates. Be lifted up, you ancient doors. The King is coming in. The King is coming in. Oh, we lift a shout to shake the sky. Lift up a cry. be glorified. The King is coming in. The King is coming in. We're the people of God with the song to sing. And we're bringing our lives as an offering. We will dance for your glory, [Music] Lord. And your cross is the hope that we hold up high. And we'll tell the whole world of your loving light. We will dance for your glory. Glory, Lord. Oh, we're the people of God with the song to sing. And we're bringing our lives as an offering. We will dance for your glory, Lord. Your cross is the hope that we hold up high. And we'll tell the whole world of your loving life. We will dance for your glory, Lord. Yes, we will dance for your glory, Lord. We will dance for your glory, [Music] Lord. We thank you, Jesus. We bless your holy name. We exalt the king of kings. Thank you Jesus. Thank you [Music] Lord. We worship you Lord. We exalt you. We worship you. Open wide you gates and be lifted up you everlasting doors and the king of glory shall come in. This is what the scriptures say. That's what this song is saying. When we lift up Jesus, when we lift up our God, the king will come in. And that's what we need in our lives. Amen. Amen. Amen. [Music] Lift up your heads, you ancient gates. Be lifted up, you ancient doors. The King is coming in. The King is coming. We lift a shout to shake the skies. Lift up a cry. Be glorified. The King is coming in. The king is coming in. I encourage you as we sing this next song. Let's worship him and lift him up together. Amen. We want to exalt him and invite him into your soul, your spirit right now. The scriptures say that we are the temple of the living God. Amen. Amen. And that temple means we are his dwelling place. He wants to come and dwell you, dwell in you right now. And he is dying to. He wants to. He can't wait. But he's waiting for you to come to lift up. He's waiting for you to open the door to [Music] him. What a beautiful name it is. What a beautiful name it is. The name of Jesus Christ my king. What a beautiful name it is. Nothing compares to this. What a beautiful name is the name of Jesus. We were the word at the beginning, one with God the Lord most high. Your hidden glory in creation now revealed in you are Christ. What a beautiful name it is. What a beautiful name it is. The name of Jesus Christ my king. What a beautiful name it is. Nothing compares to this. What a beautiful name it is. The name of Jesus. We didn't want heaven without us. Jesus, you brought heaven now. My sin was greater. Your love was greater. What [Music] could us now? What a wonderful name it is. What a wonderful name it is. The name of Jesus Christ, my king. What a wonderful name it is. Nothing compares to this. What a wonderful name is the name of Jesus. [Music] Death could not hold you. Hale tore before you. You silence the ghost of sin and grave. The heavens are roaring, the praise of your glory. For you are raised to life again. You have no rival. You have no equal. Now and forever, God, you reign. Yours is the kingom. Yours is the glory. Yours is the name above all name. What a powerful name it is. What a powerful name it is. The name of Jesus Christ, my king. What a powerful name it is. Nothing can stand against. What a powerful name it is. The name of Jesus. [Music] Oh, thank you. Thank you, Lord. Thank you. What a powerful word it is. What a powerful word it is. The word of Jesus Christ, my king. Oh, what a powerful word it is. Oh, nothing can stand against. What a powerful word it is. Power of [Music] Jesus. Oh, you are. Oh, God. You are alighty. [Music] At your word the world was formed. At your word the blind man sees. Oh at your word. Oh the deaf will hear. Oh, at your word the lame man walk. Oh, at the word the world was for at your word. At your word. The blind man sees. Oh, at your word. At your word. Death will hear. At your word. That's your Amen. Amen. What a powerful word it is. What a powerful word it is. The word of Jesus Christ my king. What a powerful word it is. Nothing can stand against. What a powerful word it is. The word of [Music] Jesus. Heat. Heat. [Music] Hallelu, holy, holy God Almighty. Great I am. Who is [Music] worthy beside thee? God almighty. Great. I am Oh hallelu, holy, holy God almighty. Great I am. Who is worthy? None beside thee, God Almighty. Great I am. The mountains shake before him. The demons run and at the mention of his name. King of majesty. There is no power in hell nor any who can stand before the power and the presence of great I am. Great I am. Great I am. Great I am. Great I am. Great I [Music] am. Hallelujah. Holy, holy God Almighty. Great I am. Who is worthy? None beside thee. God Almighty, the great I am, hallelu, holy, holy, God almighty, great. I am. Whom is worthy? None beside thee. God almighty. Great I am. You are the great I am. You are the great I am. You are the great I am. Let's say it unto him this morning. You are You are the great I am. You are the great I am. You are the great I am. Oh God. You are the great I am. You are the great I am. You are the great I am. Hallelujah. Lord. Oh, you are the great I am. You are the great I am. You are the great I am. Hallelujah. Holy, holy God almighty. The great I am. Who is worthy? None beside me. God almighty, great I am. Lord Jesus, we thank you this morning, God. Lord, you fulfill your word this morning, God. We are gathered in your name. It says when where where two or three are gathered, there you are in their midst. Jesus, Lord, the scriptures say that you inhabit the praises of your people. Jesus, Lord, we thank you. We glorify you. We exalt you this morning. We thank you, Jesus. [Music] Oh Lord Jesus, we wait on you. Lord, why do we wait? Because you have the words of life. Lord Jesus, why do we linger here and wait? Week after week, we wait in hope. A new Lord Jesus. I've been many other places, seen many to things. Many people looking around for some kind of hope, peace, strength. They look to manmade things or they look to man themselves. But God Jesus, you are above all else, Lord Jesus. That's why we wait. Lord Jesus, we need you in our lives, Lord God. Oh, we need your spirit in us, Lord God. We don't want to just talk about it. We don't want to just research it in history, Lord God. We need it in us, Lord Jesus. Oh, that we can reach out, that we can touch those around us, Lord God, with the fruits of your spirit, Lord Jesus. Oh, this is why we wait. How much we need you, Lord God. And we thank you, Lord Jesus, that you come. We thank you that you come when we humble ourselves. You come and we need you, Lord God. We thank you, Lord Jesus. And we ask for your continual continual visits in our lives, Lord God, that we can be one with you, Lord God, with your spirit, Jesus. Thank you Lord. You are the great I am Lord God. Oh Jesus. Yes Lord. Yes. You are the great I am. You are the great I am. You are the great I am. Jesus. Oh. You are the great I am. You are the great I am. You are the great I am. You are the great I am. You are the great I am. You are the great I am. Thank you, Lord. [Music] Lord Jesus, we thank you and yes, we agree this morning as you said in your scriptures with red letters spoken by your own mouth saying, \"Come unto me all you who are heavily laden and I will give you rest. I will give you life.\" Jesus, Lord, you are the key. You are the answer, God. And you have given us that access to you by the blood of the lamb, by the blood of Jesus Christ. And we thank you this morning. And everyone said, \"Amen.\" Do we agree with that prayer? We agree with that this morning. Amen. Amen. I've got a river light blowing out of me. Make slain to walk and a blind to see. of his prison and joy says the captive free. I got river of life going out of me. Spring up a well in my soul. Spring up a well and make me whole. Spring up a well and give to me that life abundantly. Oh, I got a river of life flowing out of me. Makes lines to see. Opens prison door sets a captive free. I got a river of life flowing out of me. Bring up a well in my soul. Bring up a well and make me whole. Bring up a well and give to me that life abundantly. Bring up a well. Bring up a well in my soul. Bring up a well. Bring up a well and make me whole. Glory of a well and give to me that life abundantly. And give to me that life [Music] abundantly. Hallelujah. You may find your seats this [Music] morning. Amen. Thank you, Jesus. Got a special song this morning. after our other specials. [Music] My uh I was just waiting for you guys to finish worshiping. My goodness, you guys are crazy as some out there. My goodness. I'm joking. I'm joking. That's wonderful. I'm excited. I'm glad to be with a bunch of worshippers. Hallelujah. Hallelujah. Amen. Yes. We are gathered in his name. Amen. We are gathered together for him. Hallelujah. This old man was a rebel yeller. Bad boy to the bone. He said you can't trust that other fell. He judge them by the tone of their skin. He was raised to think like his dad. narrow a mind full of hate on the road to nowhere fast till the gates of God got in the way. Then he saw the light in his knees and bride and said a prayer and rose up a brand new man and he left the old one right there. Woo! [Music] Here's to the strong. Thanks to the brave, don't give up hope. Some people change against all odds against the grain. Love finds a way. Some people change. She was born with her mother's habit. You could say it's in her blood. She hates that she's got to have it as she heals her glass up. She'd love to kill that bottle and all she can think about is a a better life, a second chance. Everyone she's letting down. She throws that bottle down. Here to the strong, thanks to the brave. Don't give up hope. Some people change against all odds against the rain. Love finds a way some people [Music] change. Thank God for those who make it. Let them be the light. Here's to the strong, thanks to the brave. Don't give up hope. Some people change against all odds against the grain. Love fights away. Some people change. Yes. Some people change. [Music] Some people change. Hallelujah. Amen. Amen. Thank you, Jesus."}