{"video_id": "_AVESG7LyYM", "title": "The Power of the Blood of Christ—April 6, 2025", "published_at": "20250406", "transcript": "Good morning. It's good to be alive and in the house of the Lord, gathering together to worship him. There's no greater joy than to know that we have a savior who paid an ultimate price that we could have life. But not just that we have life, but that we can follow the example that he set before us. that we be fishissures of men and we raise up a generation that will praise him and know him and take the kingdom further than we can in our generation. Amen. Because the last day church is going to be greater than the former. So, we're expecting great things from young people. Amen. Amen. Amen. Here we go. Oh, great and mighty is the Lord our God. Great and mighty is he. Great and mighty is the Lord our God. Great and mighty is he. Lift up your banner. Let the anthems ring. Praises to our King. Great and mighty is the Lord our God. Great and mighty is he. Oh, great and mighty is the Lord our God. Great and mighty is he. Great and mighty is the Lord our God. Great and mighty is he. Lift up your banners. Let the anthems ring. Praises to our King. Great and mighty is the Lord our God. Great and mighty is he. Oh, great and mighty is the Lord our God. Great and mighty is he. Great and mighty is the Lord our God. Great and mighty is he. Lift up your banner. Let the ends ring. Praises to our king. Great and mighty is the Lord our God. Great and mighty is he. Oh, great and mighty is the Lord our God. Great and mighty is he. Great and mighty is the Lord our God. Great and mighty. Great and mighty. Great and mighty is he. Oh, great and mighty is the Lord our God. Great and mighty. Great and mighty, great and mighty is he. Thank you Jesus. We bless you. We bless you by your power and your might Lord that we are we honor you. We honor you God by your power. Thank you Jesus. Great and mighty are great and wonderful. Thank you Jesus. [Music] Hallelujah. By his great and mighty power, we have all been changed. Amen. I've been changed by the power. Resurrection power that conquered death forever and won the victory. I've been changed by the power. Resurrection power. Even now it's working mightily in me. Oh, I've been changed by the power. Resurrection power that conquered death forever and won victory. I've been changed by the power. Resurrection power. Even now it's working mighty in me. Oh, I've been changed. I've been changed. I've been newborn. I've been newborn. I've been washed in the blood of a lamb. What a difference it's made since the gist in my heart. And now I'm changed. I've been changed. I've been newborn. I've been washed in the blood of the lamb. What a difference it's made since the Lord came to stay in my heart. And now I'm changed. Oh, I've been changed by the power. Resurrection power that conquered death forever and won the victory. I've been changed by the power. Resurrection power. Even now it's working mightily in me. Oh, I've been changed by the power. Resurrection power that conquered death forever and won the victory. I've been changed by the power. Resurrection power. Even now it's working mightily in me. Even now it's working mightily in me. Oh, even now it's working mightily in me. Thank you Lord. Thank you Jesus. You are wonderful. We praise you Lord. We thank you Jesus. We love you. We love you Jesus. It is a day of jubilation. It is a day of victory. It is a day for us to celebrate before our risen king. It is a day of jubilation. It is a day of jubilation. It is a day of victory. It is a day for us to celebrate before our risen king. for the grave it could not hold him. For in him there was no sin and by his resurrection like we now live in him. It is a day of jubilation. It is a day of victory. It is a day for us to celebrate before our risen king. For the grave it could not hold him. For in him there was no sin. And by his resurrection life we now live in him. And by his resurrection life we now live in him. Is a day of jubilation. It is a day of victory. It is a day for us to celebrate before our ris king. Yes, Jesus. Lord, you have done great things for us, oh Lord. And we come to honor you today and to worship you and to lift up holy hands and exalt the name of Jesus. For you have done great things, Lord. Oh, here of heaven, you've conquered the grave. Oh, [Music] Jesavior, you break every [Music] chain. Oh, hero of heaven, you break every chain. He's conquered the grave and broken our bondage and our chains and we're free in him. Let's praise him today. Oh hero of heaven, you conquered the grave. You free every captive. You break every chain. Oh God, you have done great things. We dance in your freedom. Awaken alive. Oh Jesus our savior. Your name lifted high. Oh God, you have done great things. Oh hero heaven. Sing it. Oh hero of heaven. You conquered the grave. You free every captive and break every chain. Oh God, you have done great things. We dance in your freedom, awake and alive. Oh Jesus, our savior, your name lifted high. Oh God, you have done great [Music] things. Oh come, let us worship our king. Come, let us bow at his feet. He has done great things. Oh, see what our Savior has done. See how his love overcomes. He has done great things. He has done great things. [Music] Oh hero of heaven, you conquer the grave. You free every captive. You break every chain. Oh God, you have done great things. We dance in your freedom. Awake and alive. Oh Jesus our savior. Your name lifted high. Oh God, you have done great things. You've been faithful through every storm. You'll be faithful forever more. You have done great things and I know you will do it again for your promises. Yes and amen. You will do great things. God, you do great things. Oh hero of heaven, you conquered the grave. You free every captive. You break every chain. Oh God, you have done great things. We dance in your freedom. Awake and alive. Oh Jesus our savior. Your name lifted high. Oh God, you have done great things. [Music] Hallelujah. Halleluah. God above it all. Hallelu. God unshakable. Halleluah. You have done great things. Halleluah. God above it all. Halleluah. God unshakeable. Halleluah. You have done great things. Halleluah. God above it all. Hallelu God unshakable. Halleluah. You have done great [Music] things. Halleluah. God above it all. [Music] Hallelu God unshakeable. Hallelu. You have done great things. Yes, you have Lord. And halleluah God above it all. Halleluah God unshakeable. Hallelu you have done great things. Oh hero of heaven. You conquered the grave. You free every captive and break every chain. Oh God, you have done great things. We dance in your freedom awake and alive. Oh Jesus our savior, your name lifted high. Oh God, you have done great things. We dance in your freedom, awake and alive. Oh Jesus our savior. Your name lifted high. Oh God, you have done great things. [Music] Oh God, you will do greater things. Oh God, you will do greater things. Oh God, you will do gater things. Hallelu God above it all. Hallelu God unshakeable. [Music] Hallelu. You will do great things. Thank you, Jesus. Thank you, Lord. Thank you for the hope that we have in you, that you will do greater things, Jesus, that we will do greater things, Lord. Even that which you live, you said, Lord, your church will do greater things. And we thank you, Lord. Worthy, worthy is the lamb. Worthy are you, Jesus. We exalt your name. You're worthy. Thank [Music] you. Praise the Lord. We have great expectation. We have great hope in Jesus. Hallelujah. Amen. This next song is a special and it is talking about the disciples crossing the sea with Jesus and it shows to us their humanity and their lack of faith. even though Jesus is in the boat. But it's a precious song and it shows how Christ will respond to our cries. Maybe not in the timing that we want, but he will. He will respond to our cries. Amen. Amen. Crossing the calm sea with Jesus, the disciples were getting concerned. The wind started violently blowing, but he was asleep in the stern. Oh, does he not care that we perish? were helpless and were so afraid. Jesus arose when they called him and said to them, \"Where is your faith?\" Cuz you prayed all night. Cuz you held on with all of your might. Child, your cries have awoken. the master. Oh, he knows your voice. Lift your hands. It's time to rejoice, child. Your cries have awoken the master. [Music] It hits you without any warning. The storm of your life had begun. Seeing no hope in the distance, you're frightened to know where to run. By now your vessel is filling and you're thinking that you'll surely drown. You cried out for help from the Savior. And you know that you can't give up [Music] now cuz you prayed all night. Cuz you held up along with your might. Child, your cry have awoken the laughter. Oh, he knows your voice. Lift your hands. It's time to rejoice. Child, your cries have awoken. The master, you're up there worried. He's fast asleep. The winds are so deadly. The water so deep. But you try to be patient cuz soon he'll bring peace. Just one word from his voice. It all must cease. Cuz you prayed all night. And you held on with all of your might. Child of Christ have awoken the master. Oh, he knows your voice. Lift your hands. It's time to rejoice. Cry on your cry. Have awoken the master. Cuz you prayed all night and you held on with all of your might. Child, your Christ have awoken the master. Child, your Christ have awoken the master. Child, your Christ have awoken the [Music] master. Thank you Jesus. Thank you Lord. You are the Lord. You [Music] are because you prayed all night. You held on with all of your might. Child, your cries have awoken the master. [Music] Amen. Come on and walk on the water with me. Come on and walk on the water with me. You will not fail. [Music] You will not fail. Amen. Let's sing that one more time. Come on and walk on the water with me. Come on and walk on the water with me. You will not fail. No, you will not fail. Come on and walk on the water with me. Come on and walk on the water with me. You will not fail. You will not fail. We will not fail. Amen. We will not [Music] fail. We will not fail. fail. No weapon formed against us will prosper. We will not fail. No, let me hear you. We will [Music] not. You may find your seats. And you guys are ready to worship. Waiting for the next song there. That's how we like it. I have to tell you to sit down. Okay, that's good. Amen. Amen. Uh and that story about the disciples in the boat, they had to wake up Jesus in the boat. And sometimes you got to wake up Jesus in your life. And uh his point is is that when you're with Christ, your boat's not going to sink and he's going to bring you through. Amen. We also know that the disciples, the apostles were persecuted, right? And the song says we will not fail. Those disciples were persecuted and they died. But the Bible says his word will never return void. And every work that the disciples did and the apostles did, there was a return. There was a a a growing, a growth. Amen. And that is that powerful growth that we entrust in God. Hallelujah. Um on Saturday at 12:00, Miss Winston passed away and we wanted to share that with you all. And uh we want to take a moment, lift up her family in prayer, that God would comfort them, that God would draw us all through her example, her sacrifice for the church and children. Um I had something Oh, it was in my bag. She had a check for offering in her purse and her sister said, \"Here.\" She was always looking for an opportunity to come and bring it to church and they handed me the check and her brother was there and I said I can't accept this and they said she would want you to have it. So I have her check and uh I I just thought that was very precious. You know the wonderful thing is that we can be glad for Miss Winston as she's walking and she's all healthy and fine now. Right. And uh we don't have to be sad. Uh she is doing great. She's like, \"Go back to earth.\" Oh man, why would I want to do that? I'm in heaven with Jesus. Amen. Amen. Amen. And uh we can be glad knowing that she responded. She followed Christ. A lot of us knew uh Miss Winston for many years. Her service to God. Amen. And the scriptures say, \"Precious in the sight of the Lord is the death of her saints.\" Amen. Amen. Amen. So, let's stop and for a moment and let's pray and lift up their family and uh that we would follow in her example. Lord Jesus, we come before you right now. Lord God, we thank you, Jesus, for what you did in Miss Winston's life. God, we pray, Lord God, for her family, Lord, that you would comfort them during this time. God, Lord, that you would bring to their hearts, Lord God, a comfort, a love, a a kindness from you, merc Jesus, whatever it is, God, that they need, Lord God, we lift them up and pray you right now that you would draw all of the family members under yourself more than they are drawn to you right now. God, we pray that you would touch them. God, we pray that you would speak to them, God. Lord Jesus, Lord, Miss Winston's example, Lord God, would would would desire that they come closer to you. And Lord, just like we all need to come closer to you, Jesus. Lord, we pray that you would do that by your power, by your spirit, Jesus. Jesus, Lord, we lift them up and pray right now that you would bring comfort, Lord God, that you would bring a change, a transformation. We thank you, Lord God. We thank you, Jesus. And oh God, we thank you for receiving Miss Winston into your kingdom. And everyone said, [Music] \"Amen.\" So uh we'll be finding out details of when when they'll be having the memorial and uh that will come. Okay. Uh I know it's going to be up near West Cavina, but then we may have it. I'm going to ask if we can have one here for, you know, the church to do for her so we can do one locally. Awesome. All right, let's get in the word. I trust you guys have a sheet there. Last week, we're talking about the blood. We saw the triumphs, as I called them, achievements, triumphs of the blood last week, and that the blood cleanses us from all sin. all sin having to do with u you know if someone thinks that they can't be saved because they've they've murdered someone or they've done something really bad Christ his his death on the cross his blood that was shed is more powerful than what you've done and if you're willing to repent and turn from your sin he can he will cleanse you amen Jesus Christ is that powerful we also learned about the scripture that says that by the bow of lamb we we can be victorious and crush Satan under our feet. And it's so important for us to dance, right? Hallelujah. Get that guy down there. Amen. We want to keep satan under our feet and the blood of the lamb does that. And we want to be thankful for that blood and give God glory. Dance, praise him. Amen. We are saved from the wrath, from hell. As we're talking about eternity right now, eternity is in our hearts. It's a big deal. And Miss Winston's gone on to eternity. All these questions we have about what is it going to be like and heaven and this and who's it going to look like and you know, is it going to be wonderful? Miss Winston's got the answers. She knows. No guessing for her. Uh it's a wonderful thing. The blood of Jesus Christ has purchased us. We belong to Christ. He is our Lord. The blood of Jesus Christ has justified us and reconciled himself. We can be made right in God's sight. And lastly, we finish with his invitation. By the blood of the lamb, we can enter the holiest. When Jesus died on the cross, the veil was rent in two. that that that barrier to the Holy of Holies, the the barrier from uh Gentiles into the temple and into the holy place and into the Holy of Holies is now open to everyone willing to seek him. And so that access has been given. A lot of us have been given the key, but we never go to the door. Amen. A lot of God is calling you from where you're at. And I'm talking to people online. I'm talking to people that may hear this message in the future. What are you doing with the access that God has given you by his blood? Hebrews chapter 10:19. As I was saying, having boldness to enter the holiest by the what? Blood of Jesus Christ. by a new and living way which he consecrated for us. Let us draw near with a true heart. My goodness. I mean, just hear that word. Those are the scriptures. Let us draw near. Again, we've been given that key. We are we are given that wonderful access to Christ. And we can have full assurance of faith when you walk in. You don't have to be, \"Oh, God, he wants to kill me with his lightning bolts and you know, he hates me and I'm a flee on the dog.\" No, you can come in. Yes, I've made mistakes, but I can come in with faith and say, \"The blood has covered me. God, I want to know you. God, I want more of you.\" You know, it doesn't mean that you come in with pride and proud like you're something that you're not. No, the blood has justified you, reconciled you. You come in humbly, and give God glory. Amen. Amen. But now in Christ Jesus, you who once were a far off have been brought near by the blood of Jesus Christ. Isn't that beautiful? We've been brought near by the blood of Jesus Christ. And so we can accept his invitation through prayer, through praise, through reading his word, seeking him. He will come and touch us, meet with us and talk with us. So important for us to understand that we can have relationship with Christ. But it doesn't happen. It doesn't happen by doing nothing. Amen. A few examples there. I'm only going to mention one example today, but Daniel, he got down on his knees three times a day and prayed and gave thanks before his God. See, Daniel was in the Old Testament before the New Testament even came, before Jesus Christ came and died on the cross and rose from the grave, Daniel was already praying. He was already seeking God. Daniel actually sought God for uh to to to save him and his friends and and other people sinners from destruction from the king when the king had a dream and he was going to kill everybody because they didn't know what it meant. But he got on his face and sought God with Shadrach, Meshach, and Abednego and they found the answer. You see, they heard God's voice. See, that's that's the beautiful thing. They sought God. They exercised principles of the New Testament and they heard God's voice. He gave them revelation. Daniel chapter 9:3, I turned my face to the Lord God, seeking him by prayer. Lord, hear me. Lord, forgive me for your own sake. Um, it doesn't talk a lot about Daniel going and sacrificing animals. You see, he's in the Old Testament time and here he is. He's praying. He's asking for mercy. He's praying and asking for forgiveness. He's in a place where the temple isn't there, right? He's in a place where he can't follow all of the the the Old Testament law. So, what does he do? He seeks God. He's praying. He's lifting up and praising the name of Jesus. He's fulfilling the New Testament before Jesus and was Jesus died on the cross and rose from he was already doing it. David too. And that's that those psalms are so powerful. They're so powerful even today. Written thousands of years ago. January 12, chapter 12 verse two. Many of though many who sleep in the dust of the earth shall awake, some to everlasting life, and those who are wise shall shine like the brightness of the sky. It's important uh bring this up because a lot of Jews don't believe in a resurrection. There's Sadducees that do not believe in the resurrection. And uh here Daniel in the Old Testament is talking about how people will awake and some to everlasting life. You'd understand that. And I bring this up because you have Jews that are saying this is not going to happen, but their own prophets are saying it will happen. Amen. Powerful. And so we als uh we're going to finish out today the other things that the blood does in Hebrews chapter 9:14. And how much more shall the blood of Christ who through the eternal spirit offered himself without spot to God cleanse your conscience from dead works to serve the living God. And so people come and we carry guilt. We carry guilt in the of the past of our our life in the past. Uh and Jesus Christ by his blood has has the power to wash all of that away. You don't have to carry your guilt. You don't have to carry all your shame. Jesus Christ, his blood, his death on the cross has the power to cleanse all of that. And so again, if we're willing to repent, confess, and admit, it's done away with. It's a race. People may try to bring it up back up to you, be like, \"Don't you remember when you did this to me, but Jesus has already cleansed it and forgiven it. Now they have to forgive you and you got to forgive yourself.\" You know, when I've made state mistakes in the past and sometimes over, you know, little things with my kids and I'm just like, I beat myself over the head later. I'm like, \"Oh my gosh, I was so stupid.\" You know, I'm driving, I'm like, \"Man, that was so dumb. God, forgive. I asked for forgiveness 10 times already. And finally, God's like, Mike, I forgave you. Okay, you got to forgive yourself now. And you got to forgive yourself. Move on. Do better the next day. Amen. Amen. So that blood is very powerful. It's an inheritance. It's a promise. And we want to take God up on his promises. We want to take God up on what he has given us to inherit. And we don't want to let God's promises pass us by. You got to reach out. And you got to grab them. If you're carrying the guilt, you don't need to. You can come to Christ. You can come to his blood. His blood is so powerful. See this word, these scriptures are so powerful because they give you knowledge that the blood does these things. And when you come to Jesus and you say, \"Okay, you said this, God, I ask you to do it.\" He will do it. Amen. Acts chapter 24. This is Paul and he is uh speaking before the king uh Agria. And in this scripture, he says, \"Have hope in God, which they themselves also accept that there will be a resurrection of the dead, both of the just and the unjust.\" So Paul is confirming here, the resurrection, right? Just like Daniel, he's confirming what Daniel said. There's going to be a resurrection. And this being so, I myself always strive to have a what? conscience without offense toward God and men. And so we can have a clear conscience. Paul had one. And if your conscience isn't clear, you can get into back a clear conscience state. Amen. You don't want to live like that. I don't like living like that. I don't like stuff on my, you know, clear my conscience. And I and uh I'm always I'm always doing stuff against Stephanie and I got to tell her sorry. My conscience is not clear. And now and now my wife [Laughter] too. The next one in Hebrews chapter 13:20 we find that Christ by his blood is working in us. May the God of peace who brought up your Lord Jesus from the dead, that great shepherd of the sheep through the what? The blood of the everlasting covenant make you complete in every good work to do his will. And let's say this together, working in you, working in me. Amen. What is well pleasing in his sight through Jesus Christ. See, these scriptures, they all confirm, they all reiterate, hey, we've got to do uh stuff that is pleasing to God. When you go about your life and you're making your decisions and you're acting and uh behaving a certain way, think to yourself, is this the work God is doing in me? Is this the good stuff he wants me to do? You know, when you're yelling at your wife, when you're neglecting something in your family, hurting your kids, hurting your spouse, is that the work? No. Amen. He wants a transformation. That song, I can only imagine uh powerful song. If you know the story, this uh teenage boy grew up and his dad was horrible to him. He he absolutely had a horrible relationship with his dad. His dad was a jerk. I think he was a drunk and he was just awful to him. And then his dad found Jesus. And his dad had a complete transformation. And after that, this young man, Bart, he wrote this song and he said, \"If my dad can get I I can't remember his statement, but he was so impacted by the transformation in his father and his father died of cancer.\" And this song is what he wrote for his father. I can only imagine because he believed that that power of Jesus Christ, he saw it in his father's life. He saw that transformation and he knew he was going to be with God. Amen. And we need that transformation in our life. We want that power of the blood, the power of Jesus Christ working in us. And that is a promise that he has for us. And we've got to take Jesus up on his promises. We got to take them up on what our inheritance is. Remember, these things are laid out for you. You don't have to accept them. You don't have to go and get them. Remember that key has been given to you, but you if you never use it, you've neglected to let it change your life. These things, him working in you, you've got to get involved in the process. and let God keep working in you. You know, you can go to God and say, \"God, I don't feel you working in me. I don't know what this scripture is talking about. God, I need you to start working in me.\" You can't we can't just go about our days and just for, you know, go to church. All right. Next, what's the next thing? No, we want to every day. You got to put That's why it's important to put his word into you. Every day, every day, take time for God. And this word is very powerful. Philippians 4:13, I can do all things through Christ who strengthens me. Confirming that Christ is working in you. Amen. We can do all things through Christ who is working in us. And what is he working in us to do? He is working in us to say no to sin, to say no to the temptations and the lusts. He is working in us to compel us to read his word, to know him, to spend time with him. That's what he wants to work in us to do. It's very simple. The greatest thing that we can do is to love who? God. Love God with all your heart, mind, soul, strength. Amen. That means you got to use your body. You got to kneel. You've got to open your mouth. You use everything, your thoughts, your emotions. You use all of that to love God. And when you take time for him, when you come to his house, when you fast, when you pray, when you praise, you worship, you put your his word into you, you are loving him. Because you see, when you don't do that, it means you don't care. You're telling God, \"I don't care.\" And I don't know if you've ever been in a relationship before, but when the other person acts like they don't care about you, does do you feel love? No. It's the same way with God. So, let's start caring about God. Amen. Let's start treating him like we love him, spending time with him. Hallelujah. We could all do better in these areas. Amen. And then loving our neighbor. Of course, God wants to change us, work in us to love our neighbor. And in every church, in every denomination, you can find people who have set their heart to seek God, to love him, regardless of the denomination, and they obtain these things. They live for God because God will come to anyone who seeks him. You're not special because you went to a certain church. You're not special because you came here. You're not special because you're Catholic. You are special when you seek God, love him, and have a meeting with him and are changed and transformed by Christ. And we encourage you, this promise is us for is for us now. It's an inheritance for us now. It is a promise for us now. The next thing that the blood do blood does is give us life. In nature, we know that blood is the life of the body. Leviticus chapter 17:11, the life, the life of the flesh is in the what? Blood consistent with science. Amen. As you read the Bible in the Old Testament, you're not going to find a lot of stuff that is inconsistent with science. Okay? Adam and Eve they got married and they had a child right this is that nor that and that keeps happening right now what we don't see are the healing of No I'm sorry Jesus forgive me I didn't say that what uh is uh the supernatural is what you know scientists can't deal with but God remember is outside of all that but anyway getting back to the blood. Stay on topic. The blood is the life of the the life of the flesh is in the blood. Uh this is the when you donate blood. I found this picture. It says give blood, give life. See, even they say it right there. Give blood, give life. Uh the blood pumps from the heart uh throughout the body. We got people that know this really well because they're dealing with heart issues and the the blood is pumping throughout the body. It's very important that we get blood to the brain, everything. Amen. Blood is life. And so, he's working in us by his blood. Think about that. Jesus died on the cross. He shed his blood. Not only does it cover us, but it goes in our spiritual body. Amen. It's in our spiritual man. 1 Corinthians 3:76. Do do you not know that you are the temple of God and the spirit of God dwells in you? It dwells in you by that blood. It's it's uh transfused. Amen. And naturally, we have genes from our parents. If you look up the DNA and by the blood of Jesus Christ, we have his characteristics, his nature, his genes. And that's what that blood does. I got a picture here of a family and they had a baby and their genes are in that baby, right? Uh when you have a child and they grow up, you're like, \"Oh, that kind of looks like me right there.\" And uh as they're around you, they take on your characteristics. And so you want to be around Christ. You want to put yourself in relationship with Christ. You want to have his blood, his DNA in your spiritual man. Amen. And that's how he works in us. That blood working in us, it's so powerful. First Peter 2:22, what are Christ's genes? What are Christ's characteristics, his behaviors, his nature? What does God Christ do? Uh it says, \"Who committed no sin, nor was deceit found in his mouth.\" He wasn't going around deceiving people. He wasn't going around lying. He wasn't trying to trick people into believing in him. He spoke what? The truth. That's right. He said to Pilate, \"I have come to bear witness of the truth.\" And he committed no sin. So, we want to start taking on these characteristics. Amen. If you find yourself becoming more of a liar, you know that you're not getting closer to Christ. You're not taking on the nature of Christ. If you're becoming more sinful, you're not taking on the nature of Christ. See, all my man, this is so good. I'm just realizing this right now. Confirmation, more confir almost every all these scriptures. Hey, get away from that lifestyle. It's not just about believing and trusting. God is working in you. He wants his nature in you. He wants you acting like him. And yes, we don't always live up to it. You know, sometimes we curse people out. Yeah. Okay. I I forgive me, God. Cleanse me. Now, get up again and get back to the goal that Jesus What's the answer? Jesus. John 4:34 Jesus said to them, \"My food is to do the will of him who sent me and to finish his work.\" See, these are Christ's characteristics to do whose will? God's will. And to finish his work. You see, there is a work that God wants to do on earth. There is a will that God has. And so when we take on the nature, when he puts his blood into us, that inheritance, uh we can start getting active and doing what he wants done. He wants to spread his word. He wants to make disciples of all nations. He wants to do a change in your life. I was talking with uh Miss Winston and her family and they were talking about how she had a transformation when she was young. When she went to the vine, she changed. She was a hippie dippy doo and she was dippy doing the wrong thing. And when she came to Christ, she had a transformation and we can start getting transformed to do the will of God. God wants to transform you so that you can bring people to himself. Jesus says, \"I would that all what what's the scripture? I wouldn't that.\" Who had it? That any should perish? That's right. Amen. Hallelujah. I am not willing that any should perish, but all come to the knowledge of Jesus Christ. Repentance. Yes. Amen. 1 John 3:9, \"Whoever has been born of God does not sin, for his seed remains in him and he cannot sin because he is born of God.\" And so this blood, are we born of God? This blood will birth us. And so when we are born of God, we're not sinning habitually. Yes, we make mistakes and we can turn from it. John 8:31 says the this Jesus then Jesus said to those Jews who believed him, \"If you continue in my word, you are my disciples indeed and you shall know the truth and the truth shall make you free.\" And so as a Christian, you want to come to birth. You don't want to be stuck in the womb, the spiritual womb. Amen. You want to grow a to be born. And how do we do that? It says if you what? Continue. That means keep putting in put it in you. You got to know what it says and then you have to respond to what it says. Amen. If you continue in my word, you are my disciples indeed. You shall know the truth and the truth shall make you free. Get me out of the womb. Right. Take your first breath. Start reaching those hands out. Start grab. You see the baby in there is like this. Uh, can't breathe. I mean, he's breathing through mama, but you know, not crying, can't see. Eyes are closed. There's a lot of restriction. But when they're born, things start happening and you grow. Your eyes open. And it takes time, but over time, uh, babies grow into you right here. Amen. And so uh we were sharing with people yesterday, no Friday. Yes. And uh sharing you know how to receive Christ and pray and invite him into your life. But if we don't follow up on that, if you don't follow up on that prayer, if you don't follow up on your relationship with him, you may not come to full birth. You may not come to full growth. And you don't want to be spiritually aborted by your temptations and by worldly lusts. Amen. We want to keep growing. So that blood is powerful. It'll keep you growing. Continue in his word. His word will bring you to birth and it'll keep grow you growing in your life. Become a disciple. Matthew 7 21. Not everyone who says to me, Lord, Lord, will enter the kingdom of heaven, but the one who does the will of my father who is in heaven. So, we have that continual goal, that that thing that we need to reach for, right? We don't want to just settle for believing in Christ. Not everyone who says to me, \"Lord, Lord, I I believed in you. I prayed. I had faith in you, but Jesus like, you didn't do my will. My will is that you keep going. My will is that you Yeah. Yeah. I'll cover you, you know, but you got to you got to keep you left me. You didn't want any part of me. You accepted me and then you left me.\" Amen. Philippians 3:12, Christ Jesus has made us his own. Uh I press on toward the goal for the prize of the upward call of God in Christ Jesus. So Paul is reminding us, hey, there is a upward call. Amen. Lastly, I think this is the last one. Revelations chapter 1 verse 5. To him who loved us, washed us from our sins in his what? Blood and who has made us kings and priests to God and his father and to his God and father. To him be glory and dominion forever and ever. Amen. Revelations 5:9. They sang a new song, saying, \"You are worthy to take the scroll and to open its seals. You were slain and have redeemed us to God by your blood. Out of every tribe, tongue, and people, and nation, and have made us what? Kings and priests to our God. And we shall what? Reign on earth.\" You see again goes back to that access the key that we've been given to enter in the holiest. The blood of Jesus has given us a key to enter the holiest. We have been given access. God has made us priests. Remember who can go into the holy of holies? The high priest. God has made you a what? priests by what? His blood. Man, gosh, what an identity God has given you. What a great uh uh job description. My goodness. I can go in. I can be a priest. Yes, we can. I don't need to wait for the guy up in the front. Who is he? Get rid of him. I'm joking. Be nice to me, please. No, you can go right in. Amen. You can go in at your house. You can be a priest in your home. You can go into the Holy of Holies, the holy place. You can meet with your God. Exercise those principles. Remember, the tabernacle of Moses is just a blueprint of the things that we do today. It's a pattern. And that's right. And there's a fulfillment of that pattern. And and praising God, worshiping is so important. I encourage you. It's it's so vital. I know I say it like almost every Sunday because it's so important that we do it. These scriptures on the wall. I'm not just sharing so that you know because Vine Cluster wants you to do this. No, you have an identity. You're a priest. You're a minister. You have this potential. You have this inheritance. You have this thing laid out for you. And you can know God. You can experience God. You can hear God. You can touch God. But you've got to take it up. Nobody can do it for you. Christ isn't going to do for you. We can't do it for you. And not only can we be a priest, but we can be kings. And the ladies are like, you we can be rulers. Not just talking about the men. We can reign over the sin. We can reign over the desires. We can reign over the things that want to reign over us. Amen. There's a lot of people that the they let drugs reign over them. They let the alcohol reign over them. They let a lot of things reign over them. And that is not that is not God's will at all. Remember in Genesis he said that the world has been created for that we may have dominion over it. Right? Why don't why does it have dominion over us? God has made you by his blood a king, a queen. Not so that you could say I'm in charge or listen to me. I'm in judge. I'm a king. No, you're not a king because you've been called one. You're a king because you have the results. And the results of a king is that you are ruling over the things that want to rule over you. You're not a queen because you have been given the title. You are a queen because you have the results. Amen. Your title that God has given you is is wonderful, but you can't be thrown around titles. No, I'm a king and you don't have any control over your mouth. You have no control over your behavior. You have no control. You're not a king. You're not a queen. I'm sorry. You're not ruling over everything. Everything's ruined over you. But God's purpose, his goal in your life by his blood is to bring us to this reigning and ruling. Amen. And so we don't want to just wait for the rapture just believing and a hold on for the rapture. This is bigger. There's a higher greater goal that God has for us. In Ephesians 5:27, the ultimate beautiful thing that God wants to bring us to, he that he might present her, who's her? The church, the bride, to himself, a glorious church, not having spot or wrinkle or any such thing, but that she should be holy and without blemish. But I've made mistakes. Yeah. Get the got the blood. You got the blood right there. Let's get it done. Well, up we go. Keep going. I messed up again. Hey, I got the blood. Get going. Revelations 7:14. These are the ones who came out of the great tribulation and washed their robes and made them white in the blood of the lamb. Isn't that kind of Isn't that like a That's a mind twister right there. He made their garments white with the blood of the lamb. What are you talking about? Because I mean, if you wash something in blood, it would be what? Red. But his blood makes you what? White. Pure. Yes. You can be those people with those right white robes. I want to be one of those. I want to have a wedding garment on. I don't want God saying, \"Where's that guy got no garment on? Where who is he? Get him out of No, I got my garment.\" Amen. Miss Winston's got her garment. Hallelujah. little uh thing here may not notice these are ones who came out of the great tribulation. Uh he's talking about people that have been washed white by the blood of the lamb come out of the great tribulation. They came out of the great tribulation. That means they went through it. means they were still on earth. And uh these scriptures imply that we may be here during that tribulation. And how else are people going to hear the gospel? God has chosen his church to share, to bring people to himself. Amen. And so if he takes everybody out and all left is a bunch of sinners, he still wants to reach those people before the end. I mean, he's he's like waiting till the and he's he's like, \"You still got time. You still got time. You can change.\" I remember in the Revelations, I just read it. He says they still wouldn't repent after seeing all of this. They still wouldn't repent. They still wouldn't repent. But there's people that will. And we're gonna, you know, God, it also says that he's going to seal us before all that. And I I'm sorry. I haven't done a lot of study on it. I don't want to get into it. Everybody be like, \"That's not true.\" Okay, let's We don't want to fight about it. But just bringing out a scripture here. We may be dealing with some things. John 16:33, \"These things I have spoken to you that in me you may have peace. In the world you will have tribulation, but be of good cheer. I have overcome the world. So Jesus confirms this. He's saying, you're going to have tribulation. You're going to have trouble. You know, let's not think that just because you came to Christ now everything's a bed of roses and glorious and rays of sunshine and angels flying about. And they are. But and you've come to Mount Zion, the city on the an innumerable company of angels, right? Yes. But there's still a battle. There's still a battle that we've got to fight. Amen. Romans 3:21. To him who overcomes, I will grant to sit with me on my throne, as I also overcame and sat down with my father on his throne. So again, these scriptures all draw us. They confirm and they keep saying, \"Hey, go higher. Hey, you can overcome. Hey, it's not just sit back and believe. Hey, there's more to be done.\" [Music] Amen. On this hang all the law and the prophets. Love God with all your heart, soul, and strength, and love your neighbor as yourself self. So, it's important that we be faithful to God. Be faithful to our family. Love our family. Love God. And we learned how to do that. And if you don't know, keep seeking God and how you can do that. We don't have to go drinking, drugging, and partying, and hurting our family and her uh and sinning against God. Amen. We've got to start caring about his will. That's how we can love God. Hey God, what do you want? What do you want for my life? What do you want to happen in other people's lives? That's his will. He wants to reach people. And so we have the triumphs of the blood. We can be cleansed from all sin. All sin. We when we come in and we think that there's nothing that we can do. It's not true. God cleanses us from what? All sin. God by his blood. Jesus Christ by his blood has made us victorious over who? Satan. So our excuse of uh Satan is really hurt uh you know Satan's been chasing me, Satan made me do it. All this stuff. Ah we got that blood. Remember it's laid out. Let's just imagine, you know, uh you got a table. You got table with with 10 things ready for you to take and to use and you just walk away and you let them go. These things are available to us that he will cleanse us that we can be victorious over Satan. It's there. It's available for you. We can be saved from the wrath. We like that one. Yeah, I accepted Jesus. I don't want to go to hell. I love you, Jesus. Or I I believe in you. Uh goodbye. says he has purchased us by his blood. We want to make him lord of our lives. He's justified us. Ephesians 1:6 says we are accepted in the beloved. You know, somebody who's a murderer or the prostitute, they come in, they get cleansing, they get changed and transformed. They're accepted in the beloved. Amen. Reconciled. Jesus by his blood has invited us to know him. Says that all shall know me from the least to the greatest. We can touch God. We can see God as the Moses did. We can have some vision for what God wants in our life. We can hear his voice. That blood will cleanse cleanse our conscience. We don't have to live in guilt. Amen. How many want to live in guilt? I don't want to live in guilt. I don't want my hand. Hand down. No guilt. The life is in the blood. Gives us access to his divine nature. His royal blood throws through. There's a there's a ch song called child of the king, old song. And she says, \"His royal blood now flows in my veins, and I, who was wretched and poor, now can sing. Praise God. Praise God. I'm a child of the king.\" Right? Because of his blood. Amen. He works in me by his blood and we can be kings and priests. Reign and be ministers now by his what? By his blood. Lastly, being confident of this very thing that he who has begun a good work in you will complete it until the day of Jesus Christ. Amen. Jesus Christ wants to bring us to completion. Jesus Christ wants to finish the good work that he began in us. And God has given us a great salvation. Hebrews chapter 2:3. How shall we escape if we neglect so great a salvation? The powerful blood. This is just the blood we're talking about. We're not even talking about the resurrection. We're not talking about all the other stuff that he has for you. Just the blood. The blood of Jesus Christ does all of this. And it's available for every one of us. Amen. It's available for every Jew, every Gentile. Now, I'm not a Jew, so I need this. I need this access. I'm glad it's available. Aren't you glad it's available? So God wants to take us through these stages of growth. And so no matter where you're at, the question is, will you continue to seek God? Will you continue to seek God to do his will? to say no to sin, to start caring about what he wants for your life, to say no to deceiving others, and to say, \"Hey, I want to do God's will. I want to do God's work.\" Amen. Amen. How many want to know him? We want to know him. So, will you stand with me and we're going to take some time this morning and we're going to respond as children of God. Amen. And let's we're going to sing this unto God. And then we're going to invite you to come on down and seek God as Daniel did, as David did, as many people in the Bible did. I want to be I want to be counted with those. Don't you? As Michael did, as Bobby did. Amen. Who am I that the highest king would welcome me? I was lost but he brought me in. Oh his love for me. Oh his love for me. [Music] Who the sun sets free? Oh, is free indeed. I'm a child of God. Yes, I am. At last, he has ransom me. His grace runs deep. Why? was a slave to sin. Jesus died for me. Yes, he died for me. Thank you, Jesus. Thank you, Lord. Who the sun sets free. Oh, is free indeed. I'm a child of God. Yes, I am. In my father's house, there's a place for me. I'm a child of God. Yes, I [Music] am. So, let's take Jesus on on his promise. The inheritance that he has given for us. He has made us children of him by his blood. Amen. He has made us. We are related to him. You have his blood flowing in our veins. So let's come forward seeking him and let's lift up our voices together and let's thank him. Let's invite him right now. Jesus God, we come before you right now. We lift up our voices, God. Lord, you have given us access, Lord, as ministers. We can be priests, God, Lord, to hear what you have to say to your people. God, we pray, God, Lord, that we might hear your voice this morning, God, we pray, Jesus, we have given, we give you all the glory, all the honor, Lord God. Jesus, Jesus, we thank you, Lord God. We lift you up, Lord God. You are excellent. You're powerful. There is no God like you, Jesus. Jesus, we thank you, heavenly father. Oh king of kings and lord of lords, almighty god, thank you Jesus God. Oh God, we thank you for that access. We thank you for all of these things you have given us. We thank you for the inheritance. God, we thank you for all of these potent these things that we can have access to. Jesus, we thank you for your promises. Oh God, we want more of you, oh God. We want more of you, Jesus. Jesus. Jesus. Jesus. Jesus. We want more of you, Jesus. I am chosen, not forsaken. I am who you say I am. You are for me, not against me. I am who you say I am. I am chosen, not forsen. I am who you say I am. You are for me, not against me. I am who you say I am. Oh, you set me free. I am free [Music] indeed. I'm a child of God. Yes, I am. In my father's house, there's a place for me. I'm a child of God. Yes, I am. In my father's house, there's a place for me. I'm a child of God. Yes, I [Music] am. Yes, I am. [Music] Oh, as we continue here. I want us to take God up on that offer that he has given us access to the holiest. And right now, let's just take a moment right now to enter that holiness, inviting the presence of God, inviting his word, his his voice in our hearts. So, let's come before him this morning and seek him. Let's invite him right now. Let's lift up our voices together. Lord Jesus, we lift up our voices together. Father, we come before you this morning, God. Lord, we invite you, Jesus. We pray, oh God. We want to hear your voice, Lord Jesus. We desire, Lord God, for you to speak with us. Lord, we want to meet with you, Lord Jesus. Oh Lord, King of Kings, King of all the earth. God, we pray that you would arise. We pray, oh God, that you would come. Lord Jesus, we pray for your spirit. God we pray for your powerful spirit. Oh Lord God and move in us. Oh Jesus God we pray. Oh Lord come heavenly father come. Oh Lord Jesus. Oh God. Oh God. Lord we invite you. God king of kings. Lord of lords. There is no God like you. Jesus. Jesus. We want to meet with you. God. We want to know you. God. We want to have a relationship with you. God. We want you. Lord, we want your spirit in you, Lord Jesus. Come, heavenly father. Come, Lord God. Lord, we call on you this morning. Oh, come with your presence. Come with your power, God. Come with your voice. Oh God. Oh God. Oh God. Lord, we lift up our voice now. We call out for you, oh God. We pray, oh Lord, let your will be done, oh God. Lord, change our hearts, oh God. Change our hearts, oh God. Oh Lord, how we pray, oh Lord, we pray. Jesus, Jesus, Jesus. Come Lord, come Lord, come Lord. [Music] Oh, rain in me. Sorrow, Lord, rain in me. Re in me, sovereign Lord, reign in me. Reign in me. Oh, sorrow, rain in me. Re in me, sovereign Lord, reign in me. Lord God, we acknowledge this morning that you have another promise for us that we can reign. Lord God, that we can rule over darkness. We can rule over our flesh. We can rule over this earth, Jesus. We can rule over the world, God. Oh God, we pray that you would do that work in us by your blood, Jesus. Jesus please rain in me. Sorrow rain in me. [Music] Rain in me. Sovereign Lord, rain in me. [Music] Right now, we want to reach over to the person next to us and pray for one another and pray knowing now all of the things that God has laid out for us, all of these things that he has done by his blood that we would actively take them up, that we would pursue these promises. Let's lift up one another in prayer right now. God, we pray Jesus for your people. Jesus, we pray for your people, God. Lord God, Jesus, we understand this morning what you have done, Lord, by your blood, Lord, we have the authority by your power, oh God, you are so wonderful, God, and you have offered us so much, Jesus. Jesus, Lord, we lift up your church in prayer, God. Lord, we lift up your church, Jesus, right now, God. Lord, that we would no longer sit back and let the promises go by, but God, Lord, that we would seek you, God, that we would pursue you with all of our hearts, Jesus, Jesus, that we would grow and that we would become that glorious church, God. Lord, we pray. We want to be that glorious church that your promise that you have promised to do, that you have promised to work into your people. Jesus, Jesus, oh heavenly father, God, oh God, do your work in us. Oh heavenly father, do your work in us. God. Oh God. Oh God. God. Oh God. Please we pray Lord. We pray God. We pray for your church. God. Holy Jesus. Jesus that we would be transformed into your likeness. That we would be transformed into that glorious church. God, you're going to do it. God. We want to be. We want to be that fulfillment. God. Jesus. Jesus. Jesus. Lord, we pray for those desires. We pray for that spirit. We pray for that blood working in us. Oh God. Oh God. Please. Lord. We pray for that compelling. Oh Jesus. Jesus. Jesus. Jesus. Jesus. Jesus. Oh please God. We call on you. God we invite you right now. Come we invite you Lord we pray Jesus stir up young people stir up the next generation oh Lord stir up the next generation Lord stir up the parents stir up examples God Jesus Jesus Jesus Jesus please God oh God oh God please we pray no longer sit back oh spirit of a living [Music] Oh. Oh. Oh. Oh. [Music] Oh Jesus, heavenly father, come holy spirit, work in us. God working in us, Lord. Make us your people. Make us glorious. Stir up your church, Lord. Stir up your church, God. Stir up your people. [Music] Oh, and I will make room for you to do whatever you want to. Do whatever you want to and I will make room for you. Do whatever you want to. Do whatever you want to, Lord. I will make room for you. to do whatever you want to. Whatever you want to lift up your voice, lift up your prayer. Lift up your spirit. Lift up your song. Lift up [Music] [Music] Oh my power of Jesus. [Music] I'm a child of God. Yes, I am in my father's house. There's a place for me. I'm a child of God. Yes, I [Music] am. You have set me free. Now I am free indeed. I'm a child of God. Yes, I am. In my father's house, there's a place for me. I'm a child of God. Yes, I am. I am chosen, not forsaken. I am who you say I am. You are for me, not against me. I am who you say I am. [Music] I'd like to invite anyone who'd like to lift up their voice and commit to taking Jesus up on his promises. Amen. Just lift up your voice right now. Amen. Amen. [Music] Amen. Amen. [Music] You have set me free. I am free indeed. I'm a child of God. Yes, I am in my father's house. There's a place for me. I'm a child of God. Yes, I am. And someone else, please close in prayer this morning. God has put on your heart. Let's lift up your voice. [Music] While we were sinners, Lord, you still looked upon us and forgave us, Lord. You sacrificed your son at the cross to forgive all our sins. Even though we are not worthy, Lord, yet you love us so much, Lord, that you made the ultimate sacrifice for us. Thank you, Lord, because you took all our sin. You took it up and defeated, Lord. Yet, you're resurrected and you are our king. You are alive in heaven, Lord. And we praise and we worship a living God. Thank you, heavenly father, for being in our lives. Thank you for bringing us here today to hear your word. Lord, let us home. Let us practice it every day, Lord. Let us be mindful of you, Lord, daily. Give us a heart that seeks you, Lord, that seeks you every day, every morning, every evening, Lord. And Lord, just praying for change. Change our hearts, Lord. And let us find joy in you, Lord. We know that you change hearts. You make us new. You make us new people in you, Lord. Thank you, Lord. We pray this all in your son's name. In Jesus name we pray. Amen. Hallelujah. Thank you, Jesus. Amen. Amen. Hallelujah. You may find your seats. You have so Thank you. Well, I got a few things I want to announce uh before we end here. Those on live control, we thank you very much for uh recording this service. Uh we trust that those online heard the word, respond to it. Remember, God has so many promises for you, for us, just by his blood. God bless you. Thank you for joining us online."}