{"video_id": "aqzAAHDwaqE", "title": "Mother’s Day— May 11, 2025", "published_at": "20250511", "transcript": "I'd like to welcome you this morning. It's good to be in God's house again. Happy Mother's Day to all the mothers. We're going to get into his word and right into it. John the Baptist was born to Zachcharias and Elizabeth. The angel came to Zachcharias in the temple while he was burning incense before the Lord. And the angel said to Zacharias, \"Your prayer is heard.\" Hallelujah. Your wife will bear a son, and you shall name him what? John. John the Baptist. And this is what the angel said about John. He shall be great. He will drink neither wine nor strong drink. He will be filled with the Holy Spirit in the womb. He will turn many to the Lord. He will turn hearts of the fathers to the children and turn the disobedient to wis to the wisdom of the just. And Zachcharias was given this word by an angel. Amen. What a powerful powerful uh word that has come to Zachcharias about their son that isn't even there yet. Doesn't even exist. But God was going to do something great and powerful in John the Baptist and the angels giving him this wonderful word. Amen. Powerful. These adults, Zacharias and Elizabeth, they were both righteous. Say that with me. Righteous before God, walking in all the commandments and ordinances of the Lord. Say it with me. That B B word. What? Blameless. They were what? blameless. Wow. So, you have this older couple here. They're blameless. They're doing what is right. They're following God's word. It can it can be done. You know, people be like, \"Are you a sinner?\" \"Yeah, I'm a sinner saved by grace.\" And that's true. You know, we've sinned and we've been saved by Jesus's death on the cross. Hallelujah. Amen. Amen. But God is calling you higher. Amen. God is calling you higher. He wants to do something in you. He wants to pick you. He wants to choose you. Like he chose Zachcharias and Elizabeth. Elizabeth was barren. That means she could not have children. All these years she had no children. And at this point, Zacharias and Elizabeth were both well advanced in years. In other words, they were old. But these two were handpicked by God. God could have chosen a lot of other people, but he decided to use them. And you have been chosen to be your children's parents. You have been chosen to be your children's parents. Amen. God chose you to be an example to your children, to be someone they can imitate and follow, right? Children are a gift from God. Uh, I want to share this song real quick. I can only imagine written by the Mercy Me singer Bart. Uh, I'm not going to play it right now. Sorry. Oh boy. But the the song was written because this young man, his father was an alcoholic. his father would hurt his would hurt him or mistreat him and had they had a bad relationship growing up. But then the father met Christ when he was diagnosed with cancer, pancreatic cancer, he came to Christ. The father did and it changed his life. And after four years of having a good relationship with his father, his father passed away. And he said about his father, \"If God can change that man, he can change anyone.\" And at the funeral, his grandmother said, \"I can only imagine.\" And that's where this wording came. And he later in his life, years later, he wrote a song about his father. And so, next time you hear that, remember that. And also, I'm bringing this up because even if you don't have a good past with your kids, you can turn it around. Amen. That's what this man did. He came to Christ and his relationship with Christ helped transform and restore the relationship he had with his son. Okay. So, you've been chosen to be your father's uh your children's parents. And maybe you didn't have a good past with them. You can change that. You can that can be restored. So, what was Zachcharias's response? The angels excited. He's he's been sent from heaven. Oh my gosh. He's just been been bolted down, you know, standing before the throne. His name is Gabriel. I'm standing He's standing before God. the throne, the light shining everywhere, the glory. He comes down to Gabriel. He comes down. Gabriel comes down to Zacharias. He says, \"Zacharias, I've got great news. You're going to have a child. He's going to do this. He's going to do that.\" And then Zachariah says, \"How could this be? How shall I know this? I'm an old man. My wife is well advanced in years. What are you talking about? And the angel, it says, because he did not believe, you do not believe these things, Zacharias was made mute by the angel. And I'm going to take a few liberties here. I know it doesn't say this in the Bible, but it's very possible that Zacharias could have been thinking a few things and thinking, I was just about to retire. I want to play golf. I am too old for this. I'm getting too old. The angel did not get court approval or government approval to mute Zacharias. He just did it. Unfair treatment. Protest. But here's the problem. Zacharias was on his way to take a message from God that was powerful, that was a wonderful thing, and Zacharias was about to poo poo on it. He was about to turn it to something negative. Do we see that? And so the angel said, \"No, you're not going to do that. You're not going to stop God's plans. You're not going to speak. And so that's what happened. Zachcharias was made mute. And that's important that we have to be careful when we put our opinion into things. It doesn't work. [Music] Amen. What do we do when the word of God comes to our ears? How do we respond? You know, I'm I'm horrible at this. You know, I'm very guilty. Okay. God's word comes and I I'm like Zachcharias. You know, we we we can be like that sometimes. Amen. But it's important that we get the angel's attitude and also not just the angel's attitude, but Elizabeth's attitude. Luke chapter 1:23. It was as soon as the days of his service were completed that he departed to his own house. He went home. Zacharias got home. He's standing around and he's not saying anything. And Elizabeth is like, \"Hey, how are you doing? You want things? You get this? What would you like for dinner? How Oh my gosh, it's been so long.\" And Zachariah says, he can't talk. And the woman's like, \"You got to say something.\" And uh can you It doesn't say anything about how that went down, but you know, when she got home, she realized something was wrong. He's mute. She's like, \"Whoa, what happened?\" And then I I I would say it may be the first documented text message ever to happen yet. That's a joke. But the first text message, she had to write it down to get it to Elizabeth. And Elizabeth is like, \"I need details. I need details. What was the angel wearing? Which way was he looking? Was he looking up? Did he What? What did he look like? You You saw an angel. What place were you standing in? And Zacharas is like, \"I don't remember.\" In his head. And he's got to explain this. And he can't talk. Zachcharias 12. I'm sorry. Luke 1:24. After those days, his wife Elizabeth conceived. She realized that she was pregnant. I And she hid herself for five months and said, \"The Lord has taken away my reproach.\" Wow, what a response. This lady is possibly older than some of you in here. And she gets pregnant. And this is her response. Why did she hide? It doesn't say, but you can imagine the comments on Instagram. 70-year-old woman pregnant. Oh my gosh, poor lady. She will miscarry before the baby is born. They'll never be able to raise that child. They're going to be old, decrepit, 90 years old trying to raise a child. her body can't handle it. She can't do it. She can't make it. This is just going to end horribly. But they were what? They were given a word. They were given a promise. And the promise in the word is higher than what we think. Elizabeth owes me money. So sometimes there are too many voices that we allow to speak to us. When we hear outside voices that go against what God is saying and doing, we get discouraged. We get pulled up by the root. We get off track. Amen. And we can have that people can have that kind of effect with their message and their word. But her response was to hide herself. And also her response was the Lord has taken away my reproach. You see, she wasn't like, \"How can this be? I can't believe this. I can't do this.\" She said, \"The Lord has taken away my reproach. I can do this. I believe in the word that I've been given. I'm going to I'm going to bear this child and I'm going to carry this child for nine months.\" I I've had three children and I know by month eight that that the lady carrying that child, she is ready to get that child out of her walking around getting up, going here, there. It's just not fun. And a 70 year old woman's got to do this. So it's not just Oh, I believe she had to submit herself to this process. Amen. Not comfortable, inconvenient. Mary, the mother of Jesus, just got the word from Gabriel. The same angel that talked to Zacharias talked to her and the Gabriel let something slip. He said, \"And you know your cousin Elizabeth is pregnant.\" And she's like, \"What?\" So after she says, \"Lord, let it be according to your word. I am going to be the mother of Jesus.\" She goes to meet with Elizabeth. She walks in the door and the baby inside of Elizabeth goes, \"Woohoo!\" And any mom that has have had a baby before. When the baby jumps, they're like, \"Ah, right.\" The baby leaped in her womb, said, \"Whoa, Jesus.\" The babe leaped in her womb and Elizabeth was filled with the Holy Spirit. Jesus, I'm sorry, John the Baptist, it says he would be filled with the Holy Spirit in the womb and it happened. And so if we are just a clump of cells, how did he get filled with the Holy Spirit? Six months in the womb. What is the age? Is it a viable thing? Oh, it's a viable baby. Well, the spirit filled him and he's a he's a baby. He's a human. Six months is the cut off. Before that, we can still get rid of. Is that how it works? Someone is wrong today, folks. And it's not the Bible. God filled John the Baptist at six months with the Holy Spirit. Did he fill a clump of cells? No. He filled John. His name was John. His name was John before she even got pregnant. She got she conceived. His name was John. His name is John. Jeremiah 15, before I formed you in the womb, I knew you. Before you were born, I sanctified you. I ordain you to be a prophet to the nations. Remember that. You see, we we know this scripture, but you say it and you're like, \"Well, I don't understand exactly.\" Well, G, the Holy Spirit filled John in the womb at six months. If he can do it at six months, he can do it at three months. If he can do it at three months, he can do it earlier than that. Come on. Right? Before I formed you, I knew you. Do you understand how important and how valuable you are to God? Galatians 4:19. My dear children, for whom I am again in p pains of child be birth until Christ is formed in you. So, we think to ourselves, \"Oh, Mary had Jesus and Elizabeth had John the Baptist and they got pregnant.\" Well, God is turning to us today and he's saying, \"Hey, I want to be formed and developed in you.\" And it's not like men becoming pregnant and bearing babies, okay? Let's not get weird and crazy. But God, Jesus Christ, he wants to develop like a baby in you. He wants to grow in you. He wants to become more powerful in you. He wants to change you. [Music] Amen. Until Christ is formed in you. And God, it comes with his word. It's like a seed, right? The seed comes and it's small. Just like a baby is small. It starts out small and it grows. That seed wants to keep growing. I think I missed a slide. I'm sorry. Oopsie. Double clicked. Luke 1:45. Elizabeth said to Mary, \"Blessed is she who believed, for there will be a fulfillment of the things which were told her from the Lord.\" Blessed is she who believed. I want us to understand a difference in the word believe. A difference in the word believed. For God so loved the world, he gave his only begotten son to for whoever believes on him. Right? We know this scripture and people believe. They have faith. Jesus saved me. Died on the cross for me. I believe. But Mary's belief, Elizabeth's belief is different. Imagine you came to a college today, walked up to a 20-year-old girl, said, \"Hey, you're going to have a baby.\" What would they say? They might say, \"I want to get rid of this baby.\" They might say, \"You trying to oppress me?\" You imagine the angel came up to a girl at the college. Are you trying to oppress me? Male patriarchy is trying to come up on me. Get away. Imagine the angel came up to uh Katy Perry while she's singing roar. You're going to hear me roar. The angel came and said, \"Hey, you're going to have a baby. I'm roaring right now. Don't have time. Angel comes up to Taylor Swift. Shake it off. Shake it off. Says, \"You're going to have a baby.\" She's He's going to be one of And she's going to be like, \"Shake it off. You know what I'm going to do with that? I'm gonna shake it off.\" It's true. Mary had to prepare. She had to carry. She had to plan. Having a baby isn't easy. Having a baby is work. You can't just do whatever you want. You have to take care of your child. You have to take care of them for the next 20 years. And Mary didn't have a public school system. Elizabeth didn't have the public school system. Oh, you just go to public school now. four years old. Get out of here. Elizabeth, they had to raise their kids. Mary, they got to raise their kids, you know, and I know it's John the Baptist and Jesus, but they still had to raise them, right? They had to submit themselves. They put their belief into action. And when you hear this word believe, this is what we're talking about. We're talking about someone submitting themselves to follow and to act on what God has given and promised to them. It's not just faith far away. Jesus on the cross 2,000 years ago. No, it's now in my life now in my dayto day. That baby was with them at all times developing every hour, every second inside of them. And God wants to grow in you. And so God comes to us and he says,\"I want to be formed in you.\" What do we and how do we respond? That's what Paul is saying here. Paul first says, \"Who am I again in the pains of childbirth?\" He's talking about him being in childbirth. Of course, he's a man. He did not He's not in real child birth, right? He's having he's talking about spiritually, but he wants Christ to be formed in these people. We need Christ formed in us. Amen. And so, we've been given a promise. God has come to you with a word. It's not just to Mary. It's not just to Elizabeth. His word has been written down. It's been spoken. That truth has been poured out to you. And he said, \"I promise, my promise, my covenant with you is that I'll give you a new heart.\" Where are we at with our new heart? Have we let God do that in our in our hearts? Have we let God put a new spirit in us or we still got our old stinky spirit? Have we let him write his law on our hearts and our our minds, our spirit, our soul that it's permanent? It's not it's it's not going away. Are we letting him cause us to walk in his ways? Are rejecting his ways? Are we roaring and shaking it off? [Music] Amen. Remember your sins, your iniquities are remembered no more. We can handle that. I can handle that. I can handle that all day, God. Remember it no more. Thank you. All shall know me from the least to the greatest. You see, it's not just Mary birthing Jesus. It's not just Mary having a relationship. It's not just Mary. It's us. It's his people. Christ being formed in you and in me. Every one of us. And there's a lot of naysayers. And the naysayers may be saying to you, \"Oh, you can't do it. You can't be changed. Jesus doesn't work. Jesus, his word is that word is so old. It's decrepit. Look at that book. It's from ancient years. But the word of God is truth. It still works. And Christ's word is true. You've got to hear what the angel is saying. What is the spirit saying? Amen. Not what the comments say. Hallelujah. So, in response this morning, I encourage you if you want to know what God has spoken to you, you've got to read the Bible. I encourage you almost every week to put God's word into you. You want to you want to know what it says. You want to have knowledge of it. You know, let that word flow through your ears. It may it may just fly right through. That's okay. Keep putting it in. Okay. Put the word of God into you. Read it. Walk and read it. Listen to it. I don't care what you do. Get the word of God into you. [Music] Amen. It's so important. And when you have that word, when you it's in your mind, now you can respond to it. So, we're going to take some time this morning to respond. I would like to invite you to stand with me. [Music] Here I am waiting. Abide in me I pray. Here I am longing for [Music] you. Hide me in your love. Bring me to my knees. May I know Jesus more and more. Come live in me all my life. Take over. Come breathe in me. I will rise on [Applause] eagles [Music] wings. If you'd like to invite Jesus to be formed in you for his promises to be fulfilled in your life, let's respond this morning. You can come forward, you can stand, you can bow, but come and pray unto him. Come and speak unto him. Invite him to fulfill his promise in your [Music] life. Here I am waiting. Abide in me I [Music] pray. Here I am longing for you, oh God. Hide me in your love. Yes. Bring me to my knees. [Music] May I know Jesus more and more. Come live in me all my life. Take over. Come breathe in me. I will rise on eos. Come live in me all my life. Take over. Come breathe in me. I will rise on you. Oh, come live in me all my life. Take [Music] over. Come breathe in me. I will rise on [Music] evil way. [Music] Oh. [Music] Oh. Oh. Oh. Oh. [Music] Oh, come live in me all my life. Take over. Oh, come breathe in me. I will rise on eos wings. [Music] [Music] [Music] As we sing this song one more time, we just want to express this song as a prayer to invite Christ to be formed in you as Paul wrote as what happened to Mary, Christ was formed in [Music] her. And the more mature Christ is, the more powerful he works in our lives. So, just lift up your voice right now and invite him if you'd like to respond and say, \"Yes, God, I want you to form in me.\" We're going to keep singing this song and you can sing it as a prayer with your hands lifted, your eyes closed, just saying, \"Yes, God, I want you to come live in me.\" Let's sing it unto him. Come live in me. All my life take over. [Music] Come rave in me. I will [Applause] rise on [Music] evil. Come live in me all my life. Take [Music] over. Come breathe in me. I will arise on [Music] eos. I will rise. Yes. On eos wings. Oh come Lord. I will rise. [Music] on [Music] eos right now. We want to pray for one another while the bodies together. We want to pray for one another out of love. Out of love because we care for one another that God would be formed in us. That God would come to maturity in us. That God would develop all the way in us. So let's pray. lift just reach out to your hand to the person next to you and let's pray for one another that God would be formed in us. His perfect will be done in us. His ways, his his talk, his spirit, his mouth, his purposes, his plans would be done in us. God, we pray for one another right now. We lift up our voices, God. Lord, we pray for your church. God, we pray. We ask Jesus Lord that you Lord would come Lord Jesus that you would form God that you would continue God Lord that you would not stop God Lord we pray for your people we pray for your church God Lord that you would change us more and more brighter and brighter to the perfect day God lord that your spirit would move upon us God oh God oh God come and overshadow us God come Lord God birthed into us, Lord Jesus. God, develop and grow in us, oh Lord. God, we pray Jesus that we would be willing to take the burden. Take Lord the formation of the King of Kings and the Lord of Lords in our life. God, change our mindset, God. It's a good word that you have given, God. It's a wonderful thing that you have promised, God. Oh God, it's not negative. Oh God, it's a wonderful, powerful promise, God. What a wonderful powerful promise. Thank you Jesus. Jesus. Thank you God. Lord we pray God. Oh God. Thank you Jesus. Oh thank you. Thank you Lord. What a wonderful wonderful God. Oh wonderful wonderful. Oh wonderful wonderful word. Wonderful, wonderful promise you have given your people. You have given your people God. Come live in me all my life. Take over. Oh Lord, come breathe in me. I will rise on eos wings. What a powerful word it is. What a powerful word it is. The words of Jesus Christ my king. What a powerful word it is. Nothing compares to this. What a powerful word it is. The word of [Music] Jesus. What a wonderful word it is. What a wonderful word it is. The word of Jesus Christ, my king. What a wonderful word it is. Nothing compares to this. What a wonderful word it is. The word of Jesus. God, Lord, you have given us a wonderful promise, a powerful, wonderful promise. Jesus, Jesus. The angels have left heaven to share with all mankind the wonderful, glorious promise of the living God. Oh God, and you've come to share, Lord, you came. You stirred up the prophets. You stirred up those who wrote the New Testament, God, by your spirit. You have given us such a wonderful promise. Oh Lord, I pray right now that we would receive it like Elizabeth, that we would receive it like Mary, God, that we would receive it, God, with a smile. God, receive it with joy because it has come from the throne. It has come from the living God. All your promises, Lord. Thank you, Jesus. Thank you, Jesus. What a wonderful word it is. What a wonderful word it is. The word of Jesus Christ, my king. What a wonderful word it is. Nothing can stand against. What a wonderful word it is. The word of Jesus. Thank you, Jesus. Amen. Somebody just lift up your voice. in prayer that God has put on your heart. Confirm the word this morning. [Music] restoring our joy and help us with our unbelief. We were all different places in our walks and in our talks, Jesus, but together, Father, we come together in truth and in spirit to worship you, to lift up your name, Father, to reach the lost generation, Father. We just pray, Jesus, that you use us, use us as vessels, Father, to just bring forth, Father, and share your gospel message, Father, to the ends of the earth, till the very last day that we breathe on this earth. Father, we may be may your name be on our lips, Jesus, when we open our mouths. May a breath of fresh air of peace and joy. And may people know, Jesus, when they look at us, in the eyes that we sparkle, Jesus, in our eyes, because of the spirit living within us. Jesus, strengthen our spirit. Jesus, thank you, Father, for today. Thank you, Jesus. Thank you for reminding us that gratitude with you, Jesus. We need to have gratitude at all times and in all things, Jesus. And we need to trust you, Father, with everything that we are. Thank you, Jesus. [Music] Beautiful word name it is. What a beautiful name it is. The name of Jesus Christ my king. What a beautiful name it is. Nothing can stand against what a beautiful name it is. The name of Jesus. Amen. Ask somebody to close in prayer. Thank you for that exhortation. I hope you guys heard the encouragement. Let his name be on our lips. Let us be grateful and have gratitude for Christ. Amen. Hallelujah. Aran, will you please lift up your voice in prayer in [Music] closing and uh Lord, just as you chose a special woman to carry your blessings, Lord, uh to bring forth Jesus into the world, uh you continue blessing women uh in our lives, Lord, and U just want to pray for our mothers especially today um as we remember mothers uh just for the blessing they are. They bring forth life. They bring forth just uh encouragement and teaching to their children. Lord, we just pray that you continue blessing them. The mother's present, the mother's away, and uh Lord, we just uh pray that you continue encouraging us, growing us in your word, and uh we can trust you for all things, Lord. and that we understand what the gospel means. Um that your son came to save us, that he sacrificed his life for us so that we can find eternal life in you Lord. Thank you for your glory, for your love and pray all this in Jesus name. Amen. Amen. Hallelujah. Thank you Jesus. I really like what he said there that uh these lady the Elizabeth and Mary were to bring God's blessing. What did how did you say it? But that's Christ formed in us. Amen. We're to bring that blessing of Christ to people. Letting him be formed in us so we can bring a blessing to people. Amen. I like that. That's wonderful. We want to thank those online for joining us live control. Thank you very much. God bless you guys online. Sister, friend, or brother loves the way that Jesus can. He proved his love for me when he died on Calvary. He gave his life for falling men. His love is a boundless love that reaches down and touches me. His love is an endless love that will last throughout eternity. Let's clap together, giving God the glory. Let's sing this again. There is not a mother, sister, friend, or brother loves the way that Jesus can. He proved his love for me when he died on Calvary. He gave his life for all men. His love is a boundless love that reaches down and touches me. His love is an endless love that will last for all eternity. Jesus wants to love you. There's none above you. You are precious in his sight. He will never fail you. When the doubts assail you, he'll be with you day and night. His love, His love is a boundless love that reaches down and touches me. His love is an endless love that will last for all eternity. His love, His love, His love is a boundless love that reaches down and touches me. His love is a headless love that will last for all eternity. His love, His love, His love, His love, His love is a boundless love. His love is a boundless love. His love, His love, His love, His love, His love is a boundless love. His love, His love, His love, His love, His love is aboundless. [Music] Thank you, Lord. We thank you, Jesus. Let's praise him this morning. Thank you, Lord. Let's thank him this morning, God. We thank you for your love, Lord. We thank you, Lord Jesus. We honor you, Lord. We worship you, God. Worthy, worthy, Lord. Here I am and I have come to thank you, Lord, for all you've done. Thank you, Lord. You paid the price. Calvary, you shed your blood. You set me [Applause] free. Thank you, Lord. No greater love was ever shown. No better life ever was laid [Music] down. But I will always love your name. And I will always sing your praise. And I will always love your name. And I will always sing your praise. [Music] Ch my sin. You took my shame. Drink my cup. Thank you for my day. [Music] Thank you, Lord. You broke the curse. You broke the chain. To bring from death you rose again. Thank you, Lord. And not by works, but by your grace. You clothe me now in your righteousness. And I will always love your name. Always love you, Lord. And I will always sing your praise. Sing your praises. And I will always love your name. And I will always sing your praise. [Music] You b me come. You make me whole. You give me peace. You restore my soul. Thank you, Lord. Fill me up. And when I'm full, give me more till I overflow. [Music] Thank you, Lord. You're making me to be like you, to do the works of the father do you. And I will always love your name. Always love you, Lord. And I will always sing your praise. Sing your praise. And I will always love your name. Oh, you know I will. And I will always sing your praise. And I will always love your name. And I will always sing your praise. Yes, I will always love your name. and I will always sing your [Music] praise. We praise you, Lord. We love your name, God. We worship you, Jesus. We bless you, Lord. We adore you. Oh, King of Kings, Lord of Lords. Worthy, worthy is your name, oh God. We exalt, we exalt [Music] you, how great is the love of God. How strong is a hand of love? So fine, his mercies are new every morning. Let's clap together. So fine, his mercies are new every day. One more time. How great is the love of God? How strong is the hand of love so fine? His mercies are new every morning. So fine. His mercies are new. Every day we sing a new song. We sing a new song. Great is the love that paid for all our sin. Great is the love that gave us life again. Great is the love [Music] of our God. [Music] How great is the love of God. How strong is the hand of love so fine? His mercies are new every morning. Oh, so fine. His mercies are new every day. Come on, let's sing. Oh, we sing a new song. We sing a new song. Yes. Great. Great is the love that paid for all our sin. Great is the love that gave us life again. Great is the [Music] love of our God. Great is the love. Great is the love that paid for our sin. Great is the love that gave us life again. Great is the [Music] love of our God. Lord, you love us. Lord, you are worthy God. Thank you, Jesus. [Music] Oh, and great love you have bestowed on us. We love you. We love you. Worthy, worthy is his name. Before we transition to the next song, let's just take a moment here and thank him and tell him that we love him. Just sing unto him. Thank you, Jesus. We love you, Lord. We thank you for all that you've done for us. We thank you, oh God. You are good. You are good. Your people, God, we worship you. We honor you. Thank you, God. Is [Music] [Applause] here Jesus, we want to praise you, Lord. [Music] Oh, your love, oh Lord, reaches to the heaven. [Music] Your [Music] faithfulness stretches to the sky. Let's lift our hands together unto Jesus. Your rightousness is like the mighty mountain. [Music] Your justice flows like the ocean [Music] t and I will lift my voice to worship you my king. And I will find my strength in the shadow of your wings. Your love, oh Lord, reaches to the heavens. Oh God, your faithfulness stretches to the sky. Your [Applause] rightousness is like my mountain and your justice flows like the ocean. Justice. I will lift my voice to worship you, my king. You're my king. Oh, I will find my strength in the shadow of your wings. Your love, oh Lord. Oh, reaches to the heavens. Your [Music] faithfulness stretches to the sky. [Music] Your rightousness is like a mighty mountain. [Music] knows your justice flows. Yes, it does like the ocean side. [Music] I will lift my voice to worship you my king. I will find my strength in the shadow of your wings. [Music] Oh, your love, oh Lord, reaches to the heavens. [Music] Your faithfulness [Music] stretches to the [Music] sky. Lord, you are faithful. Your justice flows. You are faithful. We see we see your justice flows. We worship. We worship you. your righteousness, [Music] [Music] Lord. Jesus, your justice flows like a mighty river. Lord, it flows to the widow. It flows to the fatherless. It flows to the broken and the contrite ones in the earth, the poor in spirit. And Jesus, you do bring justice in your time. Your mercy brings justice as we can see in our land today. Justice is flowing like a mighty river and your righteousness is springing up. Lord, may we see it. May we recognize the season that we are in. And what a mighty mighty demonstration of your kingdom coming here upon the earth. We love you and we thank you Jesus. Your justice flows like a mighty river. Hallelujah. And I will lift my voice to worship you my king. And I will find my strength in the shadow of your wings. Your love, oh [Music] Lord, reaches to the heavens. [Music] Your faithfulness stretches to the sky. [Music] You're a maker, miracle worker, promise keeper, light in the darkness. My God, that is who you are. You are way maker, miracle worker, promise keeper, light in the darkness. My God, that is who you are. You are You are way maker, miracle worker, promise keeper, light in the darkness. My God, that is who you are. You are Lord, way maker, miracle worker, promise keeper, light in the darkness, my God. That is who you are. That is who you are. That is who you are. That is who you are. You are here moving in our midst. We worship you. We worship you. You are here working in this place. We worship you. We worship you Lord. You are way maker, miracle worker, promise keeper, light in the darkness. My God, that is who you are. Lord, way maker, miracle worker, promise keeper, light in the darkest. My God, that is who you are. That is who you are. That is who you are. That is who you are. That is who you are. Thank you, Jesus. Even when I don't see it, you're working. Even when I don't feel it, you're working. You never stop. You never stop working. You never stop. You never stop working. Even when I don't see it, you're working. Even when I don't feel it, you're working. You never stop. You never stop working. You never stop. You never stop working. Even when I don't see it, you're working. Even when I don't feel it, you're working. You never stop. You never stop working. You never stop. You never stop working. Way maker, miracle worker, promise keeper, light in the darkness. My God, that is who you are. Way maker, miracle worker, promise keeper, light in the darkest. My God, that is who you are. That is who you are. That is who you are. That is who you are. [Music] With our hands lifted, our eyes closed, and our voices lifted up high, let's sing this unto him. You are the way maker. Amen. Let's thank him again by singing this together. Way maker, miracle worker, promise keeper, light in the darkness. My God, that is who you are. All right, let's lift up our voices again. Way maker, miracle worker, promise keeper, light in the darkness. My God, that is who you are. That is who you are. That is who you are. That is who you are. That is who you are. That is who you are. That is who you are. That is who you are. Ask somebody to lift up their voice and pray right now what God has put on your heart. [Music] It was wonderful. Jesus, your presence is tremendous. I love you, Jesus. I love you very much. And I thank you for everything you've done in my life, in our lives. Jesus, thank you very much. Thank you, Jesus. That is who you are. That is who you are. That is who you are. That is who you are. That is who you are. [Music] [Music] Oh. Oh. [Music] Jesus, we acknowledge, Lord Jesus, today that you are the way maker. You're the miracle worker, Lord God. You've made a way in many of our lives, Lord, to serve you, to be changed by you, to be transformed by you. God, you've made a way where there was no way. And Lord God, you have reserved a place for us to be with you, Lord God. And we want to be with you. Hallelujah. Thank you, Jesus. You told your disciples to rejoice that their names were written in the book of life. And God, Lord, we want to be written in your book this morning. Amen. Hallelujah. Thank you, Jesus. Thank you for making a way. Thank you for writing us in your book. We love you. Everyone said, Everyone said, \"Amen.\" Amen. You may find your seats this morning. That is who you are. That is who you are. That is who you are. That is who you are. That is who you are. [Music]"}