{"video_id": "awvd9Qm9TX0", "title": "Where and What is Hell? — March 23, 2025", "published_at": "20250323", "transcript": "We're going to be talking about hell today in uh Turk Menistan, a country there's a crater called the Darvaza Darvaza crater and uh it that man is standing there as a pit that has fire burning all the time in Serbia. They uh dug the deepest hole in the world. And here's a picture of that crater. It's burning all the time. Even right now when you go there, there's fire all the time. And we have a place in Kansas called the stool c stole cemetery. It's called the gateway to hell. Uh but we want to understand from the scriptures what is hell? Is it a place on earth? Is there a location here on planet Earth you can go to? Oh, look, there's hell. Uh, can we dig down into hell? No. Can we fly up into the sky and get uh, you know, I don't even need Jesus. I can just fly with the spaceship and go to heaven. Is that is that how it works? No. Heaven is not uh seen in the universe. Hell is not seen. It's not a location inside the earth. In John chapter 3:13, they uh trust you have the handouts. No one has ascended to heaven but he who came down from heaven. That is the son of man who is in heaven. So that confirms Jesus Christ is the only one who ascended. Now Jesus was on earth and he went up and ascended into heaven. He went up. So we think, oh he uh up is heaven. Uh but you got to understand that he transitioned to heaven where God is. Uh if you remember the story of Steven when he was being stoned, you know, he was he was being stoned in a normal place, normal sky. All of the sudden while he's being stoned, the heavens were what? Opened. Okay. Okay. So there has to be an opening. God has to do an opening from one uh realm to the other. 2 Kings chapter 6 vers 16. Elisha answered, \"Do not fear, for those who are with us are more than with those who are with them.\" Elisha prayed and said, \"Lord, I pray, open his eyes that he may see.\" So what was happening here is Elisha was a prophet. He had a servant Gahhesi or maybe not Gahhesi, another guy. And uh they had an army coming up against them. And the servant was afraid. He was scared. And Elisha's like, \"Do what did he say? Do not what? Fear. Don't be afraid.\" And the guy's shaking in his shoes and he's going to pee his pants and cry. And but God, it says, \"Lord, I pray what?\" Say it. Open his eyes. And then the Lord what? Opened his eyes of the young man, and he saw. And behold, the mountain was full of horses and chariots of fire all around Elisha. And so heaven and hell are not locations in the universe. As I said before, you can travel in a spaceship and you're not going to go find like the movie Thor, they they they traveled to Asgard or there's some kind of rose and you know, wormhole. It's not it's not like that, okay? It's not movie stuff. The Lord opened the servant's eyes. In Hebrews, as I have quoted several times now, it says that the church, this is Mount Zion, an innumerable company of angels are here. So even though you can't see it, and I can't see him, they're here, believe it or not. And when you feel the presence of God, that's an effect that Christ that God and the angels are having in the room. And I feel that all the time. And the presence of God is wonderful. But you got to recognize how powerful we are. But God is still giving us the choice whether or not we want to be with him or we want to do what we want and follow the world. A lot of people are wondering why we're here. What is our purpose? Remember, this is God's world. He made it for a reason. Very important. The scriptures also say that the kingdom of God is within us. And so the goal in our lives is to have his kingdom living in us, to live in his kingdom. And so when you die, there's not a big deal. You're already in his kingdom when you're here. So you're just transitioning from one uh kingdom to another. Easy, right? So that's why you want to have the kingdom of God in you. You want to be part of the kingdom of God while you're here on earth so that it's just an easy switch. Amen. This isn't the end all beall. Okay. folks in the world, they they really get fixated over everything here and want to uh uh and they can do all kinds of adv advancements and stuff like that, but that this isn't everything. Okay? There's a much greater thing happening after we die. And we got to look to that. We want to look at the story of the rich man who went down into hell. We have our ideas of hell. And people come up with all kinds of depictions and movies that have been made. You got the guy who's a skeleton who's burning in the flames and flesh falling off and all these kind of things. Uh there's a rock star down there on the left and he's rocking out with his guitar that's, you know, not melting. But what does the Bible say? And we're going to look to our rich man here. What is it actually like? 16:23 The rich man died and being in torments in Hades, he lifted up his eyes and saw Abraham a far off and Lazarus in his bosom, he cried and said, \"Father Abraham, have mercy on me. Send Lazarus that he may dip the tip of his finger in water and cool my tongue, for I am tormented in this flame.\" And so we see here that the spiritual body that lives forever has what? It has what? Eyes. So is it just a skeleton? No. You're going to your eyes are going to work fine, right? You can feel everything. You have emotions. Everything you have now, you're going to have in uh the lake of fire. I don't want to be I don't I'm not going to be in the lake of fire. No, I don't want that. You're going to be able to see you're He was thirsty. He was thirsty. His tongue was dry. He had a tongue. Okay. So, your your physical body is going to be different. It's not a physical body. It's a new body that God is giving that you know that new body is going to live in in heaven forever. No pain, no sorrow, right? No more cancer, no more disease. It's it's there's no DNA or bacteria for that, right? It's a whole new world. But the same problem is with those who are cast in the lake of fire. It's that body doesn't doesn't go away. It's not consumed. and he's able to speak and he's able to yell uh at Abraham. He's speaking to him. So, you want to have a good understanding here. Luke 16 27, he goes on, \"I beg you, therefore, father, that you would send him to my father's house, for I have five brothers that he may testify to them.\" He's talking about uh the the poor guy that died who was in heaven with Abraham. And he's talking to Abraham saying, \"Send that guy to my brothers so that they don't come here.\" And Abraham said, \"They have Moses and the prophets. Let them hear them.\" And he said, \"No, Abraham, but if one goes from the dead, they will repent.\" But he said to them, \"If they do not hear Moses and the prophets, neither will they be persuaded though one rise from the dead.\" And we know that is true today because Christ Jesus has risen. Amen. And a lot of people are rejecting God today. Amen. And we have Moses and the prophets. We have Jesus Christ. And we still reject these things. And some people hear Moses and the prophets like, \"I don't know Moses and the prophets.\" Well, it's time to know what they say. You have a responsibility, God. You were You were created in this world. You have some responsibilities. You have an eyes. You have eyes. You have a mouth. You have hands. Go get the book. Read it with your own eyes. You have a sound mind God has given you. Put it in your mind. So there's no more excuse. We don't have excuses. Second Peter 2:4. If God did not spare the angels who sinned, but cast them down to hell and deliver them into chains of darkness to be reserved for judgment. So chains. You see this word? Say that with me. Chains. People think they're going to be down there partying. See the guys on the bottom? They're having a party. The angell party. Heaven and hell. Get the guys to dress as angels and the bad guys dressed as devils. and it's going to be a heaven and hell party. No, it's not going to be fun. There's going to be chains. You're not You're going to be restricted from moving around. There's no freedom. See, we we have freedom to sin now, but when you get down there, there's no freedom. You have the fre you have the freedom to sin if you want right now, but when you get the second death, there's no freedom, folks. We don't want that. I don't want that. Please gross. Matthew 13:49. So it will be at the end of the age. The angels will come forth, separate the wicked from among the just, and cast them into the furnace of fire. There will be wailing and nashing of teeth. It will be so painful that you're going to be grinding. I don't remember the last time. Did anybody have a case where they like were the pain so much they were grinding? Maybe like when somebody was in my ear doing something or or when they when they when they drill in your teeth. Of course, I have to keep my mouth open. It's painful. What? Kidney stones. There you go. And so here's a it's a clear picture of hell. He's not there's no misunderstanding here. He's they're going to gather the wicked and gather the just. If you live wickedly, you're going to go to hell, folks. Don't I don't want to go there. Don't go there. Repent from Get it out of you. Repent from the wickedness. This word is true. It's so important for us to respond. God Jesus has made such gone to great lengths to get us out of here, to give us the tools we need. take him up on his offer, please. You also, I'm just realizing this right now, but the the rich man in hell and you know doesn't mean all rich people are going to hell, but this rich guy was in hell and he remembered his brothers. He remembered. So all of that data, you know, normally as a as a IT guy, I think of hard drives and data and, you know, the binary, how did it transition from one brain to the other? You know, God does a a download. I don't know how he does it, but he does it. He remembered his brothers. So, you're going to remember this stuff. But remember, God made the brain. He made the body. So, it's no problem for him to do any of this kind of stuff. Philippians 2:20, I have no one like-minded like Timothy who will sincerely care for your state. 2 Corinthians 5:11, knowing therefore the terror of the Lord, we persuade men. We persuade men, but we are well known to God. And also, I also trust we are well known in your consciences. pe uh Paul here is writing and he's saying there's not a lot of people who sincerely care for your soul and we want to start caring for people's souls folks. It's important for us to understand uh the penalty and the payment so that we can can get some conviction in our lives first of all to change and then to help other people change. Amen. We've got to start caring for people's souls. A lot of people are their their their statements are, \"Oh, they people can do whatever they want.\" What? Really? Is that going to be our perspective? Is that God's perspective? Is that what we're going to say? Yeah, you got the freedom to do what you want, but God's going to hold you accountable. Come on, folks. We got to start caring about people's souls, about people's, you know, that's that's not caring. When we just let people go and we will let ourselves go. We're not caring. Knowing the terrible Lord, we persuade men. Come on, we we want to be pers persuading people to turn And so God is asking us today, are we willing to be vessels to turn people from the lake of fire and also vessels ourselves to turn our away ourselves from the lake of fire? Will we back up our commitment with action to find growth in our lives and our spirit and remain steadfast in that goal to care for people's souls? Acts chapter 1 vers8 but you will receive power when the Holy Spirit has come upon you and you will be my what? Witnesses in Jerusalem and all Judea and Samaria and to the what? End of the earth. Okay, these Jews, they weren't just stuck with the Jerusalem and and today we we're we're 2,000 years after Jesus came and the Jews may we have all our thinking, oh well uh this is only for the Jews. I'm a special the Jews are a special people and nobody else or no it says what to the end of the earth my witnesses to the end of the earth and later in the story of Cornelius the Holy Spirit filled the Gentiles. So the Gentiles also have a responsibility to be what? Witnesses to the whole world. Romans 12:1, \"Present your bodies as a living sacrifice, holy and acceptable to God.\" Do we have some improvement that we can make? Yes. Do we have a high calling here that God has called us to? Yes. To be holy and acceptable to him? Yes. I uh have our our duck here, Daffy, and he's saying, \"It's mine. It's all mine.\" You know, we can't just hoard God and just keep him to oursself and come and enjoy the presence and nothing else happens. Amen. We've got to start caring about people. We got to start caring about people. That's God's goal. He wants to improve our lives so that we can help others do the same. And so it's important in your life that you take charge of your body. You take charge of uh you got to tell it, \"Hey, time to get up. Time to get that Bible. Time to worship. Time to kneel. Time to get to work. Time to follow God's word.\" No, you got to get in control of your body. It's up to you. And also the big one we got to start controlling is what? Yeah. Amen. Man, we get in all kinds of trouble. And uh in our time with phones and everything and entertainment, it's really easy to get internalized and just care about you and yourself and that's it. But God is calling you to get out and be a witness. Amen. So what will take us there? I found this uh funny picture of uh pizza you could buy now and pay much later. Afterlife pay hell pizza. I don't know if it's real or not, but I thought it was a it was funny. Revelations 218, the fearful, the unbelieving, and all liars shall have their part in the lake of fire, uh which is the second death. 1 Corinthians 5:11. Now I have written to you not to keep company with anyone named a brother who is sexually immoral, covetous, idolattor, reviler, drunkard, or extortioner, not even to eat with such a person. Last week we were and two weeks ago we were talking about crime and what uh how sin is like crime. Crime is a violation of uh a natural law. Somebody law that somebody put in place. And uh sin is a violation of whose law? Whose law? God's law. Right? And so these things that we do when we violate God's law, these things can take us to hell. It's important. Uh fearful. Those who are fearful are people that won't respond to Christ because they're afraid of what their friends say. They're afraid of this or that. Whatever whatever excuse we come up with, you get fearful. Unbelieving. Obviously, if you don't believe in Christ, if you don't put your trust in belief is not just a mental thing. It's a there's action involved, right? If you don't have any uh as as John said, bring forth what does it say? Fruit. Bring forth fruit worthy of repentance. That belief translates to uh bringing forth fruit and repentance. Liars. We don't want to be liars. Amen. Sexually immoral. You know, the scriptures say that marriage is honorable and the marriage bed undefiled. If you want to be uh honored in God's sight, all scriptures also say he who finds a wife finds a good thing and obtains what? Favor from the Lord. Okay? That marriage is important to God. Okay? And because it's important to God, you you've got to surrender yourself and just say, \"Forget it. I don't care what the world says. I'm going to follow what God says.\" And so these things that are immoral, sexually, incest, homosexuality, orgies, beastiality, adultery, fornication, all that stuff, you know, it's not just LGBTQ stuff, okay? You know, we don't we can't just be like, \"Oh, they're the bad guys.\" You know, people are are committing all kinds of sexual sin. It's the same thing. It's still bad and it's going to take us down. We don't want that. Uh extortioner. See that word extortioner right there? Uh I was reading another scripture that talked about not um how they would carry different weights so that they could cheat people, right? And I found this example from uh recent uh findings they found in the IRS. And I thought this was very I I could explain this well because I work in IT at my job at my company. And uh what they're finding in the IRS is that they have how many employees? 8,000 employees in what? It not just in the IRS. In what? it. So, a department has how many? 8,000 employees. You know how many I have in my IT department? 300. That's big difference. They have the IRS has a an IT budget of what? $3.5 billion. $3.5 billion. That's almost as big as my company takes in every year. That's huge. How many want some of that money? Geez. They're just throwing it around like it's nothing. IT upgrade. They had an IT upgrade that was supposed to happen in five years back in the 90s and it is 30 years overdue. If that happened in my job, I'd be fired. a similar size bank because uh this guy was equating uh the the amount of data that they manage in the IRS compared to a is compared to a midsize bank. A similar size bank has how many employees? 200. What is their budget? 20 million. So I calculated the difference real quick. I just got on, you know, chat GPJ and say, \"Hey, what's the difference in percentage?\" [Music] And the same bank in the private sector can do this and it's 175 times smaller than the IRS for the same kind of management. You know, I could understand maybe double, you know, maybe maybe it needs 400 IT employees, maybe it needs $40 million, but to need that much money, you know, that's not right, folks. Somebody's getting money. Somebody's cheating, right? Is and this is not good. This stuff isn't good. It's not acceptable. I'm not saying if you get hired by the IRS that you're bad, but I am saying that people in charge of this are doing bad things. And God does not like it. It's not right when people are cheating people out of money. And the folks that are being cheated out are who? That's right. Is any any money that the government spends comes from where? Taxpayer. I hope you understand that. So all government waste is a misuse of taxes. I hope you know that in Proverbs it talks about seven abominations. A proud look, a lying tongue, hands that shed innocent blood, a heart that devises wicked plans, feet that are swift and running to evil, and a false witness who speaks lies. And lastly, one who sws discord among the brethren. These things God what? Hates. They're abominations. They're detestable to him. And so you can have a simple rule in your life. What does God hate? And I'm going to keep myself away from those things. Right? Simple pride. Okay. No more pride. I'm going to be humble. You know, a way we can be humble when we come in is is to worship him. Maybe it starts small and it'll grow over time, but we got to drop the pride. And guys, it's hard for us to not have pride. Amen. We got to drop our pride. Lying tongue. Uh passing information on as fact like evolution in schools. It's, you know, you can't pass the ev evolution theory on like it's truth. And that's what they're doing. They're not just saying it's a theory. They're they're saying this is what's happening. Hands that shed innocent blood, as we have talked about many times, abortion is a great example of that. Kids are innocent. They're not doing anything wrong and and they're being killed for it. Heart that devises wicked plans. You don't want to be like that. Hopefully, you know when you do that, you want to stop doing that. Amen. feet that are swift and running to evil, quick to the crowd, uh slow to God's house, or God's following God's ways. We don't want to be like that. A false witness who speaks lies. This happens in the church a lot. We come up with false accusations. We gossip about one another. We slander, say things about one another without any evidence. And it is not right. God does not like that. A false witness. He doesn't like when we go around talking about one another. one who sews discord among brethren. You come into God's house and you want to split things up and cause division. That's not right. God does not like it. And so these these things here, these things are all things that Christians can do. Christians can have a lying tongue. Christians can shed innocent blood. Christians can speak lies. And so it's important to see and understand that when you do the things that God's hates as Christians, that it's the same punishment as everyone else. Okay? It's important for us to understand that yes, Christians when they disobey, when they do not repent, we can be uh going to that fiery place that you don't want to go to. I don't want to go there, folks. Get get let's get off of that track. Amen. We got to get off of that track. And we have to repent like everyone else. We can't just claim superiority over uh the murderer and oh, they're the murderer. They're the bad guy. I can go do what I want, but he's going to go to hell. Not me. No. What is good for the goose is good for the gander. So don't be either one. The greatest miracle is God changing our hearts, changing our attitudes, our motives, changing people from a life of sin to a life of pleasing God. That is the greatest miracle. And when we pray for revival, we want to pray for that powerful thing to happen. It's not just about miracles and healings and you know if somebody gets healed and they go on keep sinning is that a helpful miracle. No, the greatest miracle is God changing and turning people from those ways. Hebrews chapter 8 verse 6, God has a better promise, a better covenant. Now he has obtained Jesus Christ has obtained a more excellent ministry. He is also mediator of a better covenant which has established which was established on better promises saying I will put my what laws in their mind and what write them on their hearts. I will be their God and they shall be my people. And the atheist evolutions, how is God going to write it on our hearts? Is he going to get a pen and write it on your chest? No. We know what that means. I will be their God. They shall be my people. Do you feel like you don't belong? God is saying, \"You belong to me. I don't care what the rest of the world thinks about you. You're mine. You're important to me. None of them will teach his neighbor, none of his brother. All shall know me from the least to the greatest of them. I will be merciful to their unrighteousness and their sins and their lawless deeds. I will remember no more. God has a better promise, a better covenant than was given to the chosen people of Israel. the the chosen people of Israel, the Jews, the people in in Israel right now, and maybe any Jews that think they're special and wonderful. God has a better promise, a better covenant, and we can have access to that today in our lives. And we can put this hell so far from us and create so much distance between us and hell. It doesn't have to be, \"Oh, I barely missed. Hell nicked me a little bit.\" No, man. No, man. You can be so far from that. So far from hell, help living for God. There's a better a a a better promise, a better covenant that God has made for us. Hell has nothing. Just like when Jesus came, when he came walking on the earth, hell had nothing on him. When he died, it spewed him out of it. Just like Jonah was spewed out of that fish, hell could not contain Jesus. See, it's like, get out of here. You're trying to preach to people. Get out of here. We want to be that way. Amen. where hell is disgusted with us. Man, I want hell disgusted of me. I want hell saying that stinking Mike. I want to kick his little butt, right? And we can have that. We can have that by knowing Christ, by letting his laws be written in our hearts, our minds. We can have it by knowing him. Amen. You don't have to wait. You don't have to believe in God just a little bit. You don't have to have a a a very touchy relationship with Jesus. You can have a fullon uh great relationship with God and create huge distance between you and hell. And you also can have Jesus. He's more important than all of that. You know, I don't think about hell. You know, if you're thinking about hell a lot, like, \"Oh, am I going to go or not?\" You got a problem. You know, people that know God and and know his word and are seeking him and following him, they're not thinking about, \"Oh, am I going to go to hell?\" No, they're not thinking about that. They created a bunch of distance between them and hell. And we want to be that way. Amen. You can do it. And so, we got to stop doing what is detestable to God. And we've got to find that great miracle that he has for everyone in this world. And that is that he can transform our minds, our hearts, our desires, our motives. Transform them. Change them from what they were to what he wants."}