{"video_id": "BFzTIpTaCmI", "title": "Is It the Same Today as Yesterday?", "published_at": "20250923", "transcript": "We ready? So, we're going to take a look at Old Testament scriptures today. Uh, in Hebrews 13:8, Christ is the same yesterday, today, and forever. Now, this is a very bold statement by God. Christ is the same yesterday, today, and forever. So Christ was before he came. Christ is after he came and ascended. And Christ has always been. So we're going to go to the scriptures and see if God is the same yesterday, today, and forever. In 2 Chronicles 29:11, talking to the Levitical priesthood. Christ came through the MEZDC priesthood, but he's talking to the Levitical priesthood. And he says, \"My sons, don't be negligent, for the Lord has chosen you to stand before him like we did just earlier to serve him and to minister unto him.\" When we praise and we pray, uh, we are ministering unto him. We should be ministering unto him. Okay? And to burn incense. Let my prayer come before thee as incense. Now remember, Solomon had 128 piece choir. And Solomon had a 288piece orchestra. In the churches in America today, they have basically three or four instruments. Electric guitar, bass guitar, keyboard, drums. And the churches have just thrown out psalms and all the rest. The wind instruments and the are all gone. But we need to get him back. To minister to God's people and sinners, we must first minister unto him. And that's what this verse is talking about. Remember Jesus first called his disciples to himself and then he sent them out. Church, we got to come to Christ to let him teach us, to let him touch us and send us out and we will be very effective. Are you with me? >> Yes. >> Okay. So that it was the same in the Old Testament as it was in the New. Christ brought him to himself. So that is true. That part is very true. As living stones, we are built up a spiritual house, a holy priesthood to offer up spiritual sacrifices acceptable to God through Jesus Christ. More confirmation that what happened in the Old Testament happened in the New. The Bible says that Christ is the same yesterday, ever. And we're going to see if it's true. In the Old Testament, God spoke audibly to his people on the Ark of the Covenant. God talked to Moses. All of Israel could hear the voice of God talking to Moses. That's how he did it in the old days. He also had a visible present. The cloud by day, the fire by night, the whirlwind when he talked to Job, the angel in the burning bush. God can manifest himself visibly and he did in the Old Testament also as an individual, a person. David said, \"The spirit spoke by me. His word was in my tongue. When you're in your prayer and you're praising God at home or wherever, let the spirit speak through you. Let your ears need to hear you talking to God. And uh that happened in the Old Testament. These things are factual. Did God do that? Is he the same in the New Testament? All right. Visibly the shepherds saw the host of angels in heaven. Is that a visible manifestation of God? Yes. The wise men, they followed the star, a visible manifestation of God, which is really an angel. The angel spoke to them that the king of the Jews is being born. They followed that star. They followed that angel. And that angel hoovered over the place where Jesus was and they went in and worshiped him. A visible manifestation. And we need to hear this kind of preaching because God said in he in Acts 3:8 that he's going to restore all things spoken by the mouth of the prophets since the world began. And we need to start believing God can manifest himself visibly and audibly as well as speak through us. Could that be an amen? >> We need to preach higher than we are experiencing. And I learned that as a young minister to preach things I didn't I hadn't experienced, but they're in the word. And when you preach them and they're in the word, then you get to experience them. Could that be an amen? And so it doesn't shock me when I'm overseas and I find that Jesus came to Muslims and and and Hindus and and different religions and appeared to them and said, \"Hey, I'm the one you're looking for.\" That is Bible. >> See, God can manifest himself visibly today, also audibly. When Christ was baptized, God spoke from heaven and said, \"This is my beloved son in whom I am well pleased.\" Everybody heard the voice of God. Wouldn't you like to hear the voice of God? >> You see, we we got to break through this this this present level where we're just satisfied with praising him and that presence comes and we just love it. We got to break through >> and let him manifest himself. Could that be an amen? >> Yes. At the transfiguration, God again come and spoke from heaven. This is my beloved son. Hear you him. Shouldn't we be listening to Jesus today? Don't we need Jesus speaking through us like he did David? >> And instead of us doing the talking, God talks through us. >> Yeah. And it happened in the New Testament. So God is the same yesterday, today and forever. What he did in the Old Test Testament, he did in the new. And then he spoke by people. In Acts 13:1, there were prophets and apo and teachers at Antioch. And God said, \"Separate me Paul and Barnabas.\" He spoke through one of the prophets. He spoke to someone who's there. And they spoke that prophecy and everybody knew it was God. And they prayed for Paul and Silas and sent them out on a mission trip. And we have it all recorded in the book of Acts. Amen. >> In Acts chapter 2 verse4, when they spoke in tongues, they spoke what? The mighty works of God. They didn't just shaky that in that language. They were speaking the mighty works of God. And everybody didn't need an interpretation because they were speaking in the heavenly language that everybody understood miraculously. by God given them the understanding >> and tongues are a sign for the unbeliever. By the way, tongues are important. Okay. So, God is the same yesterday, today, and forever. Didn't we see it? And can we have it today? I mean, was this just for the early church? No. It's for all of us. But we've got to teach it. We've got to pursue it until we possess it and God is changing lives in our midst. How will we bring the presence of God to me? David said in 1 Chronicles 13:12, \"And David appointed Levites, the ministers, to minister before the ark of the Lord.\" Here it is again. minister unto him, minister unto the presence to record, to bring back to remembrance and to thank and to praise the Lord. And David danced before the Lord. We have all this that was restored to the church back in 1948 with sultry, harps, symbols, and trumpets. Well, I'm praying God gets the orchestra back in his church because I knew we had an orchestra of 26 people in the vine. And I I could back up any direction God's presence went by certain instruments. Certain instruments back up certain presence of God. Are you with me? >> We don't need just electric guitars and a drum and a so forth. We need we need to believe God for everything. Amen. If we want restoration, we got to pray for restoration, church. We can't be satisfied with what we have. When the instruments and the music and the singer were as one to make one sound to thank and to praise the Lord, God's glory filled the temple and the priests couldn't minister. And the presence of God is threatening to preachers because they like to preach. It's a fact. It's a It's a It's threatening to leaders because they like to lead. The worship leader likes to lead. The teacher likes to teach. And we just we just push God right out of the program. Could that be true? >> Yeah. We need restoration. And this is what happened back there. The glory of God came. Do we need his glory? His manifested glory where he is doing things. He is expressing himself through his people. Solomon finished praying when he built the temple. And when Solomon finished praying, fire came down from heaven and consumed the burnt sacrifices. And God's glory filled the house. Church, we need to pursue the glory that comes down and fills the house that can do greater things than the priests and the ministers could do. >> I have to pause there so you can think of that. This stuff is real. This stuff is genuine. And I am talking to thousands of people every week on Facebook, on the internet, and there's such a lack of teaching out there. There's such a lack of pursuing God. And then they make excuses for for not having the things of God. There is no excuse. He has given us a salvation that there is no excuse for. Amen. >> Hallelujah. We need to get back to God. so we're going to take at the a look at the New Testament church service. All right. Make all things by the pattern shown you to on the mount was in the Old Testament. All right. In the New Testament, we got to go by God's pattern shown to us. 1 Corinthians 14 when the whole church comes together in one place. And I tell you, being here in person is a lot different than me watching you online. >> I can see your faults. I'm just being blunt. Online, I can't. I can experience where you're at online. I can't. Maybe Barnes can, but I can't. And I didn't know that till I got here. I I I love the services online. I thought everything was great, but when I got here, are you there? Let me ask you a question. Why did you stop the service last night at 8:30? Why didn't you go to 9:30? Why didn't you go to 10:30? You were out of order. The Bible says, \"Do all things decently and in order.\" Is that right if I talk like that? Hallelujah. >> I've already talked to Mike about it. And uh Samuel, these two guys have such a future that they can't even see the future that they have. Hallelujah. >> And it's good because it keeps you humble and it keeps you seeking God. >> But us old-timers will be good for these young guys if we are on top of things. If we're stuck in yesterday, we're worthless. God help us not to be stuck in and my 20 minutes is almost up. Each has a psalm. Each has a teaching. Each has a tongue. Each has a revelation and interpretation. Let all things be done for edification, encouraging the body, building the body up, not your ministry, not your little pet doctrines, but everything should build on each other and it should be building the church of God. Okay. So here we find the responsibility is not just on the pastor. When I go to these churches and I visit these churches, they are taught and everybody is looking to the pastor to do everything. It was unbelievable. The people just come sitting in a pew like you go to a football game and sit on the in in the seat and you root the team on in the ground. God wants us to be on the team. >> Are you here, church? We're supposed to come to a service with something to contribute >> and we have to do it in the proper timing and in the proper atmosphere that what God give us fits into. I I told these young men yesterday, I got prophecies sometimes week weeks before they were needed in the church service. It was a proper time and the direction was right for that prophecy. But you can get things at home. You can get a prayer. You can get a prophecy and you can bring it to church and then it takes a good leader to direct that service and keep it building up on each other. One can't be talking about the blood of the lamb and another one talking about hellfire. It's got to build up in a teaching theme, always ascending. And that's why it takes a leader. It's a it's imperative that we leave the leading to the leaders so they can learn to lead. At least a sheep can get in the way trying to lead from the pew. >> Are you hearing me? Yes. >> See, we can't leave everything up to church leaders, folks. God didn't do it. I got three minutes left here. Prophesy for edification, exhortation, and comfort to all. This is 1 Corinthians 14. This is the church structure. Prophesy. Pray with the spirit and pray with the understanding. So many of us pray without understanding. We just God give me a better job. God, give me a new car. God's not interested in that only. He's interested in building his church. We can sing with the spirit and understanding. Now, this happened last night. Prophecies did come. Praying in the spirit did come. Songs did come, but it took us an hour and a half to get there. Is God that slow? It takes us an hour and a half to get there because we don't come and ready to move. I told the church up in La Habra that us old-timers don't take very long to get into God. Our waiting on God is short. We've been around. Our seeking God is short. because they they wanted to know the difference between senior and young believers. Well, that's the one we've been around the block, but us old-timers can get stuck in yesterday. Be satisfied with where we're at. So, why do we do all these things mannerly, orderly, and with understanding? the unbeliever and the unlearned come into the church. Now, we didn't have any unbelievers last night, but we had a lot of unlearned. >> Just letting it sink in. I got one minute left. >> They are convicted. >> I got Oh, I am corrected. I got three minutes. They are convicted. They are convinced. Okay. Convicted and convinced by who? God coming and manifesting the praying, the singing with understanding and the singing in the spirit and the prophecies, the tongues, the interpretations, the revelation, the psalms that we bring. God comes and convicts. Who is the convvictor? The Holy Spirit convicts us of sin, righteousness, and unjudgment. It's not the pastor. It's not the people God used. The Holy Ghost comes. Jesus comes and convicts these unlearned people. And see, if we're not teaching things when we do these prophecies and all that, it's worthless. If we're just speaking and singing scrambled eggs and with no specific direction, it's worthless. The unlearned have to be learning something. And the unbeliever is learning. He is judged of all. He is convinced and the secrets of his heart are manifest. He falls on his face and he worships God saying God is truly in your midst. Who is doing that? The pastor isn't up there saying now let's get on our face. Are you there? God comes and no one told them to fall on their face. They fell on their face and they worship the one who convicted them, who came to them. Jesus comes and does this stuff. He is the chief shepherd. We are undersheperds. Are you with me?"}