{"video_id": "BGFCzoZrHLk", "title": "Blood of Christ — March 30, 2025", "published_at": "20250330", "transcript": "Well, good morning everyone. Good morning. It's good to be in God's house. I'm going to read out of 1 Corinthians 14 verse 26. It says, \"Whenever you come together, are we together?\" Amen. Each of you, oh, each of you, oh my goodness, has a psalm, has a teaching, has a tongue, has a revelation. Oh my goodness. Revelation, an interpretation. Let all things be done for what? Edification. Edifying is the building of God's house. And God wants to build us. Amen. And then it says the order of everything for for you for you can all prophesy one by one that all may learn and may be encouraged for God is not the author of confusion. So I want to encourage you this morning this chapter and these verses remind us of the involvement of God's people. The involvement of God's people. Right? It says each of you, each of us. Amen. And God is reminding us this morning how he wants us all to be involved in his house. Amen. Amen. And so I want you to remember that during our worship time and during our the word time, uh we have a lot of time in between songs in between um at the end al to to pray for one another to lift up our voices for one another. So I encourage you, let us remember these things that the Bible reminds us of. Let us remember these things that the church is about. You know, the thing that makes us different than all the money that the world has. The money the the the world is able to feed people. They're able to do all kinds of things, give all kinds of things away, money and give uh goodies to people, but they do not have the spirit of God. They do not have the living God. They do not have the ability to build up to to help people build up themselves spiritually, but we do. Amen. Amen. So, will you stand with me as we sing and we start worship [Music] together? Well, good morning. Good to have everybody this morning. We've been talking about hell. What a wonderful message that was last week. [Laughter] uh and how you get there and how we don't want to go there. Amen. Keep me out of there. Hallelujah. And uh the great solution that Jesus has provided, again, as I said last week, he has gone through great lengths to keep us out of hell and to bring us to himself. And this morning, we're going to talk about the blood. If you have you have your sheets in front of you with the scriptures and you can follow along and you can read these later. You can pray over them. You can uh be insured that I'm sharing with you the scriptures. Isaiah 52:14 says, \"Just as many were astonished at you, so his visage was marred more than any man and his form more than the sons of man. Jesus Christ was brutally beaten and his flesh stripped by by the catine tales and he was turned into a uh unrecognizable piece of meat on the cross. Isaiah 53:2, he has no form or comeliness. When we see him, there is no beauty that we should desire him. He is despised and rejected by men. A man of sorrows and acquainted with grief. I put up here. He has no beauty or aura. That's a new word going around with the young people. Aura. Has he got aura? He had no form or comeliness. He wasn't walking around with with a halo around his head. Right? But Jesus says he has borne our griefs and carried our sorrows and the Lord has laid on him the iniquity of us all. It's important to remind be reminded of these things. Jesus Christ was born in a you know lowly place, right? He wasn't born with the Roman Empire and the Caesar bringing him into the palace and all that. He was born in dirt and he was humble. He lived in a humble way. He worked. He did everything that we do and had to face a lot of the challenges that we faced. Uh it says that he he did face all of these challenges. But it's good to be reminded that he was marred beyond recognition. He was despised and rejected. He bore our griefs. He bore our sorrows. And he took upon him the iniquity of all of the world. And so his death on the cross was for our redemption. He was a normall-look man. He came in a normal way. Uh so what are you left with? If Jesus comes in a normal way and he looks normal and you're like thinking, \"Well, I don't see anything great about this guy.\" What are you left with? You're left with his word. What is coming out of his mouth and what he did? the severity of Jesus's suffering in Matthew 27 26 he released Barabus to them and when he had scourged Jesus he delivered him to be crucified the uh flagrum there that's what they're calling it had a wood handle leather strips and at the end it had a metal weight right so when you swing it it has some weight to it just like when you're casting you know going fishing you want some weight on that thing they did the same thing with a whip so it has some weight and it would have a piece of metal at the end and also some bone or some glass or a fragment that would do the damage to the skin. And so they whipped Jesus. And you remember there was a whole band of soldiers that did this. They made sure Jesus was uh messed up beyond as Isaiah says more than any other man. John chapter 19 verse 23. When the soldiers crucified Jesus, they took his what? Clothes. Psalms 22 verse 17. I can count what? All my bones. So there's nothing you can't see. And I have a covering uh little circle here for us. But Jesus was naked. Remember that. There was nothing covering him. And that's very embarrassing for the son of God to be naked. And so Jesus bore our humiliation. He bore our nakedness on the cross. He was detestable in sight for our sake. Romans 3:23, all have sinned and fallen short of the glory of God. So Romans 6:23, the wages of sin is death, but the gift of God is eternal life in Jesus Christ our Lord. So this gift that Jesus gave was that he put himself on the cross. He knew it was going to happen and he went al uh at the right time. He knew the timing, right? He didn't let them throw him off the cliff. Remember that they wanted to throw him off the cliff. That's important to remember later. They wanted to kill him another way. They may have wanted to stone him. Okay. Herod wanted to see Jesus and Jesus like, \"Ah, get me out of here. I'm not No, my time is not yet.\" But at the right time, Jesus showed up on the spot, knew what was going to happen. He knew their heart. He knew their thoughts. He knew what they were going to do, right? He can hear what they're planning. You know, if God can hear what you're planning in your head, he knows what you're going to do, right? You know, we always think Jesus has got everything. He sees it all, the future. Now, he's just I mean, all you just got to listen to the jabber going on your head. You know what's going to happen. Oh, he's like, \"Oh, what is that guy saying?\" Oh, okay. Well, I know what they're going to do, right? For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord. That wonderful gift is his life that he gave. Revelations 21:8, the cowardly, the unbelieving, abominable, murderers, sexual immoral, sorcerers, idolattors, and all liars shall have their part in the lake of fire, which burns with fire and brimstone, which is second death. What? Isn't that great? No, we don't. Uh, as we learned last week, we learned who goes to hell, and we don't want to be part of that group. Amen. And so we repent. If you commit these things, what do you do? Repent. And what does repent mean? You turn away from it. And also you ask for what? Forgiveness and cleansing. Right? And Jesus does the work. He'll do it. Proverbs 15:8, the sacrifice of the wicked is an abomination to the Lord. In Proverbs, he uh reminds us here that you can be going to God's house and making sacrifices. Okay? He's talking to the church. He's talking to uh the Christian world. He's talking to the Jewish world. He's talking to the all the religions. They come in with their sacrifices. They're doing their thing unto whoever we we come in and we sacrifice unto God. And to him it's an abomination. You can't be having that wickedness going on in your life and in your heart and expect God to honor. Amen. Important to understand in Hebrews chapter 13:8 Jesus Christ is the what? Same yesterday, today, and forever. Malachi 3:6, I am the Lord. I what? Do not change. I change not as King James says. Therefore, you are not consumed with Oh, not that. Okay. But we want to remember when Jesus and God spoke its truth through the Bible today, we can't change it. Every generation must meet the same requirements. We don't change him. For those who are controlling or narcissistic, you can't manipulate God. You can't outsmart him. You can't twist his arm. You know, some people are used to manipulating others, right? You can't manipulate God. He knows what's going on in your head. He knows our heart. He knows our thoughts. He knows what actions you'll take. He doesn't change. And so what we're left with is our willingness to respond to Christ. And it's important to understand that is God forcing us, is God making us do something? Uh you might want to change your thinking there. Remember, God created the world. He has authority, right? And so, he's giving us the instructions and the way that we can come to him. And if you were given an antidote to some poison, you would take the antidote, right? And the antidote to this life is coming to God and Jesus Christ. And if you had those instructions, you would take them, wouldn't you? I want them. 2 Samuel 3 27, Joab took Abner and stabbed him in the se stomach so that he died for the blood of Asahel, his brother. That's exactly what the statement says, exactly what I'm bringing up. Joab uh killed Abnner. Joab had a brother Asahel that Abnner killed. And so we see here that he died for the blood of Asahel. Talking about the death of Asahel. Okay. So, it's not just blood here. He didn't cut his arm. It was his death. 2 Kings 9:7. You shall strike down the house of Ahab, your master, that I may avenge the what? The blood of my servants. The blood of all the servants of the Lord at the hand of Jezebel. So, Jezebel and Ahab were killing the prophets. And Jahoo here is not mentioned in the scripture here, but that's who he's talking about. You Ju shall strike down you know Ahab and Jezebel to avenge the what? The blood the death of the prophets. Matthew 27:4 Pilate washed his hands saying I am innocent of the what? Blood of this just who person. And that is who? Jesus Christ. The blood the death not the cutting of his arm. Not the oh he got nicked on the no the death of Jesus Christ. So we see here that blood is the same as death. Hebrews chapter 9 vers 22 according to the law almost all things are purified with blood and without the shedding of blood there is no remission. And it's important as we said earlier they had a chance to throw Jesus off the cliff but that didn't work out. Why? Because it's important that blood was shed. Jesus couldn't be strangled to death. He couldn't have drowned. He couldn't have uh you know been killed another way. There had to be this shedding of blood for the remission of sin. And so God planned that Christ would die on the cross and shed his blood and die in that way. It's important to understand that and all for us that we would not have to suffer anything like this. So this this is the good news and it's imperative very important that we respect Christ. And I'm just speaking to you as just another person here. We've got to get serious about respecting and honoring our Lord and Savior Jesus Christ. And if you do not have any respect, I feel sorry for you. If you do not have any respect or love and appreciation for Jesus Christ, I feel sorry for you. That is not the perspective. Every day our our our approach and our attitude toward Christ should be one of thanks, of gratitude, of gratefulness, and of wanting to please and honor him. And if you don't have that, you got a problem. And we need to change. Amen. And so if he acted this way and if he gave his life a sacrifice, at least we can sacrifice some time to go to church, some time to pray, some time to read the word, and some time to do right in our lives. Amen. Christ did not give any excuse of going on the cross. Uh and if he did, we would all be lost. And so we can give up our excuses. Amen. Right? No more excuses. And so we want to look at the triumphs of the blood. And there's 10 things. I'm going to get to about seven today, but these are very important. First John 1:7, if we walk in the light as he is in the light, we have fellowship with one another. And the blood, say that with me, the what? Blood of Jesus Christ, his son, what? Cleanses from all sin. Ephesians 5:25, Christ gave himself for the church that he might sanctify and what? Cleanse her with the washing of water by the word. that he might present her to himself a glorious church, not having spot or wrinkle or any such thing, but that she should be holy and without blemish. So, we see the goal here. The goal for God's church is for us to be without spot or wrinkle. And he does that with his blood. And he we we we keep that up by coming back to him. Remember the scriptures say if you sin and we do if you s sin you have an advocate with the father right. But first of all we want to understand this slide. He cleanses from all sin. His blood is higher than any law. It's a higher law than anything that has been spoken. The blood of Jesus Christ cleanses from all sin. Jesus Christ has not given up on you. God has not given up on you. There are no exceptions to what his blood cannot cleanse. And so we don't want to harden our heart toward God, toward Christ. And so it's not just a pardon, it is a transformation. Romans 2:5, but in accordance with your hardness of heart, you are treasuring up for yourself wrath in the day of wrath. Everybody say that word, wrath. and revelation of the righteous judgment of God who will render to each one according to his deeds. It's important for us to know that God is going to render to each according to their behavior. They what they do, their deeds and how they're acting. If if you are a liar, if you are hurting people by uh rejecting the the the second of the second part of the ten commandments, you're hurting one another, not loving your neighbor, that you're going to bear a penalty for that. the punishment of them. Romans 5:9, having now been justified by his blood, we shall be saved from what? Say it with me. The what? The wrath. Saved from the wrath through him. And so his blood saves us from what we deserve. It's important that we don't stop at this spot. Don't stop at I'm going to heaven. It's the first step to climb higher in Christ. But this is just the sound the foundations. Revelation 12 11. They overcame Satan by the blood of the lamb, by the word of their testimony, and they did not love their lives to death. They overcame who? Say it. Satan by what? The blood. Hallelujah. We can overcome Satan by the blood of Jesus Christ. This is one of the great triumphs over about the blood. Romans 16:20, the God of peace will what? Say it. Crush Satan under your feet shortly. Who is going to do it? The God of peace. Who is that God? Jesus Christ. And how did he do it? With his blood. Amen. Hebrews 2:14, that through death he might destroy him who had the power of death, that is the devil. Through, it says, through death, through his death, he might destroy him. Through Jesus's death on the cross, he destroyed Satan. And so, we can't blame Satan for all these things going on in our life. We can't blame Satan for taking control and making us speak or talk or act or hurt people. No, the blood of Jesus Christ is powerful. The blood of Jesus Christ puts him at bay and says, \"No, you can't do that.\" Amen. Hosea 4:6, my people are destroyed for lack of knowledge. It's important that we understand what the blood does and that's a wonderful thing when we understand how powerful that blood is. And so his blood is sufficient and it is a great inheritance given to to us by him. Acts 20 28 take heed to shepherd the church of God which he purchased with his own blood. We have been what? Purchased knowing you were not redeemed with corruptible things like silver or gold from your aimless contact conduct received by tradition from your fathers but with the precious blood of Christ. And so we have been redeemed. We have been purchased by the blood of Jesus Christ. And so it being that is the case, we should follow and are commanded to follow him. The preacher did not die for you. The person who has a doctrine did not die for you. Some man didn't die for you. It was Jesus Christ. The church, vine cluster church did not die for you. The church down the road didn't die for you. And so who do we serve? We serve Jesus. And we encourage you here to serve who? Jesus Christ. Not the kingdom of darkness. Not oursel. And people will twist Jesus in his words and say that he's forcing me to do something. But this is what the person who wants to approve serving themselves will say. It's important to understand the perspective. Christ has purchased us with his blood. We are not our own. 1 Corinthians 6:19. Do you not know that your body is the temple of the Holy Spirit who is in you whom you have from God and you are not your own? 1 Corinthians 6:20, you were bought at a price. Therefore, glorify God in your body and in your spirit which are God's. And so God is asking us today, when is the last time we asked him, what can I do to make you Lord of my life? If Jesus were here right now, what would he say? And I can think of what he would say to me. When is the last time I asked him, \"Lord, how can I make you Lord of my life? How can I make you master? How can I follow you wholeheartedly? When's the last time you asked that question? And we don't belong to oursel. We don't belong to a denomination. Baptist, Catholic, Mormon, or whatever the cool Christian group is. Or the Jews. You know, anytime a Jew converts to Christianity, they're like, \"Oh, well, Jew, I'm a Jew.\" Well, great. Do you follow Christ? We know all about the Jews, but do you know about Jesus? And are you following him? And since Christ took this punishment, he says, \"For this reason, glorify God in your body and your spirit.\" And so when we fail, he expects us to admit we are wrong, repent from it, turn from it, and ask him to forgive us and cleanse us and heal that wrong. And so that's our process. That's what God is expecting. And he wants us to keep going and keep what? glorifying God in our flesh. Amen. The goal is to be changed day by day, to keep going up. Romans 5:9, another thing that the blood does. For if when we were enemies, we were reconciled to God through the death of his son. Much more, having been reconciled, we shall be saved by his life. So, we have been, what's the word? Reconciled. We were made right. We are acceptable in God's house. We are acceptable to Christ. He's not looking at you wanting you to run away. He is accepting you and he can reconcile you by this powerful blood of Jesus Christ. And so if you have flaws in your life, do we have flaws in our life? That's an easy answer. Yes. You uh maybe you just got saved. You still have flaws. Amen. In spite of our flaws, we can get justified, reconciled, and we can touch God. You see, if you just got uh if you still have flaws in your life, you come in this morning, we had an opportunity where we could what? Touch God. Amen. And so God is continually working with you, working with you because he loves you. We can move on in God. We don't have to beat ourselves up. We're not perfect yet, but we can stand uh in be in good standing with God because of his blood. Amen. Hallelujah. And lastly, the last thing we're going to mention today, Exodus 24:8, Moses took the blood, sprinkled it on the people, and said, \"This is the blood of the covenant which the Lord has made with you according to all these words.\" And G and Moses went up with Aaron, Naab, Abaihu, and 70 of the elders of Israel. And they what? Say that big word. They saw the God of Israel. So, first that blood was sprinkled on the people, the blood of a sacrifice. We don't do that anymore because we have Jesus our sacrifice. But by that blood, Moses and these elders went up and they saw God. When's the last time you saw God? Don't you want to see God? I want to see God. Don't you want to hear God? I want to hear God. Hallelujah. And so he does this by the blood. We don't need to sacrifice the blood of animals. Jesus Christ has done it already. But we must realize that we have been invited into the very presence of God. these Moses, Aaron, and Naab and about I I share these scriptures with you. You can go back and find out the before and the after and what the story is. But these people were about to go up to the mountain of God where God was. And all this time, Moses is the only one going up. But here, that blood made a way for everybody to come up. That invitation is inviting everyone, all of us to see, to know him. Hebrews 10:19, \"Therefore, brethren, having boldness to enter the holiest by the blood of by the what?\" By the blood, we can have boldness to enter the what? Holiest. And so when the Jew comes up to you and says, \"Oh, no. You're not a you weren't born of the right person, and you're this or you're that, you're not a Jew. You you're not this or you're not that. You weren't born to the right people. You weren't living in the right place.\" is you can tell him stop cuz I can enter the what? Holiest by the blood of Jesus Christ. You can't enter in because you got to go through the high priest. But I can by the blood of Jesus Christ. And as long as they reject the blood, they can't go in. Amen. But we can go in. And you can go in today. You can go into the place where the the holiest is where the presence of God was, where the word of God was. Inside was mana. Inside the ark of the covenant was mana. Inside the ark in the covenant was uh the rod that budded the mana. Something else. The ten commandments. Thank you. And God would speak with people there and have an effect and an impact on them. And he can do that for us today by a new and living way which he consecrated for us through the veil that is his flesh and having a high priest over the house of God. If you remember when Jesus died on the cross the veil was torn in two. And he saying here in Hebrews 10:19 that veil is his flesh. It was torn, torn, ripped apart. And he tore uh that that that blockade. Hey, by the blood of Jesus Christ, you can come into the holiest of all. I'm sharing with you. I want you to understand you have such an opportunity today to meet with God. everyone in the whole world. There is nothing stopping you from going into the holiest from knowing God the most you that you can from pursuing God in the most powerful way that you can. There is nothing stopping you. The blood of Jesus Christ is that powerful. And let us draw near with a true heart in full assurance of faith. Do you have a true heart this morning? Let us draw near. Are you drawing near this morning? Do you have a desire? That's what the spirit was crying out to this morning. The spirit was putting into Miss Kathy Silo over here and uttering with the scriptures. The spirit saying, \"Hey, where do you have a desire? Let us draw near.\" Is God drawing near to him on your schedule, on your plan? And do you come to him with a true heart or are we still hard? We shall know the truth and the truth shall set us free. Amen. And so we don't have to be afraid that God's going to stomp on us, throw us out. We can have full assurance of faith because of his blood. And if we accept his invitation and through prayer and through praise, through reading his word and seeking him, he will come. He can he will touch us. He will meet with us and he will speak with us. And so God has done a powerful work to accomplish these things. So good what God has done for us. Matthew 27:50, Jesus yielded up his spirit. It's important to know that Jesus gave up his spirit. Nobody could take it from him. Nobody had the authority. Not even the devil. He gave it up. Behold, the veil of the temple was torn in two from top to bottom, and the earth quaked and the rocks were split. As we said earlier, Ephesians 2:18, for through him we both have access by one spirit to the father. Through him we have what? Access. The access has been granted. The key has been mailed to you. The the code has been given to you, the security code. You know, only certain people have a key to that door right there. But God has given you, every one of you, the key, the security code to enter in access. at my work. Well, I have to grant I have to request access for this, access for that. I need to be a so I can do my job. They're like, \"What do you need it for?\" I got to do my job, you know? Please, what how else do you want me to build all this stuff? I need access. But God has given you the big key to access by one spirit to the father. Hallelujah. Jeremiah 31:34. No more shall every man teach his neighbor and every man his brother, saying know the Lord. For they shall all what? Know me. From the least of them to the greatest, says the Lord. From the least to the greatest. Everybody's been sent the key. Everybody's been sent the key. Everybody's been given access to Christ. And so God is asking us, are we going to keep walking by that wonderful holiest place or are we going to start entering in? Amen. And so we're reminded this morning that we are cleansed from all sin. As uh Mr. Thompson prepares the communion, we're reminded this morning that we are cleansed from all sin. We're victorious over Satan. We're saved from the wrath to come. How many you glad of these things? Amen. Aren't you glad you can be victorious over Satan? Yes. You have been purchased. You belong to Christ. You don't You have not been purchased by Satan. You have not been purchased by some other man. You've been purchased and you belong to Christ. And normally we have a negative con connotation to being purchased, right? But see, Christ purchased you for a good reason. Because if he didn't purchase you, you'd be in a world of hurt. Amen. He has redeemed us. Remember the scriptures say that the thief has come to steal, kill, and destroy. But Jesus has come and he has purchased you and redeemed you so that he might give us what? Life and life more abundantly. His blood has reconciled us and his blood has made a way for us to be invited to know him. So as we take communion this morning, will you stand with me? And before you take the elements, let's we're going to go through the scriptures and we're going to pray for the cup and for the bread. Amen. But please don't eat them yet. 1 Corinthians 11:26, \"Whenever you eat this bread and drink this cup, you proclaim the Lord's death until he comes.\" And the Lord's death is very important. We learn this morning. Amen. His blood is very powerful and very important. And looking at the bread right now, let's take out the bread. 1 Corinthian Corinthians 11:24, \"Take, eat. This is my body which is broken for you. Do this in remembrance of me. In Romans 12:5, it says that we being many are one body in Christ and individually members of one another. And the scriptures remind us to pray for one another, to pray for a powerful work for God to do in us. And so as we partake and after we partake of this, I want us to pray for one another. I want us to ask that God would strengthen the body of Christ. Amen. So, let's pray for this bread. I'm going to ask somebody to lift up their voices for this bread. Uh who do I got here? And as we transition to the blood, let's reach our hands over to one another. We want to pray for one another right now. That God would do what he said in his scriptures he would do. that God would that we would have be given a desire, a new heart. Let's pray and lift up our voices for one another right now. Lord God, we come before you, Jesus. We pray for your body. We pray for your people. God, we pray, Lord Jesus, that you make yourself real to us. Lord God, we pray, Lord Jesus, that you make yourself real to your body, Lord God. Lord, Lord, from any age, Lord, all from the young to the old, Lord Jesus. Lord, from the least to the greatest, Lord Jesus, as the scriptures say, we pray for your powerful spirit to come. We pray for your sp powerful word to come, Lord God. Lord Jesus, we ask, Lord, that you would change our hearts, that you would change our desires, Jesus, Jesus, please, Lord, we ask, Lord God, that your spirit would move, God, that your powerful work would be done in us. We thank you for your blood this morning, Jesus. Thank you, Jesus. And we want to take this blood together. The cup Jesus said in red letters, \"This is the cup. It's the new covenant in my blood. Do this whenever you drink in remembrance of me.\" And we are invited by his blood to enter the holiest. Amen. The best place God has for us has been we have been granted access by his blood. I'm going to ask Carmen to pray for the blood the cup this morning. Carmen, will you pray please? So, as a song plays here, I want us to res uh take some time to respond to the invitation. We want to recognize what Christ has done in us by his blood. We want to recognize what Christ has done uh over Satan in our lives. How he has saved us from the wrath. How we belong to him. We've been reconciled and we've been invited to know him to come to the holiest. And so as this song plays, let's lift up our voices and pray and come before Christ like that woman did as as was expressed earlier. She was talking about the woman who had uh the issue of blood. She had no solution and she got out from where she was. The doctors couldn't help her. She came to Christ, reached out and touched him. And that's what we want to do this morning. We want to have an opportunity to touch Jesus Christ. Amen. So, let's I invite you right now. Let's lift up our voices. Come forward and pray unto God. this morning. Lord Jesus, we come before you right now. Lord, we pray. Lord Jesus, we respond to your invitation. Jesus, Lord, we respond, Lord, to Lord, what you want to do in our lives, Jesus. Jesus, Lord, we thank you this morning. We thank you for your blood, Lord, that has given us access, Lord, to so many things, Jesus. We pray, Lord God, for a new heart. We pray, Jesus, that we would have a responsive heart. We pray, Lord Jesus, that we would, Lord, be removed of all our hardness. God, we come before you right now, Jesus. We respond to your invitation. God, we want to know you, Lord. We reach out to you, God. Lord, how how can I make you Lord of my life? Jesus, Lord Jesus, we come before you, God. Lord Jesus, you're the King of Kings, the Lord of Lords. Jesus, Jesus, Jesus, Jesus, Jesus, Jesus, Lord God, you're the King of Kings, and the Lord of Lords. Jesus, we thank you, Lord God. Thank you, Jesus. in all when you as a precious worship. So much grace. and you just came to love us, Lord, and just uh thank you for that sacrifice, knowing that we come to you with pain and health issues and problems, Lord. And we know that we can trust in you for all healing spiritually, physically, Lord, and that you can do all things for us, Lord. And Lord, just thankful that you can just come for us, intercede for us, Lord. That you come to save us, that you come to heal us, that you redeem us, Lord, and that we have full salvation, full renewance in you, Lord, that you we are new people in you, Lord, in Jesus. We can grow in you. And we just pray, Lord, that daily we come to you, that you Make us new, Lord. Make our spirit new. And that you just change us, Lord, for the better. Let us be light for others. Give us boldness to share the gospel with our friends, our family, and anyone that comes across that may be in trouble. Lord, that we can share your word and the sacrifice that you did at the cross. Lord, just let us share that with others. they can come to know you, Lord, and that they can come to know your salvation and your love and that they can change their lives. Yes. Pray all this in your son's name. Amen. Amen. Amen. Hallelujah. Amen. Thank you, Jesus. Amen. Everyone said amen. We lift our holy hands up. We want to touch you. [Music] We lift our voices higher and higher and higher you. Those online, we trust that you've been reminded this morning of the power of the blood of Jesus Christ. what it's triumphs that he has brought in your life that has given you great access to the holiest and the best place in meeting with God. We ask that God would bless you and and with this trust and this understanding that you would go and seek your God and find him. And we pray that God gives you a desire to go into the holiest to seek and pursue your God. God bless you. Thank you for joining us online."}