{"video_id": "dsIbw4KPAKE", "title": "What Will We Do in Heaven?", "published_at": "20250923", "transcript": "What will we do when we get to heaven? >> I love that. I asked this question. No one can answer me. Yes. >> Living right. Yeah. He that doeth right is righteous even as Christ is righteous. >> Amen. And listen to this. John says, \"They that are born of God do not sin, and they cannot sin because they're born of God.\" Wow. How many times you hear that on the radio and TV? Never. He that is born of God doeth not sin, and he cannot sin because he's born of God. How many want to grow to that place? >> Yes. You see, we discourage people. They And I tell these people online, you're just discouraging people. That's all you do. You just discourage people from growing, from pursuing God. You're just a big bunch of discouragers. All right. Heaven now is the abiding place of the righteous until the resurrection. Okay? and then they abide in the new heaven and earth. But you only ask me about heaven. So, we're going to deal with the abiding place of the dead in this uh segment. Second Corinthians 5'8. To be absent in body is to be where? >> Present with the Lord. Boy, that sounds good. Wow, >> I can handle that. Can you handle that? I mean, man, I don't have to read nothing else. That sounds good enough to me. When I die, bam, I am in the presence of Jesus Christ. No longer do you just believe by faith that he's a real person. You see him. You touch him. He is there. That body that he died in was by the father when Stephen saw the heavens open. Hallelujah. And you're going to see that body when you die. And that's something to look forward to. But that's not all. Heaven's also called paradise. In Luke 23:43, the thief said today, Jesus said to the thief, \"You will be with me in paradise.\" That's heaven. just another name for heaven, the abiding place of the dead. It's also called the third heaven in 2 Corinthians 12 2-4. Uh Paul was caught up to the third heaven, paradise, and he saw and heard great things. Ecclesiastes 12:7 says, \"Dust returns to the ground from where it came from.\" That's us. Our body rots away, turns into dust. And a spirit returns to who? >> God who gave it. The spirit is eternal. Your body decays and goes away. But your spirit is eternal. And so is the unbeliever's spirit eternal. And when they stand before Christ, they're judged and put in hell. When they die, they're also in the presence of the Lord, but the Lord is judging them and sending them to hell. In God's presence is fullness of joy. Hallelujah. We can smile all the time. Happy is the people whose God is the Lord. Hallelujah. No uh sadness, no sorrow, no pain and all that stuff. The heaven is a place of joy and pleasures forever more. And he doesn't describe the pleasures, but you do things for pleasures and you like them, right? There's things up there in heaven while we're waiting to for the new heaven and earth that you're going to be pleasurous for. Isn't that beautiful? Yeah. You're not just up there sitting on a cloud playing a heart. They used to show that cartoon all the time when I was a young guy. Besides that, Revelations 2:7 says, \"We're going to eat of the tree of life.\" Kazam, the tree of life is up there. It was transported somehow under the heavens and you get to eat of the fruit of the tree of life. And not only that, there's a river of life flowing up there in this spiritual domain. And you get to drink of that river of life and that tree of life. Man, you got life made. Hallelujah. But look out. He has other things planned for you. Revelations uh 2:22, no night there, no need of a candle, no need of a sun. God gives them light. And they shall what? >> Reign forever? Reign over what? There's activity going on up there, church. Things are happening up in heaven. Do you get it? Isn't it worthwhile? Yes. Matthew 22:30. In the resurrection, they neither married nor given in marriage, but are like angels. Okay? So, you don't have to worry about your spouse. You're free. Angels are Angels are spirit. Angels are spirits. Okay? Angels don't have flesh and bone. Okay? We don't have flesh and bones there until the last day resurrection. I am the God of Abraham, the God of Isaac, the God of Jacob. God is not the God of the dead, but of the living. Your spirit lives. Those saints of old are up there living and they're doing things. They're reigning and they're eating of the tree of life. There's things to do up there that is just beautiful. As I said, angels are spirits. They're not flesh and bone. And we get our immortal body back at the resurrection. That dust comes out of the ground. This old body looks handsome again. Ah, no blood in that body. It's an immortal body. It can't decay. It can't die. He says, \"Rejoice and be glad. Great is your reward in heaven.\" Oh my gosh. When you are hated and mistreated because of me, you're stirring up rewards in heaven. So when I get to heaven, man, I got some perks up there because I got a lot of people don't like me. Are you there? this uh Charlie Kirk who got who paid the ultimate price. That's some he's up there enjoying his rewards right now. >> You understand that? >> Yeah. Yeah. Now, he doesn't explain what they are, but how many you know he only does good. >> Yes. He's got some great things ahead of store for us."}