{"video_id": "EH2bIfbKzUQ", "title": "The Bible, God’s Word - April 27, 2025", "published_at": "20250430", "transcript": "We're talking about the Bible. In our three weeks ago, we learned that the Bible is trustworthy. It's the most authentic ancient writing in the history of mankind. The Bible, the New Testament, and the Old Testament. New Testament is even more authentic. Uh it's powerful to know that our Bible, the one that we read, the one that is our guide is that authentic because the world when you go on YouTube and you listen to what some folks are saying, they're going to say that the Bible is just uh uh like telephone. Somebody said something and it changes as it went through each other's ears. But that's not the case, right? And we're going to learn more about that this morning. It's very important that we understand the power of God's word in our lives and uh also that it is true. Uh people want to come up with all these things that that they say. When I was a young person in college, uh somewhere I read about the uh the the scientific impossibility of Noah's arc, right? how all these animals are pooping and the methane gas would be so much that they couldn't even breathe, right? And then someone just said to me, \"Well, they cleaned it up.\" I was like, \"Oh, well, that's there you go. They had I don't know how they got out the window, but I'm sure they did.\" You know, you got a you got six people on the boat. What are they going to do? They got to feed and they got to clean up. And that's part of animals, right? We know that. Um, and there's other things, you know, it didn't couldn't float and all that. Everybody wants to throw all they can at these situations, scientific impossibilities, but ultimately that boat floated because God was in the boat. Amen. Amen. And that door closed because God shut the door. Hallelujah. Transformative. The Bible, as we learned, reveals Jesus as the Messiah. very important that we understand that Jesus is the Messiah. There's not another Messiah coming. This is important for our Jewish friends uh that need to uh get on the bandwagon, right? They're rejecting Jesus the Messiah. They got to get on the bandwagon. They're going to be missing out on what all all God is doing because they're waiting for something else. Also, the Bible has has shared with us how we can obtain eternal life. Very important. You want eternal life. How many want eternal life? I want eternal life. There's some people here don't want it. It's all right. As you get older, maybe you would want. The Bible equips us through learning and obedience. And now we're going to talk about the benefits of scripture. So, first 2 Timothy 3:6 says, \"All scripture is given by inspiration of God.\" As we just reviewed, uh the ecologist, the secular, you know, you go to college, you go get any input somewhere uh that is not in the church or not, you know, based in in biblical fact, they're going to tell you that the scripture is just a culmination of people's opinions. And it's not true. That's not what it says it is. Okay? Second Timothy 3:16, Paul is writing to Timothy. He says, \"Hey, all what?\" Say that with me. All scripture, all Old Testament, New Testament is given by God is given by inspiration of God. Yes, God used people. He used people. Amen. And he can use you today not to write the word. The word's already written, right? But he uses people and he used people back there to write the word out, brought it to their remembrance. Can you imagine? They didn't have any phone. They didn't have any uh internet. They didn't have any AI tools. And these guys wrote down the things that Jesus said. They wrote down the the the understanding of the parables. They somehow they had to remember that. Why? Because the Holy Spirit came to them and burned it in them and said, \"Hey, this is what he said. Don't you remember? Amen. And so I I bring this up because, you know, we got young people that are going to be going to college and going to be going out in the world and there's a lot of pressure out there. Uh I faced it when I went to college and there's a lot of pressure out there. They don't even they don't even talk about the Bible. They don't even talk about creation. They don't even talk about God. It's it's they just say what it is like they teach evolution like that's what it is. Well, who are you? And you walk into the class and you're like, yes, when we evolved millions of years ago, then we came into the thing. And then when all the scientific they just they just rattle off their belief and if you didn't get if you don't get on board, you know, you just there's no option. There's no it could be something else. There's none of that. They just teach you what they think. So that pressure is coming if you don't, you know, if you're going to go to college, that pressure is coming. And you've got to have an understanding. You've got to experience God for yourself. You know, when I was 13 years old and I experienced God in that youth service and I experienced his presence and I'm crying and I'm like, \"What the heck is this? This is amazing.\" I Nobody had to explain to me that God was real. I knew he was real. He was right there. So, you need to come, you need to meet God for yourself. And uh you need to keep meeting him. It's not just a one-time thing. That kind of stuff can fade away. You got to keep meeting God. Is that true? Yes. Amen. We can't be living on 30 years ago. So, all scripture is inspired by God. 2 Timothy 3:16, same scripture expounded. It's inspired by God and is profitable for doctrine, for reproof, for correction, for instruction in righteousness. That the man of God may be what? Complete. That who is the man of God? Who is the woman of God? Is that just the men? No. Women too, right? Yes. that the man of God, the person of God, the human, the people that God made, God's not excluding women. All right? Thoroughly equipped for every good work. There's a good work that God wants to do. Uh and if you want want to think about what that good work is, he wants to make disciples, right? He wants to do he wants to make disciples. Bring somebody all the way who's in the blackest, deepest, darkest pit of sin. He wants to bring them all the way to the other side and everybody in between from blackness to not even knowing Jesus, you know, all that whole area. He wants to bring them over. Amen. And we want He wants to use us to get that work done. Hallelujah. We got a big job to do, folks. Deuteronomy chapter 19:15, Matthew 18:16, 2 Corinthians 13:1. All say out of the mouth of two or three. Say that with me. How many? Or three witnesses. Let everything what? Be established. When we come up with doctrine from the Bible, we don't just take one verse and run with it. You've got to have different witnesses speaking the same thing. And for example, this statement right here is backed up how many times? Three. Who's that for? Three times. Deuteronomy, Matthew, Corinthians, and it probably says it in other places, but they all confirm the same thing. Okay? And so we know that that is an established truth. Very important because we can come up with doctrines and beat each other over the head with doctrines that we come up based on one verse. Amen. So, it's important our doctrine, our reproof, our correction, instruction come from the scriptures. Um, and you know, in our fellowship time, uh, unless you're, you know, somebody who's been in God a lot and you're experienced Christian, you're trying to work with people and, you know, uh, yes, you can admonish one another, right? We want to, uh, provoke one another to love and to good works. That is our goal in fellowship. Amen. Provoke one another. That's the goal. But we don't want to beat everybody over the head with our doctrines. Okay? It's very important. That's part of love. What am I missing here? Oh yes. This tree, I have this here for a reason. This tree is ready for a storm. This tree is ready to be used, right? It has wood. It's ready to be cut down and used. And uh it's full grown. Okay? If you you can't use the seedling the same way you can use this full grown tree. And God wants to bring you to completion or perfection. He calls it perfection complete. Same thing. He wants to bring us to maturity. So that is God's goal. And the word is what will get you there. So if you want to be a seedling, if you want to be weak, if you want to be blown over by the wind of doctrine, if we want to be blown around, don't grow. Don't get in his word. Don't, you know, neglect it because that's what's going to happen. Unless you get that word into you and let it feed you and and empower you, you're not going to grow to full maturity. Let me see. I don't want to pass up. The Bible corrects our beliefs that may be wrong. The Bible talks about the Jews how they could strain out a gnat and swallow a camel. And so there's extremes, right? They were straining out a net. They wanted Jesus to keep the Sabbath. He was healing people on the Sabbath. You're healing people on the Sabbath. You can't do that on the Sabbath. you can't do anything on the Sabbath. And Jesus responded to them and he said that the Sabbath was made for men. Also, they wanted to find a way in the Old Testament to kill Jesus. They hated him. And so, they're using the scriptures so that they can hurt Jesus. And see that is the opposite of the second greatest commandment which is what? What is it? Love your neighbor. Were they loving Jesus? No. They were love does no what? Harm. Were they trying to harm Jesus? Yeah. And they were using the Old Testament to what? Harm Jesus. They were focusing on all these things and the the the ceremony over here. They and but in the middle they wanted to kill and murder Jesus. And I bring up the example how they uh the 30 pieces of silver, right? Remember that they used to to what? Pay off our friend Judas. Our friend, right? And And they said the money comes back and they said, \"Oh, we can't use this. This is blood money. You know, we can't we can't mess with this money. We we don't want to mess with this money, right? But we can kill Jesus, right? That's okay. But we're going to keep this.\" So very extreme. It's important. Okay. Remember, out of the mouth of two or three witnesses, let every thing be established. As you young people move on in your life, make sure that you are putting your trust in good doctrine. And that is backed up by witnesses in the Bible. Amen. First John 1:3, that which we have seen and heard and declare to you, they had they saw it and they heard it. They are not just uh this isn't secondhand information. First of all, it is their experience. They saw it. They heard it. This is their firsthand eyewitness testimony that you may have fellowship with us. And truly our fellowship is with the father and with his son Jesus Christ. The the goal of God's word is so that we have can have fellowship with one another with God's people also not just with God's people but with the people like the apostles right we can even though they're dead and gone we can still have fellowship with their their what they were doing and keep that going. Amen. We can be in unity with that and with other people that want to keep that going. Amen. Yes. That's good. I like it. And they can also we can also be in fellowship with more importantly who? God the Father, Jesus Christ, the Son of God. They're all the same. They're all one. We can be in fellowship. Jesus doesn't have to be far away. God doesn't have to be far away. We can know them. We can have in a relationship with them. They inhabit the praises of his people. Amen. They're here this morning. We can have a relationship with them. This word fellowship in Greek is qu coia and it's used in acts 2 verse 42. They devoted themselves to coinia. And in this one, it says the I'm trying to remember here. They were de they devoted themselves to Quinia. Okay? They devoted themselves to loving one another. Philippians 3:10, fellowship of Christ's sufferings. They also there there's a fellowship with Christ's sufferings. Uh Romans 15:26, the saints in Macedonia and Aaya contributed to the saints in Jerusalem. And that was their act of coinia fellowship with one another. They cared for the church that was in another city. uh in 1 Corinthians 10:16 the coinia and the blood and body of Jesus Christ in communion that is coinia okay so we want to have unity we want to have fellowship and uh you know there's there's something that we want to obtain from this word fellowship um it's not it's very important we we don't want to just go from church to church just hopping around somewhere you want to get tied into a church, be faithful to that those people. There is a a love that is expressed in fellowship. We do no harm to each other. Um there's divisions that people cause that is not coinia. Amen. That is not fellowship. You know, the word is here to teach us how to have fellowship with God's people to f fellowship with God. And when we divide and we hurt one another, that is not right. Amen. And the word is teaches us how to unite, how to love one another. Um, sewing discord among the brethren is something that God hates in Proverbs and also is confirmed in uh by Paul. Just want to go through that real quick. Division, we are not able to go up against the people for they are stronger than we. Numbers 13:31. So they brought the to the people of Israel a bad report of the land that they had spied out. In the next verse, and all the con congregation raised a loud cry, and the people wept that night, and all the people of Israel grumbled against Moses and Aaron. I bring this story up because it's an example of division. They sent out how many spies. Do you remember how many? 12. They sent out 12 spies, one from each tribe. And they came back and how many had a good report? Two. So that's two out of how many? Two out of 12. 10 had a bad report. Two had a good report. Now the rule of uh uh what is it called? Democracy. The rule of majority rules. Who's the majority here? The bad report. Does that make him right? No, you see, even though you may have uh your opinion, if you didn't line up with God's opinion, you become the min minority. See, when you're in opposition to God, you're not the majority. You can't sit up, you know, billions of people get together, oh, we're the majority, God, and we think you should change, and we think you need to stop and and you can't judge, and you can't send people to hell. we think you're not going to tell him what you're going to do. That's not how it works. It's important to understand that uh at a young age respect for the authority of God. Amen. And so we want in your life to be on God's side uh not stirring up trouble. And when you think about things and and situations and how to treat somebody or or you have a problem going on, think to yourself, what does God want? Amen. What does God want in this situation? Psalms 19:7, the law of the Lord is perfect, converting the soul. The testimony of the Lord is sure, making wise the simple. Proverbs 1 for wisdom and uh Proverbs 1 is talking about why it was written and it was written for wisdom and to give prudence to the simple. So we see here that part I'm going through a bunch of reasons about the Bible, the scriptures. Okay? I'm trying to sell this to you. Uh that's a bad word, but I want to encourage you this morning to make the Bible part of your daily uh intake. Amen. The Bible is so important. It makes wise the simple. You may not think that you're very simple, but hey, when it comes to comparison to God, you know, I'll I'll say I'm simple all day. God, make me wiser, please. Okay? I don't care if you're the smartest man. Just say you're simple. Make me wise. I'll take it. Right? Don't let a statement like that get you all hurt. No, we can be wiser. Amen. So he this wisdom is good for our outlook or for our goals and also its prudence is good for everyday decisions. The Bible gives us prudence and wisdom and it's found in these wonderful scriptures. Genesis 1 26 the Bible talks about and gives us tells us how much value we have to God. Genesis 1:26. So God created man in his own image. In the image of God he created them. Male and female he created them. You know it's important that we understand our value, right? And if we have value then the other part is true as well that he created us what? Male and female. That never changed. Okay. There was no scripture. Even though all the sexual immorality was going on in Roman times, God never said, \"Oh, something's changed. Everything has changed. Every I I changed everything.\" No, he didn't. He spoke this word. Jesus read letters. What is it? Going back to our first principle, let out of two or three witnesses, let everything what be established. Jesus gets down on earth and he's walking around and they come to him and they ask him a question about divorce and he says from the beginning they made man what? Male and female. Did Jesus say ah that book of Old Testament? You don't have to believe that. this thing too hard. It'll turn off. Got to stop dancing around up here. Just keep straight. Psalms 139:13. I am fearfully and what? Wonderfully made. Amen. You have been wonderfully made. You know, as as we've shown you in past lessons, the bo the body is an amazing amazing work of God. And as we keep drilling down and looking and learning more about the body, they see more complexity, not less. They see more amazing things about the body. The eye, the the the mitosis, the cell replication. You know, you watch these processes happen. These scientists, they're like, \"Oh, what a wonderful thing. I can't believe this evolved. That's just so wonderful. I mean, come on, folks. You know, from a coding perspective, I know the DNA is that's impossible. Okay, I'm an IT. I work as a system engineer. I put I put things together. I take code and I take I put it all together. I'm I'm I'm a god to the to the code. And somebody has to do it. It has to be a person. It's the same way with your bodies. It all started with him. Matthew 10 29, not one spirit will fall to the ground apart from your father, but even the hairs of your head are all numbered. Fear not, therefore, you are of more what? Value. Than many sparrows. It's important that we have a good perspective on what value is. We have a lot of more value than animals, right? We have dominion over the animals. Amen. were fearfully and wonderfully made. And so, first, Christ, Jesus, God loves us so much. Secondly, he made a way for us to become like him, right? The scriptures say that we can grow into his likeness. I will not be satisfied until I wake to your in your likeness. We can have partake. We can partake of the divine nature. He's trying to make a way for you to be more like him. Okay? When you go and you go to your family, you go to school, you go to whatever you do, work, people are trying to make you like them, right? Your parents make they want to make you like them. You know, your your sister, your brother, your friends, your friends want you to be like like them. And Jesus is He wants you to be like him. And that's the best. He's the best one, right? He's the best king. He's the best ruler. He's the best president. Everybody should be modeling themselves after who? Him. You know, once we get that right and start going for that goal, now we're on track. And so third, are we seeking to become like him? Are you what is uh what does he desire? What do we desire? What does he say? What do we say? What does he do? What do we do? Right? Are we doing? Are we acting like him? Luke chapter 24:27 talking about the scriptures again the word the word of God is so important beginning with Moses and all the prophets he Jesus explained to them what was said in all the scriptures concerning himself they asked each other were not our hearts burning within us while he talked with us on the road and opened the scriptures to us God wants to open your eyes to understand the scriptures the scriptures are not easily easy to understand And he says that in the New Testament. Okay. You have to get your eyes what? Open. We have to get our eyes open and understanding. It starts with knowledge of the Bible. Then you move to understanding of the Bible. And then you move to the wisdom and and all this stuff. But you got to start somewhere. And you got to, you know, if you never opened the Bible in your life, you're not going to get, you know, some amazing thing that nobody has ever heard before. You know, God's going to make real to you what he's made real to many other people. But you got to I'm just saying, get into the book. Get into the book. Let's get into his word. And so God is asking us today, do we have a passion for desire for his word, his truth? And all of us need to ask ourselves that question. You know, I need to ask myself that same question. You know, I could we can all do better. Amen. There's nothing special about the pastor down the road and pastor down the street and there's nothing special about the people here. Uh I got I got a suit jacket on that doesn't mean anything. Okay? I got to seek God just like everyone else. I've got to respond to the calling just like everyone else. Pastors down the road, they got to respond to the calling just like everyone else. Do we love him enough to seek his word and his truth to become like him? Amen. And we have a lot of desires. Uh young people have a lot of desires. They they want to do this, they want to do that. We want to do this, we want to do that. Do we have any burning? You know, I got this guy here. This is AI generated image. He's got a heart. You know, we know this is not how it works. But what are we burning for? What are what is our you know, I got a passion. I got a passion for this. I got a passion. What do you have any passion for Christ? You got a passion for his truth, his word. Do you have burn? You burn for him? Like these guys, Jesus is talking to them and he's revealing to them in the scriptures about himself. Have you ever read the Old Testament and seen words talking about Jesus in the Old Testament? You know, I' I've experienced it and I understand what they're saying. Burning. Oh, yeah. I see it. Wow. I see it in Esther. I see it in in David and Goliath. I see it. I see it in Jonathan. I see it. Job chapter 23:12, I have not departed from the commandment of his lips. I have treasured the words of his mouth more than my necessary food. Um Job simply here is relating the word of God to food and food we eat every day. simple example, right, to understand. And there there's probably more to this, but I mean that's a simple takeaway for us, right? Every day we eat. Amen. And so every day, what should we do? Read the word. Put his word into us. Have some kind of interaction with the word of God. You know, not just worship songs. Okay, the worship songs are fun. They're good. They can they can praise and say good things about God, but it's not the what? The word. The word is very important. Deuteronomy 8:3 fed he fed you with the mana that he might make you know that man does not live by bread alone but lives by every word that comes from the mouth of God. There must be a saying out there. Um I was in college in my honors speech class and I went into honors program so that I get priority registration. I was a young person at the time first year in college or second year I can't remember. And the guy gets up in speech class. He's like, \"Man shall not live by bread alone.\" And I I'm sitting in the chair. I'm like with like 10, nine other people. And I was like, \"But every word that proceeds from the mouth of God.\" And he's like, \"No.\" I'm like, \"What are you talking about?\" You know, I was I didn't know what he was talking about. So there I think there's a saying that, you know, you can't live by bread alone, but to emphasize the important of art and and love and community, you know, some secular thing. I don't you I didn't know what they're saying. He was quoting the Bible to me. So I responded with but every word that proceeds out of the mouth of God he's like no. So it was it was funny situation but it's true. Man does not live by bread alone. You know all of our our work that we do and all of our uh you know the work that we have to do to survive and live and all that stuff. We can't make that more important than the word of God. Amen. You know, we got to keep things in perspective. And we'll get to the work in just a moment, but God's word has got to be a top priority in our lives. Amen. You can't just live for uh the the the portion that we have in this life. As the Bible says in Psalms, there is a seeking God that we must do, especially in this word. So, do we get it? Food. It's like food. We got to eat it. Amen. We don't live by bread alone, but by every word that proceeds from the mouth of God. Do we get it? Yes. Amen. Wake up. Psalms 19:11. Moreover, by them your servant is worn and keeping of them there is great reward. Uh, we got those handouts for you so you can follow along so you don't get tired. These these scriptures are important to know and to understand. Uh we don't have to run to the prophets for a word from God. Okay? There's a lot of people that will go and they will pay money to a prophet. Oh, tell me something new. Uh they go to a place uh I mean, we know him. You know him. Or maybe you don't know him, but there's there's there's places you can go where the uh I I was walking down with a guy one time. He's like, \"Hey, brother, do you need do you need a word right now? Do you know need a word from God right now?\" Uh Carmen and I called that guy shiny shoes. Shiny shoes. Because he had, you know, he looked really good and he had shiny shoes on and he had a shiny car and, you know, he wanted to say something to me. Uh but and he can say whatever he wants, but I'm just saying we don't we don't have to go out. You don't you don't have to live like that. The the Bible is here. Amen. Psalms 19:11. Moreover, by them your servant is warned. You can go to the book. The book's got the warnings. The book's got the directions. You know, you walk up to a sign that says warning, you you respond to the sign, right? Caution signs, right? That's what the Bible is. And so, if you don't put the Bible into you, you're going to go run to something or someone. Amen. But you can put God's word into you, and that word will give you direction. Your word I have I hidden in my heart that I might not sin against you. Psalms 119:11. You know what did these people do back in the day before there were psychologists? Before you know we had all these things in America. I mean America has services up the wazoo, right? All kinds of things. There's service for this, there's a service for that. We can pay this guy. You can listen. He'll listen to Yeah, you can do that. Oh, no. You don't want to do Yeah. You want to do this, right? You know what did they do back there? What did what did what did the do what did the prophet do in the meer? He's sitting in the prison. What did he do? Could he go to the service? No. Could he go to the the psychologist or the doctor? No. He What does he got? He's got the word of God. Amen. You know, this stuff is available for us. So, we think that's the solution. It's not true. The word is here. The Bible is here. Five billion copies. There's one right there. There's one right there. Get it. Your word have I hidden in your my heart that I might not sin against you again. Um, got to put that word into us so it can affect us and change us. Amen. We have a more sure word of prophecy found in the Bible. The word of God, as Peter said, a more more sure word of prophecy. You don't have to go to the prophet. You got the prophet already done. It's already spoken. And God wants to make that real to you. And so, you know, the first question you want to ask yourself, have you repented? Have you turned from sin? And are you bearing fruit? big three questions, right? Uh that's what Peter said. Repent every one of you. Be baptized in the name of Jesus Christ for the remission of sins, right? Repent. Turn. Yes. So, it starts there. Everybody's got to respond to that. We all got to respond to that calling. And that word has been spoken. And that word is there's five billion copies of that word. There's there's a there's an app on your phone you can get that's downloaded millions of times, billions of times. It's there. It's repeated. Repent. Repent. Billions of times. Are we going to repent? Are we going to bear fruit worthy of repentance as John said? So things may come, natural disasters, war, fear of uh killers or whatever it may be, accidents, disease, the world ending, but you can have peace because you've heeded the warning. Amen. You've heeded the warnings for eternity. You've heeded the warnings in your natural life. Hallelujah. We can have peace when we use the Bible as that mirror as the Bible says to expose what we need to change in our lives. As uh in the church, it's your choice. It's your choice. Amen. We have a choice. You have a choice to make. It's up to you. It's not my It's not our job to come into your house and go, \"Oh, this is what you need to do. This is how you're going to do it.\" No, no. That you, it is your choice. We can provide the prescription. We can provide the medication and and what God says, but it's up to you to put it in you to to make it a routine yourself to to get on the diet of Jesus. Amen. It's important to know that our choices carry consequences, penalties, or rewards. Psalms 119:11. Moreover, by them your servant is warned, and in keeping of them there is what? Let's say that together. Great reward. It's important to know that there is a great reward in keeping the word. Yeah. Right. That's what it says. So if there's a great reward, there is a reward. There's a little reward. There's a big reward. There's a great reward. So rejoice, be exceedingly glad, for great is your reward in heaven. For so they persecuted the prophets who were before you. Talking about the persecution that came to the to the uh to the disciples and the apostles and everything that they went to. Great is their reward in heaven. The people that that gave their lives, their reward is going to be very great. And uh we want if you want to have a great reward, you can obey and follow the word of God. If you obey it a little bit, you're going to have a little reward. I don't want a little reward. I want a big reward. Amen. The more you keep the word, the greater the rewards. And we don't know exactly what they're going to be. But if I am standing there and God starts pulling out stuff, can you imagine? He starts pulling out a word. He's, \"Whoa, whoa, well, I want that. I like that.\" He's like, \"Well, you didn't you didn't keep my word. I mean, you're here. You believe. Yeah. But you didn't keep my word. There's this new word out in our uh in this time called adultting. Adulting. Being an adult, you know, like grow. We used to say grow up, right? Grow up. It's time to grow up. Now they call it adulting. I have to go adulting today. Uh but you know, working getting a loan, uh, paying a loan, getting a car, driving, taking responsibility for yourself. It's called growing up. Grow up. Okay? We don't call it adulting. We call it grow up. Exodus 20:9, six days shall you labor and do all your work, but the Sabbath day keep holy. Amen. So God is expressing to us, hey, if you're going to work, here's your days to work. Uh not if you're going to work, work. Sorry, work. And uh I've made a day for you to rest. Okay? Take that day to rest. Get some rest for yourself as Jesus said. 2 Thessalonians 3:10, for even when we were with you, we commanded you this. If anyone will not work, neither shall he eat. So the Bible gives us instruction for daily life. Amen. Uh and we've got to follow and respond to these things. And this is how we can love our neighbor. There's these things that that we do in the Bible to uh that are in the natural that that love our neighbor. We can't just wait for God to rain down our million-doll job or millions of dollars from heaven. I remember Mr. Barnes and I were talking to a guy uh way back and this is when I was a teenager and I was at the table. Mr. Barnes said, \"What are you going to do for work?\" And the guy says, \"I'm going to pray. What are you going to do for I'm going to pray?\" That's not how it works. What happened? Did I Did I move my hands too much? We have to work. Study to show ourselves approved. Is there something we we can learn on the job that you're in now? Or do we just pump uh punch the clock? I put in my time. I'm going to do the minimal. Amen. We can we can we can be good hard workers. Amen. Christians work hard. John 8:31 Jesus said to those Jews who believed him, \"If you abide in my word, you are my disciples indeed, and you shall know the truth, and the tr truth shall make you free.\" You see, that's number one goal here. Jesus said he's he's ascending into heaven. He he just rose from the grave 40 days after he ascends into heaven. And his words are go into all the world and make what? Disciples. And what is a disciple? A disciple is somebody who follows continues in what? The word. And so this is my plea to you today. Unless you get this, unless you understand and get a hold of this part, you know, this is my job. I got to We got We're all here. We got a job. Make disciples. It's to get them to continue to abide in the word of God, to follow it. It's available to us. The scriptures are available to the whole world mostly. But we've got to get it. We've got to continue in. We've got to abide in it. If you abide in me and my words abide in you, so you will be my disciples. and not only just abiding in the word, but also abiding in Christ. And that's why we have this great time where we worship and we praise God. This is God's time. We're not here to just sing and entertain. It's our time to be with him, to praise him. And it's important for you to understand that because when we neglect it, when we when we uh kind of sherk it off, that's what you're you're you're sherking off and you're neglecting something that's for him. Amen. Do do we want to treat him like that? No. If you abide in my word, you are my disciples indeed. You shall know the truth and your truth shall make you free. Uh I don't even know if this is the right one I wanted to share, but there's another scripture that says, \"If you continue in my word, you're my disciples.\" See, there's there's there's it's established. It's established. Two or three witnesses are saying the same thing. So, I encourage you this morning, Christians, if you've accepted Jesus Christ and you accepted his forgiveness for your sin, that's not the end. That's not the all. You've got to move on. You got to continue on to abiding in his word, to following his word, to getting it in you. Because I'm telling you, if you don't, you're going to it's you're going to fade. And you don't want to fade, very important. Psalms 33, for the word of the Lord is what? Right. And we have our arguments in a in a marriage. Somebody always wants to be right. And when you bring up the word, you can say, \"God is right. I'm right.\" No, the word of the Lord is right. And all his work is done in what? Truth. Psalms 19:9, \"The fear of the Lord is clean, enduring forever. The judgments of the Lord are, say it, true and righteous altogether. John 17. If you anytime you see John 17, that's Jesus is praying on his knees in the garden of Gethsemane, right? And he is praying that that that the church would become one. He's praying for all this stuff to happen that they would know me. He's God is pray and he's sweating. He's praying, \"Oh my gosh, make this happen, God.\" And one of the things he says, \"Sanctify them by your what? Truth. Your word is truth. If he didn't get it the first time, Jesus is making it really clear and he says, \"Your word is what?\" Truth. John 18:38, he's standing before Pilate. And Jesus said, \"I've come to bear witness of the truth.\" And Pilate said, \"What? What is truth? What is truth? And you see, is that a good response? It depends on the question, right? If pilot is like, what is truth? We know that that's not a good response. But he's if he said, \"What is truth?\" and sat down with Jesus to to learn, then that's a good response. And that's the way we need to respond. But the world is kind of mocking and scoffing off Jesus saying those words. The Bible is not a book of faith. The Bible is not a fairy tale or a myth. Okay? As you go on in your life and you get other input and you hear other things, you're going to hear this that the Bible is a book of faith. The Bible is a myth. The Bible is this. The Bible is that. That's not what it says. And that's not what Jesus said. And you see, when you accept Jesus and you say, \"Yes, he died on the cross. Yes, he was buried. Yes, he rose from the grave.\" And then he says something like this, saying that the word is truth. You can't just say, \"Oh, well, the Bible's a myth.\" No, you can't do that. And so don't let the atheists or humanists say that Christianity is just a faith thing or the Bible is just faith with no place in the secular world. It's not true. The Bible is a book of truth. The Bible is used to find the uh archaeological uh uh findings. I don't know what they're called. But they use the Bible for these things because it's a book of truth. It's history and not just history, but it's what it's saying. It's true. Psalms 107, he sent his word and healed them and delivered them from their destru destructions. Mark chapter 1 verse41. I'm giving you two scriptures for every slide. There's two or three witnesses. Do you notice that Jesus moved with compassion, stretched out his hand and touched him and he said, \"I am willing, be cleansed.\" As soon as he had what? Say it. Spoken. Say it with me. Spoken. Immediately the leprosy left him and he was cleansed. And there's other places. I showed this last week. Jesus when he spoke, when his words came out of his mouth, peace be still. That storm stopped. His word is powerful. And so we don't want to take his word lightly. Amen. Are we taking his word seriously? And it's confirmed here in the scriptures how important, how powerful his word is. Mark chapter 4:20, these are the ones sown in good ground. Those who hear the word, accept it, and bear fruit. Some 34fold, some 60, some 100. In Galatians chapter 5:22, the fruit of the spirit is love, joy, peace, longsuffering, kindness, goodness, faithfulness, gentleness, self-control. Against such there is no law. You see, the fruit, the fruits of the spirit. We know that if you ever listen to one of the songs, you got the fruit. Yeah. Yeah. Fruit of the spirit. The gift that only God can give. Ready? Okay. Love, joy, peace, patience, kindness, goodness, faithfulness to gentleness, and self-control. And that's how I remember the fruits of the spirit. So, somebody asked me, I'm going to sing that song. And you want to start developing those things and getting that's that's your goal. love, joy, peace, longs, uh patience, kindness, goodness, faithfulness, all these things. That's what we need to develop. Amen. But did you realize, did you know that it starts with a seed? And in the parables, the seed is what? The word. The seed is the word. So if you're going to develop love, joy, peace, patience, kind of you're not going to do that unless you have what? The word. And you got to get that word watered. And you want to be good ground. One one of the big things about that parable is being good ground, right? And that's that heart, that new covenant. He give you a new heart. He changes your ground. Oh, you're a hard ground. You're a tough ground. You're like a rock. Jesus can change you. Isaiah chapter 5, God had a vineyard. He dug out all the rocks, right? that sometimes we're rocky, hardheaded, hard to get through. But Jesus can change you. But with all of these slides, I'm just showing you how important the word of God is in your life. Please, I I I beg you as a Christian to another Christian, make God's word a high priority in your life. Even as a young person, even as an old person, I know you've been a Christian for 50 plus years, doesn't matter how long, get God's word into you. Get it going. Amen. Psalms 119:98. You there, you through your commandments, make me wiser than my enemies, for they are ever with me. Through your commandments, say that with me. Your what? commandments make me wiser than my enemies. As for God, his way is perfect. The word of the Lord is proven. He is a shield to all who trust in him. So again, uh reinforcing God is wanting to protect you. Um though enemies may oppose and resist and talk about you, the word can make you wiser. It's also important to understand that you may have enemies in your life. As a Christian, everything's not hunky dory. Okay? You're going to face opposition. That's okay. You have the word. The word will make you stronger. It's important to rely on these things that God has given us. All right? Praying, fast, you know, it's not just the word. It's it's the word talks about praying, fasting, uh worshiping, assembling. It's all part of those spiritual weapons. Psalms 119:9. And as you know, we're getting to the close to the end. I'm going to invite the worship team on up to, if you'd like to share in this last psalm in response. Psalms 119:9. I have more understanding than all my teachers, for your testimonies are my meditation. I understand more than the ancients because I keep your what? Your precepts. I keep your your your statutes, your laws, your truths. 1 Corinthians 1:25. Because the foolishness, say this with me, the what? The foolishness of God is wiser than men. The weakness of God is stronger than men. Even the small things, the the the the foolishness may people maybe think is foolishness is wiser than men's wisdom. Amen. And so when you are a person who seeks God and puts your his word into you, you be you're notching up your wisdom. And people may look at you and be like, \"Oh, you're not you they want to put you down.\" But it's not true. God's word, his truth is powerful. The Bible is not outdated. It's not old. I mean, it I mean, it's ancient. Yes, it's old. Yes, it's called the Old Testament, but it is for today. The Old Testament, the New Testament together. The New Testament fulfills the Old Testament. It it confirms it. It uh it's a fulfillment of the Old Testament and all scripture as Paul wrote is for us today for reproof for correction. These examples from the Old Testament are very important for us. So as we just shared the word is inspired by God. It promotes fellowship. Amen. Want to fellowship with God and with his people. Uh we want to avoid division. We want to get that wisdom and understanding that the word brings. The Bible says that it's like our daily food that we get. Just as important, the Bible defines our value. The Bible is powerful. It's truth. It can heal. Amen. And it makes it's the beginning of making us fruitful. And so I encourage you this morning. We really need to commit to continuing in his word. You can't continue into something that you don't know what it is. Okay? It's pretty clear. And so when I say continue in his word, you've got to put it in you. You've got to abide in it. Uh Psalms 1:1 says that he meditates, right? He meditates on his word day and night and he delights in the law of the Lord. Amen. So let's take a moment here. We're going to respond. Take some time. We're going to take communion. While he's passing it out, we're gonna sing this song unto Jesus. Jesus, [Music] all for Jesus. All I am [Music] and ever hope to be. [Music] Jesus. Thank you. All for Jesus. All I am and ever more to be. Uh the scriptures say in first I'm sorry I did something wrong here. 1 Corinthians 11:24, \"Take, eat. This is my body which is broken for you. Do this in remembrance of me.\" And when we do this, we show forth his his what? His glory until he comes. Amen. Amen. So, let's take the bread first. We show forth the death, his death until he comes. Amen. There we go. Got it. So, let's take the bread together. In 1 Corinthians 11:24 says, \"Take, eat. This is my body which was broken for you. Do this in remembrance of me.\" And we want to commit to loving the body of Christ. Amen. We don't want to divide with one another, hurt one another. We want to provoke one another to love and good works. Will somebody pray for the body this morning, please? Uh, Mr. Sila, my daddyo, will you play pray for the the the body this morning? Thank you, Jesus. Let's eat the body together. The bread. Jesus said in red letters, \"This cup is the new covenant in my blood. Do this whenever you drink it in remembrance of me. This is my blood that was poured out for many.\" Amen. And uh who can pray for the blood this morning? Jim, will you pray for the blood? remember what you did on that cross. How you shed your blood and you gave yourself up for our sake. This day I ask you to wash us on fresh and new with your blood, your word and your spirit. In your name, Jesus, let it be done. Amen. Amen. Amen. So, in response this morning, we want to respond to the calling to continue in his word. Amen. And so, that's what this song is saying. Your will, I'm going to do your will, Lord Jesus. I'm going to follow after you. And we want to respond this morning. Will you sing the song with me? Will you lift your hands? Will you express it? Let it be your prayer, your commitment to Christ, saying, \"Jesus, all for Jesus. Jesus, all for Jesus, all I am and have.\" and ever hold to me. Oh, all of my ambitions, hopes, and plans I sder these into your hand. Let's sing it unto him for a song. For it is only in your will that I am free. For it is only in your will that I am free. [Music] Jesus, all for Jesus, all I am and have never hold to [Music] thee. And right now, let's pray unto God and just express our commitment to him, our commitment to continuing in his word, our commitment to following after him. Amen. Let's lift up our voices together. Lord Jesus, we'd like to welcome those online. We want to welcome you this morning in the room. It's good to be at God's house. Amen. As the scriptures say, we are gathered in his name. Amen. We are going to begin with worship as the scripture. We want to follow the scriptures this morning as we have on the left here are uh scriptures that show us how to worship encourage us to worship God. Amen. The scriptures say that I would that all men lift up holy what? Hands. Amen. We want to give God the glory this morning. In the Psalms, it says, \"Oh, come let us worship and what? Bow down.\" And that's what these scriptures are talking about over here. So, I invite you this morning um let's use our posture by standing, bowing, dancing as the scriptures say to worship God. Let's use our hands by lifting our hands. Let's lift our hands together. Can you do that? Can you lift your hands this morning? Yes. Can you clap before God this morning? Excellent. And uh we have some instrument players up here. Amen. And also very importantly, the scriptures say, \"Open wide gates. Be lifted up you everlasting doors and let the king of glory come in.\" Amen. And that's talking about our mouths. And we want to speak and shout and sing. I'm looking at this uh banner over here. It's telling me in the scriptures where we can speak, shout, and praise Jesus. Amen. Will you join me? Stand as we worship God this [Music] morning. Oh, pardon me. I got to change the key here. Forgot about that. Good to be in God's house. All right, let's stand and sing. [Music] Some hope in what their eyes can't see. We hope in the glorious unseen in a risen and returning king. Hallelujah. Some are chasing the treasures of this world. We run to a glorious reward. The only name worth living for. [Music] Say, say, say, say you believe it. Sing loud, sing like you mean it. We know and we declare that Jesus is king. Say, say, say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. I believe. I believe the kingdom come. The kingdom comes. Son of God. Son of God. The king of love. The king of love. Oh, I believe. Oh, I believe. The kingdom come. The kingom come. Son of God. Son of God. King of love. King of love. Say, say, say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. Sing say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. We set our hearts on what will last. Your word, your love, your faithfulness. Our hope is built on nothing less. Hallelujah. We open wide mouths to praise. Let this generation raise a song of freedom all our days. Say it. Say say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. Say say you believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. I believe. Oh, I believe your kingdom come. Your kingdom come. Son of God. Son of God. King of love, I believe. King of love, I believe. I believe. Kingdom come. The kingdom come. Son of God, son of God. King of love. The king of love. Say, say, say, say. You believe it. Sing loud. Sing like you mean it. We know and we declare that Jesus is king. Sing. Say, say, say you believe it. Sing loud, sing like you mean it. We know and we declare that Jesus is king. We know. We know and we declare that Jesus is king. We know and we declare that Jesus is king. Say, sing. Hallelujah. Let's praise him this morning. We love you. We adore we exalt you. God, you are wonderful. We lift you up. Oh, we praise. We thank you Jesus. Glorious God almighty. For you are exalted Jesus. We thank you. We thank you, Lord. Great is our God. Great is our King. We worship. We worship you. We thank you [Music] God. Through you I can do anything. I can do all things unless it's you gives me strength. Nothing is impossible through you. Blind eyes are open, strongholds are broken. I am living by faith. Nothing is impossible. [Music] Philippians 4:13 says, \"I can do all things through Christ who strengthens me.\" Amen. That's what this song is singing. So, let's sing it unto God this morning with all of our hearts. Through you, I can do anything. I can do all things cuz you gives me strength. Nothing is impossible through you. My eyes are open and strongholds are broken. I am living by faith. Nothing is impossible through you. I can do anything. I can do all things cuz it's you who gives me strength. Nothing is impossible through you. Blind eyes are open. Strongholds are broken. I am living by faith. Nothing is impossible. I believe. I believe. I believe. I believe. I believe. I believe. I believe. I believe in you. I'm not going to live by what I see. I'm not going to live by what I [Music] feel. Deep down I know that you're here with me. Lord, you're with us. I know that you can do anything through you. I can do anything. I can do all things cuz it's you gives me strength. Nothing is impossible through you. Blind eyes are open. Strongholds are broken. I am living by faith. Nothing is impossible. I believe. I believe. I believe. I believe. I believe. I believe. I believe. I believe. I believe. I believe. I believe. I believe. I believe. I believe. I believe. I believe in you. Not going to live by what I see. I'm not going to live by what I feel. [Music] Deep down, I know that you're here with me. I know that you can do anything through you. I can do anything. I can do all things cuz it's you gives me strength. Nothing is impossible through you. My eyes are open, strong broken. I am living by faith. Nothing is impossible. [Music] Lord, we're remind of your word. Your word says that where two or three are gathered, there you are in their midst. God, you are here this morning because that's what your word says. And God, we can feel you. You're powerful. You're strong. Lord, the scriptures say that you inhabit the praises of your people. Amen. Amen. Amen. The scriptures say, \"Go and make disciples of all nations, and I will be what?\" With you. God is with us this morning. Amen. Lord Jesus, we thank you that you are with us. God, you work with us. Lord Jesus, we pray that your word would powerfully work in our soul, in our spirit. God, transform us, Lord Jesus. Lord Jesus, I pray that we would all surrender, surrender to your word, Jesus. [Music] Through you, I can do anything. I can do all things cuz it's you who gives me strength. Nothing is impossible through you. Blind eyes are open, strongholds are broken. I am living by faith. Nothing is impossible. [Music] You shall know the truth and the truth will set you free. Amen. The blind see because the truth has set them free. The truth has opened their eyes. Amen. And we need our blind eyes open. Amen. Hallelujah. Thank you, Jesus. Through you, I can do anything. I can do all things cuz it's you who gives me strength. Nothing is impossible through you. Blind eyes are open. Strongholds are broken. I am living by faith. Nothing is impossible. Oh nothing is nothing is impossible. God we love we worship you exalt king of [Music] kings. Thank you Jesus. Thank you Jesus. [Music] And as you speak, 100 billion galaxies are born in the vapor of your breath. The plan is formed. If the stars were made to worship, so right. I can see your heart and everything you've made. [Music] Every burning star signal fire of grace. If creation sings, your praise is so alive. God of [Applause] creation there at the start before the beginning of time with no point of with no point of reference. You spoke to the dark and fleshed out the wonder of life. And as you speak, a 100 million galaxies are born. In the favor of your earth, the planet is born. If the stars were made to worship, so will I. I can see your heart in everything you make. Every burning star a signal fire of praise. Creation sings your praise is so God of your promise. You don't speak in vain. No syllable empty your voice. For once you have spoken all nature and eyes follow the sound of your voice. for your voice, your voice. And as you speak, Lord, 100 million preachers catch your breath. Oh, I'm growing in pursuit of what you say. It all reveals your nature so I can see your heart and everything you [Applause] say. Every pain in the sky can miss all of your grace. Creation still oys. God of salvation, you chase down my heart through all of my failure and [Music] pride. On a hill you created the light of the world abandoned in darkness to die. [Music] And as you speak, 100 billion failures disappear. where you lost your life so I could find it here. If you left the grave behind you, so am I. [Applause] I can see your heart in everything you've done. [Music] Every part designed to work a part called all love. If you gladly chose surrender, so am I. If you gladly chose surrender, so am I. So am I. If you gladly chose surrender, so am I. [Music] Lord, we bless you. We bless you, God. It's your worth, Lord. It's your great. Thank you, Jesus, for you. Then sings my soul, my Savior comes to me. How great thou art. How great thou are. That sings my soul. Then sings my soul, my savior, your God to [Music] thee. How great thou are. How great thou are. Oh my [Music] god. When I in awome [Music] wonder consider all the world thy hands have made. I see the stars. I hear the rolling thunder. My power throughout the univer Ever display [Music] his sing my soul I say your God to thee. How great thou thou are. [Music] How great thou are. Then sings my soul, my savior God to thee. How great thou. How great thou are. How great thou are. How great thou are. You are [Music] great. Lord God, thank you Jesus. Thank you Jesus. We love you. We love you. We worship you. We worship you. [Music] Thank you Jesus. Thank you. We love you. We love you. Thank you, Jesus. Thank you. You may find your seats this morning. We have a special song this morning before we get into the word. I'd like to thank you for joining us this morning. Our goal is to meet with God during our worship time. Amen. Scriptures say that he inhabits the praises of our his people. It says that he is in our midst. And so that is our goal to create that environment. Uh we don't want to do something that pushes God away out of the room or make it about ourselves. Amen. We are here to give him glory and honor as he is the one that changes us. This song is about uh how powerful the word of God is and so important for us to remember that and it's part of the message this morning. [Music] kind of faith it takes to climb out of this boat I'm in onto the crashing waves out of my comfort zone of the unknown where Jesus is and he's holding out his But the waves are calling out my name. And they laugh at me, reminding me of all the times I've tried before and fail. The ways they keep on telling me time and time again. Girl, you'll never win. You'll never win. [Applause] But the voice of truth tells me a different story. The voice of truth says, \"Do not be afraid.\" And the voice of truth says, \"This is for my glory.\" Out of all the voices calling out to me, I will choose to listen and believe the voice of truth. Oh, what I would do to have the kind of strength it takes to stand before a giant with just a sling and a stone, surrounded by the sound of a thousand warriors shaking in their armor, wishing they'd had the strength to stand. But the giants calling out my name and you laugh at me. Reminded me of all the times I've tried before it failed. The giant keeps on telling me time and time again, \"Oh, you'll never win. You'll never win.\" But the voice of truth tells me a different story. The voice of truth says, \"Do not be afraid.\" The voice of truth says, \"This is for my glory.\" Out of all the voices calling out to me, I will choose to listen and believe. I will choose the truth. I will choose to listen and believe. I will choose. I will choose to listen and believe the voice of truth. [Music] Scriptures say that he who has an ear to hear, let him hear what the spirit is saying. Amen. Amen. And uh this uh last line I just realized says, \"Out of all the voices calling out to me, I will choose to listen and believe the voice of truth.\" And when we want to hear what the spirit is saying, God has a message for the church. Amen. He's got a a something he wants to tell us. But we also have to decide to hear that voice. And you kind of have to put out the other voices. Amen. Your own voice, your friend's voice, you know, the people around you voice. Does it line up with his truth? Does it line up with his voice and what he says? Amen. It's powerful and this can really change your day. It can change your perspective. Amen. So, that's why this song is so powerful and we wanted to share it with you this morning. You may find your seats again. Uh worship team, thank you so much. Before we transition, I'd like somebody to lift up their voice in prayer. Uh Carmen, will you pray, please? Heavenly Father, we thank you for this day. We thank you, Father God. Heavenly Father, we thank you for this day. We thank you, Father God, for the opportunity to come together in one accord, in one spirit to worship you, Lord God, and to give you all the honor and glory. Father, we thank you for the opportunity to sit here and listen to your word. Father, we ask that you would open up our ears that we can hear your word. Father God, like your word says, whoever has the ear to hear, let him hear. Father, we want to hear your voice. We want to obey your voice. We want to walk the straight and narrow, Father God. We want to please you, Father. We want less of us and more of you, Lord Jesus. You who baptize us with the spirit of God, would you come? Would you come and baptize us Aresh with a new ear to hear your voice and let us apply it to our lives so that we can walk it out. Lord Jesus, we give you all the thanks, all the glory. You're worthy to be praised. Amen. Amen."}