{"video_id": "pUYUb1W2gKE", "title": "Are You Having Trouble Hearing? — Easter April 20, 2025", "published_at": "20250420", "transcript": "[Music] All right, folks. Well, if you can pause what you're doing, we're going to stand this morning. Uh Jesus Christ, if you don't know, he was crucified on the cross on Friday. That's why we call it Good Friday. He did an incredibly good thing for us. Amen. Amen. And the scriptures say that uh he was marred and I mean he was hurt more than any man. And it's very important to understand so we can be appreciative of what he has done for us. His blood as we've learned uh two weeks ago the blood there are triumphs and achievements that the blood of Jesus Christ has done for us. And one of those things is that we by his blood have access to enter the holiest of all. We can come to Jesus ourself. You don't have to go through the pastor. You don't have to go through the priest or the high priest. You don't have to be born of a certain race. You can come in to Jesus Christ and hear what he has to say to you by his blood. And so we're thankful for that. Amen. And this morning we are thankful for his resurrection. By his own power he rose from the grave. Hallelujah. Hallelujah. So as an act of appreciation and love and care for the one who saves us, the one by his power who gives us new life. Let's worship Jesus together. Will you stand with me? Hallelujah. Praise the Lord. Can you do something? Hallelujah. Well, we're celebrating a risen King today. What a blessing. What an amazing thing he's done for us. Let's just give him a shout. Thank you, Jesus. Woo! All right, come on. Get your hands up. Hands up. People of heaven singing hallelujah to you for all we've been given. Saved and set apart ashes into our children of the king. Every promise kept only hope ahead. Lift your heart and sing. We're going to live live forever. We're going to live live forever. Come on, get your eyes up. Eyes up, people. Yeah, it's time to rise up. Rise up. Show them what you've been given. He rolled that stone away. Call us from the grave. Every fear is gone. Risen and reborn. All our joy restored. Every our song. We're going to live live forever. We're going to live live forever. Future's bright in paradise. We'll be dancing in the streets. We're going to live live forever. He rolled that stone away. From the grave. Every fear is gone. Every heart restored. Freedom is our song. We're going to live live forever. We're going to live live forever. Come on, get your eyes up. Eyes up, people of heaven. Yeah, it's time to rise up. Rise up. Show what you've been given stone away. Call us from the grave. Every fear is gone. Risen and reborn. All our joy restored. Freedom is our song. We're going to live live forever. We're going to live forever. Yeah. Our future's bright in paradise. We'll be dancing in the streets. Live forever. We're going to live live forever. We're going to live live forever. Oh, we're going to live forever. We're going to live forever. Let's thank Jesus this morning. Thank you, Jesus. Thank you, Lord. We thank you, Lord. We thank you, Jesus. We love you, Jesus. Greatest day in history. Death is beaten. You have rescued me. Sing it out. Jesus is alive. He's alive. The empty cross, the empty grave. Life eternal. You have won the day. Sing it out. Jesus is alive. Let's clap together. He's alive. And oh, happy day. Happy day. He washed my sin away. Oh, happy day. Happy day. I'll never be the same. Oh no. Forever I am changed. When I stand in that place, free and last, meeting face to face, I am yours. Jesus, you are mine. Endless joy, perfect peace, earthly pain. Finally, we'll see. Celebrate. Jesus is alive. He's alive. And oh happy day, happy day. You wash my sin away. Oh happy day, happy day. I'll never be the [Music] same. Oh no, forever I am changed. And oh, what a glorious day. What a glorious way that you have saved me. And oh, what a glorious day. What a glorious day. What's his name? Jesus. And oh, happy day. Happy day. You wash my sin away. Oh, happy day. Happy day. I'll never be the same. Oh no. Forever I am changed. One more time. Oh happy day. Happy day. You wash my sin away. Oh happy day. Happy day. I'll never be the [Music] same. Oh no, forever I am changed. Oh, forever I am changed. Are you changed? By the sacrifice of Christ, the blood of Jesus has covered our sins. Tell the world we've been forgiven. Amen. Thank you, Lord. It's good news. It's good [Music] news. So, I want to hear someone or everyone tell me what does John 3:16 say? Everlasting life. Amen. Amen. Amen. You know, we have someone special that we have known for so many years working together. And when she passed away about two weeks ago, it is a reminder. Death is a reminder. If you are born again and Christ has been received in your heart, wow, we're going on. We're going to live forever. We don't grieve like those who have no hope because we know the truth. Amen. It's a beautiful thing. All right. Praise the Lord. Oh, come all you weary. Come all you thirsty. Come to the well that never runs dry. Drink of the water. Come and thirst no more. [Music] Come all you sinners, come find his mercy. Come to the table. He will satisfy. Taste of his goodness. Find what you're looking for. For God so loved the world that he gave us his one and only son to save us. Whoever believes in him will live [Applause] forever. The power of hell forever defeated. Now it is well. I'm walking in freedom for God so loved. God so loved the world. Bring all your pains. Bring your addictions. Come lay them down at the foot of the cross. Jesus is waiting there with open arms. is open on for God so loved the world that he gave us his one and only son to save us. Whoever believes in him will live forever. Here it is on the power of hell. Forever defeated. Now it is well. I'm walking in freedom for God so loved. God so loved the world. Praise God. Praise God from whom all blessings flow. Praise him. Praise him for the wonders of his love. Oh, praise God. Praise God from whom all blessings flow. Praise him. Praise him for the wonders of his love. [Music] For God so loved the world that he gave us, his one and only son to save us. Whoever believes in him will live forever. [Music] The power of hell forever defeated. Now it is well. Walking in freedom for God so loved. God so loved the world. Now let's sing it but let's say we're walking in freedom. The power of God forever defeated. Now it is well. We're walking in freedom. For God so loved. God so loved the world. We love you, Jesus. We love you, Lord. Thank you, Jesus. Thank you. Tell him you thank him. Tell him you appreciate him. Honor him today with your voice. Hallelujah. Thank you, Lord. What a privilege. What a privilege to know we could come before you, Lord Jesus. Hallelujah. Lord, what a privilege it is to come before your presence. That Lord, your death on the cross did so much more than we can even even express in our human ability. Lord, the covenant, the promise that you would be our God, and you would never leave us, never forsake us, that you were raised and went into heaven to prepare a place for us. Lord, for those who have accepted you, Jesus, there is a glorious future and an abundant life here on earth. Amen. Amen. Amen. I know who I am cuz I know who you are. The cross of salvation was only the start. Now I am chosen, free and forgiven. I have a future and it's worth the living. [Music] I wasn't made to be tended in a grave. I was called by name. Born and raised back to life again. I was made for more. So why would I make a bend my shame when a fountain of grace is running my way? I know I am yours. I was made home. I know who I am. Cuz I know who you are. The cross of [Music] salvation was only the start. And now I am chosen. Free and forgiven. I have a future and it's worth the living. I wasn't made to be tended in a grave. I was called by name. Born and raised back to life again. I was made for. So why would I make a bed in my shame when a fountain of grace is running my way? I know I am yours. I was made for more. Lord Jesus, this morning we recognize and we are thankful for what you have done. But Lord God, we recognize this morning that we have been made for more. God, more than just living in this life, going about our days and going about our lives, working and all the things that we do. God, we've been made for more. God, you have a purpose for us and for your people. Lord Jesus, this morning we recognize that. And Lord, we want to respond to you, to what the purpose is that you have for us, God, we pray this morning that you would soften our hearts, God. Lord, that you would give us ears to hear this morning what you have to say to us. And everyone said, \"Amen.\" Amen. You may find your seats this morning. Amen. Hallelujah. Okay, I'm going to ask Ernan and Stephanie. I need you to do something for me. Ernan, can you come over here? Stephanie, I need you to go to the bathroom all the way in the back and close the door. Aron, I need you to go to the middle area. There's a door and I want you to go past it and shut the door. And then I'm going to need someone's help to go get them. Let's see here. Let me know when the doors are shut. Doors are shut. All right. You can't hear the door. Come on. Okay, I'm gonna turn the mic on. Stephanie, come out. Stephanie, come here. Stephanie. Okay, we got to go get her. She's down in the deep. All right, we have a lesson sheets. If you guys want to follow along and you want something to take home, uh, you can follow along the scriptures. Just fill out a little blank or two. It'd be good. A takeaway today. [Laughter] Oh. So the message today is called have you heard? And uh we did the exercise. Can you hear me? Description. The scriptures say John 10 verse 27, \"My sheep hear my voice. I know them and they follow me.\" And so, if I may have your attention, we're just going to share a quick message here from the scriptures. If I may have your attention, they're going to pass out little sheets. You can follow along. And uh you better you better get going because I'm going to go fast. So what we did just now is I had Stephanie in the back room in the bathroom with the door closed. I had her nan in the middle area with the door closed and they were having trouble hearing. And the point this morning is are we having trouble hearing God? Are we having trouble hearing God's word? Are we having trouble hearing from God and hearing God's word? And so with our example this morning, Stephanie was all the way in the back. She could not hear me. The doors were shut. There were two doors in the way. She was all the way in the back and she couldn't hear. Ernan was sort of in the back and he could hear me a little bit but I had to shout. Right. And the scriptures show us that our hardness of our heart, our mind, our will, our emotions gets in the way of hearing God's voice. And how does God speak to us today? What's the main way? Does anybody know? You can raise your hand and tell me. How does God speak to us today? Does anybody know? by the Bible. That's right, Margarita. The Bible. The Bible has there's five billion copies throughout the world and it's available to all Americans. Anybody who has a phone has access to the Bible. And so God has given us access to his spoken word through the Bible. And we can hear from God through those scriptures. Now, they are words written on the page and yes, you have to read it to get knowledge. Some some people have never read the Bible. They don't know what it says. And so, first step is you got to know what it says. And then as you're reading it, you can pray and ask God, \"Hey, can you speak to me through this?\" Of course, you don't talk to God that way. But in John 12:28, God spoke from heaven to Jesus. And you can go look it up later. See, this is what the sheet is for. You can go look it up later. The people who stood by and heard it said that it had what? Thundered. They heard a noise. Others said, \"An angel has spoken to him.\" Now, why would they say that? Because they heard a message. They heard words. So, one person heard a noise. Another person heard a message. Amen. And it's important for us to understand and God is asking us today, are we hearing a noise from God or do we hear his words? Jesus answered and said, \"This voice is not come did not come because of me, but for your sake.\" God is speaking to us through the Bible for our sake. It's not because he doesn't like you. It's not because he wants to bend you to his will. It's for your sake. Remember the scriptures say in John 10:10, \"The thief has come to steal, kill, and destroy. But I have come to give you what? Life. I have come to give you life.\" And not just life, life more abundantly. So it's important to hear what Jesus is saying. Another example in Acts 22:6, a great light shone from heaven around me. And the person talking is Saul of Tarsus whose name later changed to Paul. Okay? And he had a meeting, an encounter, and there was a great light in the sky because he was persecuting and he was hurting Christians. And Jesus got right in his path and said, \"Hey, you got to stop this.\" And Jesus had already risen from the grave and he was up and sitted on the right hand of the father. But he shows up. Jesus shows up in a great light to Paul. And Paul says those who were with me saw the light but and were afraid but they did not what? Hear the voice of him who spoke to me. And so with these two examples we see that there are two kinds of people. people who can hear the words from God and people who hear a noise. And God again is asking you today, is God's word, the Bible, just noise to you? Is it just noise to us? Has it become like static? Is it something that we tune out? Do you understand what I'm saying this morning? Does that make sense? Yes. I I think it's a powerful question. Why is Jesus's voice important? If you didn't know in the New Testament when Jesus came, he came up to a lame man in Matthew chapter 9:6 and he said what? Arise, take up your bed, walk. He didn't touch him. He didn't do some magical uh you know uh ceremony. He what he spoke and when he spoke that man arose. And so that's just one example. Another example, the lepers, they came to Jesus. Leprosy is a disease in Luke 17:14. And Jesus said what? Go show yourselves to the priests. And as they went, they were cleansed from their leprosy. See, Jesus what? Spoke. John 4 4:50, \"Go your way. Your son lives.\" What did Jesus do? He spoke and the son was healed. Matthew 12:13, Jesus said to the man who had a withered hand, he said, \"Stretch out your hand.\" Jesus spoke and something powerful happened. God's word is powerful. They were on the boat with his disciples. Jesus Christ and his disciples were on the boat and there was a storm and the disciples were afraid. And in Jesus, what is he doing? He's sleeping. At a time like this. Jesus is sleeping. And they wake him up and they say, \"Jesus, we're going to die. We're afraid.\" And Jesus says, \"Don't be afraid. Come on. got the man on the boat and he says, \"Peace be still.\" You guys remember the story? And what happened? It was still the storm and the clouds and the thunder and the lightning and the waves and the wind all stopped at the word of Jesus Christ. So, do we understand this morning how powerful his words are? Do you understand that from the scriptures this morning? The words of God are powerful. John 11:43, Jesus loudly said, \"What? Lazarus, come forth.\" And Lazarus, who had been dead for how many days? Four days, came out of that grave. Why? Because Jesus what? Spoke. And so his words are very powerful. And this morning we don't want to have a hardness, a dullness, a tuning out of the word of God. Why can't we hear? We have our little friend here. He's got his ears plugged and he's got a face. Matthew 13:15. For the hearts of this people have grown dull. Their ears are hard of hearing. So he's relating the ears and the heart together. We have trouble hearing God's word, the Bible, because our hearts become hard. I've heard that all my life. I went to church all my life. When I was a kid, they they preached that they said that all my life. And so when somebody says the word, the word is spoken, we get what? We are heart. That's not a good thing because Christ has life for you, right? And we want that life and we can't get it if we got a hard heart. Do you know what happens to a heart that gets hard naturally? Another word here is fat, right? Dull. It's like this. You know, a good heart. You ever listen to a kid's heart? Their hearts are like this. Boom. Boom. Boom. Boom. They're going so fast. When I have my little kids, I listen to their heartoom boom. I'm like, man, and then you get older and you're kind. If it goes too slow, we got a problem, right? We're going to have issues. We're going to be in the hospital. That heart has to keep pumping. That blood has to keep flowing. Very important for your heart to be responsive. Amen. So we want to have a good heart toward God. One that is receiving and hearing God's word. Mark 5:1 Jesus came out of the boat. Immediately there met him a man of the tombs with an unclean spirit. He he was and he who had his dwelling among the tombs. So we have here a guy. He had an unclean spirit and also he had made a choice to dwell among the tombs. How many want to do that? I mean it naturally he's doing this but in in a spiritual example we choose to go and live with people that are doing things that bring to death. Have we made a choice to dwell with people who have rejected God and given themselves over to darkness? We don't want to do that. God is calling you out of that. night and day he was crying out and hurting himself. You have a lot of folks in America today that are hurting themselves. They're in destitute. They're they're depressed. They may have things figured out naturally, but when it comes to their emotions, they're they're in trouble. And that's not what God has for you. That's not life. That's not more abundant life. Is that abundant life? No. John 11:39, Jesus said, \"Take away the stone.\" He has been dead for four days. Now, I just want to focus on Lazarus being dead, right? And in the scriptures in Ephesians 2:1, it says, \"You he made alive who were dead in what? Trespasses and sins.\" So when Lazarus was dead, it's an example of our spirit, our eternal man. If we we can be dead. If we are trespassing against God and sinning against God, we are dead. And God has a solution for that deepest, darkest place. Stephanie was back there. She was all the way back. Two doors shut. And my voice wasn't good enough. But Jesus's voice cuts through all of that. John 11 he commanded take away the stone and then shouted Lazarus come forth. So what is Christ's solution? The first thing he says is what? Take away. Say it with me. Take away the stone. In Ezekiel 36:26 it says I will give you a new heart. I will put a new spirit within you. I will take the what? Heart of say it with me. stone. I will take away your heart of stone and give you a heart of flesh. How many know we need a heart of flesh in our natural bodies to live? Yes. It's the same way in your eternal spirit, your spiritual man. You need a heart that is responsive to the word of God. Do we understand how powerful the word of God is? Remember when Jesus spoke, people were healed. When Jesus spoke, things happened. Amen. That powerful word is what we need. And he this is a promise, an unbreakable promise that he will give us a new heart. We may think, \"Oh, I've lived a certain way or I've done so many of this or I I'll never change or this person will never change.\" Jesus can change them. Jesus has the power to change them. It's his unbreakable promise. And I submit to you this morning, the greatest transformation that you can have in your life will come from your willingness to hear the words of Jesus Christ, God the Father. Matthew 13:15. says, \"For the hearts of this people,\" can somebody go grab Miss Woods out there, please Matthew 13:15 says, \"The hearts of this people have grown dull. Their ears are hard of hearing.\" We already heard that, right? We can have a heart that is dull. We don't want that. And it says, \"Otherwise, they might see with their eyes, hear with their ears, and understand with their hearts. And what is this word here? turn so that I should heal them. So the goal we read here in Matthew 13, the goal is for us to hear so that we can what? Step two is say it with me. What's this? Step two, turn. So first we hear, then we turn. Right? And Jesus says, \"So that I should what? Heal them.\" See, there is a healing that God can bring to the ones that are hurting themselves. There is a healing that God can bring to the ones who need help. But we've got to be willing to hear. Amen. We've got to be willing to let God give us a new heart. those doors, if you remember our little example here, they couldn't hear my voice. But once the doors are open and once they've come out, they can hear. Amen. And if we have a door over our heart, if we have that hardness, God can't get through. And it's dependent on us. Are we willing to let God give us a new heart? And so this morning, remembering resurrection day, remembering the crucifixion on the cross, Jesus Christ is living today. And he is also doing what today? He is speaking. And if you put your his word into your heart, he will speak to you. It is important for us in our lives to hear to listen to the voice of Christ and his voice can be found in the scriptures. In America today, we are bombarded with messages, opinions, beliefs from all kinds of places. I don't know if you know that, but you're living in America just like I am. And there's a lot of opinions out there. And God's voice is the one we need to be open to hearing above our own, above our friends, above the college, above the political party, above the judge, above the psychologist. Which one are we holding number one? And I again submit to you today, the greatest transformation that will ever occur in your life will come from your willingness to hear the words of Christ. And so we're going to sing this song once through. This song comes from a scripture from Mary. When the angel visited Mary and told her about her having a a baby, Jesus Christ, her response was, \"Be it unto me according to your word.\" Now, this has the old English in it, but it's still the right uh response that we have this morning. So, we're going to sing it real quick, and then I'm going to invite you to stand and sing it unto God from your heart unto him. So, we're going to sing it together. Be it unto me according to thy word. [Music] My [Music] heart responds to thee. Let there be a performance of that which was spoken. For nothing is impossible with God. So, have you heard the word this morning? Yes. The word was uh from the scriptures. And so, our response this morning is just yes. God, I pray that you give me a new heart. That's what this song is saying. Lord, what you have promised, do in me. And so, as we sing it again, we're going to sing it in that way with our eyes closed. We can lift our hands and you can surrender to him. But that is our action this morning of inviting Jesus to do that work, opening that door, removing the stone. Amen. How many of you want that this morning? Amen. Let's sing it unto him. And let's close our eyes. Be it unto me. according to thy [Music] word. My heart responds to [Music] thee. Let there be a performance of that which was spoken. [Music] For nothing is impossible with God. As she continues to play, we're going to invite you to bow your head and pray your own prayer to God and just say, \"Lord God, give me a new heart. God, soften my heart to your word. I don't want your word to just be noise anymore. I want it to be clear. I want it to be real to me. So, let's pray that prayer right now. Let's bow our heads and pray together. Lord Jesus, right now, God, we lift up our voices and we pray to you. We invite you, Lord Jesus. God, Lord, we pray and we ask that you would give us that new heart, Lord Jesus, that is soft toward you, Lord God. we pray this morning. Please, Lord, it's your promise that you have for us. Thank you, Jesus. In Romans 3:23, it says that all have sinned and fallen short of the glory of God. In Romans 6:23, it says, \"The wages of sin is death, but the gift of God is eternal life.\" We celebrate that gift this morning, his resurrection, his death on the cross for our sin. Amen. And in 1 John 1:9, it says, \"If you confess, he is faithful and just to forgive you and cleanse you from all unrighteousness.\" And so, you may be thinking, \"Well, I need a new heart, but I don't even know Jesus.\" So, we want to give you that opportunity and invite you to accept Jesus into your heart. And if you're willing to confess your sins to Jesus, if you want to invite Jesus into your heart right now, let's bow our heads one more time. And I'm going to ask you right now to just lift up your hand. If you've never accepted Christ, lift up your hand and you want to do that. Lift up your hand and let pray this prayer with me. Repeat after me. Lord Jesus, Lord Jesus, I confess. I confess. I admit I admit I have sinned against you. Lord Jesus, I pray. Forgive me and cleanse me. Forgive me and cleanse me. Lord Jesus, I want to follow you. Lord Jesus, I want to follow you. I commit I commit to hearing your word. to hearing your word and responding to it. and responding to it. Thank you, Lord Jesus. Thank you, Jesus. I receive you into my life. I receive you to my life. Amen. Amen. Amen. Amen. Hallelujah. [Music] Celebrate. Celebrate Jesus. Celebrate. Celebrate Jesus. Celebrate. Woohoo. Celebrate. Jesus. Celebrate. Celebrate. Jesus. celebrate. He is [Music] ris forever more. He is ris. [Music] Come on and celebrate the resurrection of our Lord. Cate Jesus. Celebrate. Let's clap. Cate Jesus. [Music] Celebrate. Celebrate Jesus. Celebrate. [Music] Cate Jesus. Celebrate. He is [Music] ris forever more. He is [Music] ris. Come on and celebrate. Come on and celebrate. Come on and celebrate. Come on and celebrate the resurrection of our Lord. Thank you Jesus. Thank you Jesus. Amen. Amen. Amen. Amen. [Music] We encourage you this week, not just for Easter Sunday, but for now going forward, that we would have a heart to hear what Christ has to say to us. Amen. How many want to do that? That's going forward. Amen. Amen. We can always grow. We want to thank those online for joining us. God bless you. Those online, we trust you heard the word. We don't want to have a fat heart. We want to have a good heart. Amen."}