{"video_id": "QFcWRmOIEkY", "title": "Fall Festival of Fun 2025", "published_at": "20251104", "transcript": "Well, we are Vinebuster Church right here, right next door. And we're here in the outlets and we are here to shine Jesus's light. In John 1:5, it says that the light shines in the darkness and darkness is not overcome it. It says in Psalm 27, \"The Lord is my light and my salvation.\" Jesus is that unstoppable light and nothing can put him out. Hallelujah. Okay, you guys ready? I'm not supposed to tell you when I'm stopping. [Music] >> Uhoh. [Music] >> Okay, we got a polar magic number. [Music] Okay, I'm going to pull the number. The verse of the stage watch is John B. John 10 verse 10. The thief, the dark guy comes to steal and kill and destroy with I have come. Jesus has come that we may have life and have it more abundantly. >> Awesome. Okay. And are you ready? Number 15. 15. Oh. I thought you like those. >> All right, your spot. >> The verse for this cake is 2 Corinthians 5:17. If anyone is in Christ, he is a new creation. The old has gone and the new has come. And this scripture reminds us that Christ can get us a new person. Amen. Lucky 11 11 [Music] so you have 29. It says that we Christians are a chosen generation, a royal priesthood, a holy nation, his own special people that we may proclaim the praises of God who has called us out of darkness into his marvelous light. Isn't that awesome? Wow. God, we are have a great identity in Jesus Christ and we are thankful as a Christian. I am so thankful. [Music] >> All right, find your spot. If there's anyone, you give me two. >> The scripture for this cake block is John 8:12. I really like this scripture. Jesus said, \"I am the light of the world. Whoever follows me will never walk in darkness, but will have the light of life.\" Wow. You know, plants need light to survive. All right. And that is Jesus Christ for our spirit. He needs that light. I have the lucky winner right here in my hand. Never picked this number before, but I have now. Number 28. >> 28. [Applause] >> Okay. The verse on this one is first John 15. This is a message we have heard from him and declare to you that God is light and in him there is no darkness at all. Wow. God is light. Man, I can talk about that for a while. So powerful. Number 20. >> All right, find your spot. Make sure you got a number. And the words I just gave you is in Ezekiel 36:26, I will give you a new heart and put a new spirit in you. It is his covenant, his promise. Such a powerful promise will upset and all that God can give you a new heart. Did you know that? And here we go. The number >> the winner of the cake for this walk is number 15. Put your feet on there. Put your feet on. There you go. You already know what to do. He's a pro. Put your feet on two of them. The verse of this one is Romans 3:23. For all have sinned and fallen short of the glory of God. Romans 6:23. But the gift The wages of the gift of God is eternal life of Jesus Christ our Lord. Jesus is the solution tonight. >> Number 13. [Music] All [Music] right, find your spot. Find your spot. >> Okay, I'm going to pull the number. John 8:12 says, \"I am the light of the world. Whoever follows me never walks in darkness, but he will have the light of life.\" That is Jesus Christ. Tonight, folks, we are Vine Buster Church right here in Lake Elsenor Sun Sunday 10:00 a.m. Okay, I have a number. >> Ready? >> Number eight. >> Eight. Do we have a winner? [Music] >> We have a winner. Awesome."}