{"video_id": "TQqUfKsBgQk", "title": "The Beginning, Time, and Goal of The Holy Spirit—May 4, 2025", "published_at": "20250504", "transcript": "We're going to be talking about the spirit this morning. Wonderful spirit of God. We're going to look at the example first. We're going to start with our little friend. No, we're going to start with this guy. And I'm going to pour some water in the cup. Oh, wait. Do I have Is there a problem? It's upside down. All right. Oh my gosh, that water looks so good. Oh man, it's wet now. Uh, I see a little bit on top. The c the bottom has it. A lot of people don't believe in the spirit through teaching or whatever it may be. People reject the spirit of God. When the spirit comes and comes upon them, it's a good experience, but they don't allow it to be contained in them. Amen. And then there's people that believe in the spirit, but they're lazy. They're on their side. Yeah, I believe in the spirit. Don't you believe in the spirit? I sure do. I believe. Are you going to do anything about it? No. Spirit comes upon them. It's a good feeling. Right? If this thing were really hot and the water comes on be Oh, nice. Right. But it's not in there. Amen. It's still on the outside. But if you turn yourself properly, receive. Open up. Open up your mouth. Amen. Come and worship. Oh man, now I'm holding something. I have water. And if I had to water that plant right behind Mr. Thompson right there. Can somebody go grab me that plant? I have more going on. Somebody grab that plant. Uh, I should have said a person's name. There you go, Leora. Thank you. So, a cup's full of water. Amen. So now you got another cup. We accepted Jesus Christ. I believe in the spirit of God and I am open. But what is happening? What's happening? I'm full of the spirit. I'm filled with the spirit. Hallelujah. What what what's the problem here? Can you imagine that was a tree? Would this be enough? No. You need a lot. So, as you're growing in God, that's why we want to talk about growing in God, right? Bible likens us to a tree. So, you're like a tree. You're also like a cup. You're like a lot of things. So, you got to follow the illustrations. You're like, I'm like this and I'm like that. But yes, if we don't take time to expand the spirit of God in us to dig out ourselves by prayer, by fasting, by the the word of God, by coming to his house, worshiping him, we're going to stay like this. And we believe in the spirit, right? And so it's good. Excellent. You believe in the spirit. You're you're the right side up. Yes. But we can't contain a lot of the spirit of God. And like David said, \"My cup runs over.\" Why does our cup run over? Because we can't hold it all. Amen. And so you want to dig yourself out. My daughter really loves this cup. Uh we're going to have a mess here, Miss Woods. I'm sorry. I didn't realize that this had the holes on the side. So it's a recipe for disaster. So, now we're getting somewhere. We have some more water, right? Uh, this is enough for medicine if you're But we're talking about water. You need a lot of water. Sometimes if you want to water that tree out there, the palm tree, you need what? A lot of water. Amen. And so, you want to keep digging yourself out. You see the different sizes, right? Small, medium, uh, little bit bigger than medium. And this is much better. Amen. You can water a lot of stuff. There's five gallons. I can We can You can all drink from this. All of us in here could have a drink from this jug. Amen. Amen. Okay. Now I have to leave that. I just brought the illustration. I don't know about getting rid of it now. I don't know anything about that. So, good luck. But do we see that this morning? Can you see it? The sizes matter. And when you go to water something, the Bible talks about uh let let me just keep going here. Isaiah chapter 44:3. Guys should have your lesson sheets if you want to follow along. If you want to stay awake, I mean I preach many times and people are sleeping. My gosh. Well, if you don't want to fall asleep, get your hands are moving. Your eyes are looking and let's engage. Isaiah 44:3. I will pour out I will pour water on the thirsty land and streams on the dry ground. I will pour my spirit upon your offspring and my blessings on your descendants. I bring up this scripture because it quickly shows us that water and the spirit are the same. Right? I will pour water on a thirsty land. I will pour what? My spirit. Talking about water and spirit the same thing. 1 Corinthians 3:6 I planted. Who wrote Corinthians? Who wrote Corinthians? Paul. Paul. That's right. So when he says it says I, he's talking about who? Paul. So we got two people here, right? Paul and what's this guy's name? Apollos. Not Apollo from, you know, Rocky. Apollos. He watered, but God gave the increase. So then, neither he who plants is anything nor he who waters, but God gives the increase. Now he who plants and he who waters are one and each one will receive his own reward according to his own labor. So you see in this scripture water is used to water the seeds that grow. Amen. And that illustration goes back to the parable of the swer. Right? What is the seed in the parable of the sewer? Somebody tell me what is the seed? The word of God. That's right. The word of God needs what? water and soil. It's our job as Christians, as people that believe in God to be good soil. Amen. And that means that we're not hard. We don't have a bunch of rocks around us. We don't, you know, not full of the the thicket, the thorns around us, right? You want to be good ground. Amen. So that's your responsibility to be good ground. You got to make an environment in your heart, in your daily walk, in your life to allow something to be planted in you. And what is that thing to be planted in you? What is it? The word. And we come to a church and we we spend time in prayer and we let that spirit water us. Amen. So you you you want this cycle and this cycle produces life and you need the life of God in you. If you don't get into this cycle, you will not grow. Okay? If you don't get into the cycle of growth, you will not grow. You will stay small and ultimately you could what? die. And I'm not talking about physically. I'm talking about spiritually. Amen. So it's clear. And so God is asking us this morning, do we have any water to give? Are we empty? Do we have water for ourselves and water for others? Amen. John 7:37. On the last day, that great day of the feast, Jesus stood and cried out, saying, \"If anyone what thirsts, let him come to me and drink.\" Do you have a thirst, a desire for the water and the life of Jesus Christ? Let him come to me and drink. So what what is the solution? You first got a thirst. If you have that desire, you have that thirst, what do we do? You where? You come to Jesus. You come to his word. You come to your knees and you talk to him. You come to his house. You This is how we come to him. Amen. You don't go fly over to Israel. You don't go fly over to Russia. You don't fly over to China. You don't fly to the east coast. You go on your knees. You go to the word of God. Amen. Thank God. I mean, what are the people in Africa supposed to do? They don't got loads of money. I don't got loads of money. I can't be flying to Israel, flying here. Where's Jesus? He's right here. He is the most costefficient God. Amen. You can meet with him on your knees. You can go to a church near your house, meet with his people. Isn't that a great setup? That's wonderful. God knew what he was doing. Come to me and drink. So when we come to Christ, we can't just come to his house. We also have to what? Drink. That means when you come into God's house, yes, you came to the right place. He's in our midst. But now you got to do some more steps. Worship. Got to open your mouth. Open your mouth. Right? It's a ah ah. The drink gets in your mouth. I love you, Jesus. How great is our God, right? Open your mouth. He who believes in me, as the scriptures have said, out of his heart will flow rivers of living water. So God wants to put his life, his spirit in you so that it can what? Flow out of you. And that is the goal. But this he spoke concerning the spirit. So he he tells us he's not just talking about water. He's not talking about physical water. He's talking about what? The spirit. And if if if what I'm saying is go if I'm going too fast, remember we post all these videos online and as an activity, as a a way of seeking God, you can review this message message again. You can go over it with your notes there. You can write new notes. You know, you you want to seek God, let's get let's seek God. Amen. What is wrong with her? She must have been somebody must have told her no. So what is our response? Does the spirit flow from our face? Right? He wants out of our belly shall flow rivers of life-giving water. Right? Is the spirit flowing out of our face? How does it flow out of our face? Or is it flatter face like this? You know, I went and visited Marthan and Paul Gomez and that there's that little boy. He gives him that look, little Adam. Hi, Adam. You know the side eye, the look. Who are you? What do you want? Spirit of God can come out of your face, out of your countenance, give you can smile because God, the spirit is exuding. Amen. Is it coming out of your mouth? We have a lot of We have a big trouble with this, right? Amen. At work, you got to talk, right? You got to say stuff. Oh, yeah. You get mad. You get upset. I can't stand this place. Is that the spirit coming out of you? No. You can have that that spirit can have an effect on you every part of your life. Talking to your family, talking to your kids, talking to your spouse. Uh sometimes we don't talk nice. Amen. Sometimes we are angry. Sometimes what comes out of our mouth is not the spirit. And then we come into God's house and what do we have to say? What is the spirit saying out of us in God's house? Amen. When you go before him and kneel before him, what's coming out of your mouth? Is the spirit coming out of you? That's what God wants to do. If you can identify and say, \"Yeah, the the my mouth is not in all these areas.\" The spirit's not coming out. God wants to come out. That's what it's talking about. Out of your belly shall flow rivers of life giving water. Giving water. I was uh in a meeting at work and I don't know what I was doing. I was just talking, having fun, you know. Got on the meeting at 9:00 in the morning and they all said, \"What what did you have cuz I want what you had? Did you drink some juice? Did you what did you what happened to you?\" And uh I had just you know got I was at the gym and I read my Bible at the gym and I take it to the gym and you know I do a workout. I come I read and then I work I read and this powerful the word of God is powerful. God the Bible says redeem the time. If you don't you say you don't have time make time. You know I'm thinking when I walk through the gym everybody could be doing this. How come everybody doesn't have their Bible out? Amen. There's no excuse. Everybody in the gym has no excuse. You can you can Yeah. You get tired. Jesus is the Lord of God Almighty. Boom. And then I get on the phone call and they're like, \"What did you Who what did you have? Are you on drugs or something?\" So, is our response to be lazy? Or look at this little girl. We just want to pick her up and give her a hug. Yeah, that's the kind of response we want to have toward God with our hands. Is the spirit flowing out of our hands? What are we doing with our hands? Amen. Are we working hard? Are we using them to work? Are we using them to do what's good? Are we using them to do what's wrong? Our attitude, our mindset, does the spirit flow from it? Remember that scripture says, \"Out of your belly shall flow rivers of lifegiving water.\" So out of all of our out of us, our eyes, our our mouth, what comes out? Amen. The Holy Ghost will set your feet a dancing song. Amen. You know what comes out of your feet? The Holy Ghost will set your feet a dancing. The Holy Spirit is here and his power is real. We were singing that today. If you don't have these things, you can have them. If the spirit is not coming out of you, it can and it should. Okay? And we're going to show you from the scriptures this morning that that's what God wants to do to you. I already showed you red letters. He just said it. That's the goal. Amen. So, we either going to take the goal that God has given us and take it to heart or we just, you know, where where's that little girl? Yeah. You do that, right? And God comes, forget it. Or we do what that girl does. Genesis. Okay, we got a long way to go here. All right, you guys ready to get on back on track? We're getting on the train here. Genesis 1:2, the earth was without form and void. Darkness was on the face of the deep. The spirit of God was moved o moved over the face of the waters. Genesis 1:3, God said, \"Let there be light.\" And there was light. God saw the light. It was good. He divided the light from the darkness. He called night day and darkness he called night. So the evening and the morning were the first day. So at the beginning of everything, the beginning of the Bible, the beginning of time, what is the first thing that we see? The spirit of God. And some people will say, the spirit is not for today. It's right there at the beginning. It's there. It's at the beginning. It's in the next chapter. It's in the next book. It's in the book after that. It's in the uh New Testament. It's everywhere. How do we not have the spirit? Why isn't the spirit for today? It doesn't make sense. Amen. And with the spirit of God came what? Words. He spoke. He said, \"Let there be what?\" Light. And it's important to understand when God comes with his spirit, when he comes with his move of the spirit, he's also coming with his what? Word. And it's important to know what that word is. Genesis 16, God continues. He says, \"Let there be a firmament.\" And how he divided the waters from the waters. I'm not going to get into all that. I'm just saying God kept going. He kept speaking. He kept talking. He brought the light. He brought the water. He brought the plants. He kept moving. And he's still moving today. And he's still speaking today. He has not stopped. And he will not stop until the end. And so we also see that when God moves, when God speaks, things happen. And that's why we want this move. That's why we want God to move. That's why when you hear any of us say, \"Oh man, we really want God to move.\" That's what this is what we're talking about. See, when God speaks, things happen. Powerful things happen. Powerful things happen in your life. Powerful things happen around you. And also that powerful word does miracles. Amen. and even on the surface. Okay, it's important to realize God moved upon the waters. He didn't move in there. There's no in. It's just upon. And even moving upon, God did something wonderful. Amen. And when God moves upon us, he still is doing something wonderful. Judges chapter 13:25. The spirit of the Lord began to move upon him at times in the camp of Dan between Zora and Echo. When the devil had ended every temptation, he departed from him until an opportune what? Time. So in the spirit of God, there are times. There are seasons. Okay? If you are in a time where it's very difficult, don't just wait. There's a different time season coming. If you're in a time that is very wonderful, just wait. Just wait. Another bump in the road is coming. Be ready. Okay. We also we on the other side of things, you don't want to think, oh, everything's going to be rosy posy as a Christian. It's all wonderful and roses are are are red and violets are blue. [Music] No, you're going to have to have some strength in you. You're going to have to have some fight in you. Amen. You got to fight against the kingdom of darkness. And also, you cannot force to God. You can't force God to move. You can't force God to come back. Okay? For example, the second coming, you can't be like, \"Oh man, we're going God to move. I'm going to pray for him to return. No, he's going to come back at an appointed time. He's going to come back when everything has been fulfilled. Okay? He's that's when he's coming back. And just like that, in the spirit, the seasons, he comes when on his calendar and does the moves. We want him to move in America, but he's going to come and move in America when he's going to do it. But that doesn't mean in your life that you can't have God moving in your life. Did you know that you can still have God moving? You can still have the power of his word. You can still have the power of his presence, his spirit in you right now, regardless of what's going on in America. Amen. Judges chapter 14 verse 5. This is talking about Samson. Now to his surprise, a young lion came roaring against him, and the spirit of the Lord came mightily what? Upon him, and he tore the lion apart with his hands. Judges 15:4, same thing. Samson went out and caught 300 foxes and he burned up the standing grain. I'm just bringing out these examples where God came upon say it with me. Upon Samson and when God came upon him, he could do mighty. He had super strength. He could do mighty works. And so we we want the spirit of God coming upon us. Amen. Judges 15:14, when uh Samson came to Lehi, the Philistines came shouting against him, the spirit of the Lord came mightily what? Upon him, and the ropes that were in his arms became like flax, and his bonds broke loose from his hands. And you see, when God comes upon you, you can be loosed. How many of us maybe need to be loosed from something, right? We need that spirit of God moving what? Upon us. And he wants to move upon you today. Judges 15:15, he found a fresh jawbone of a donkey, reached his hand, and took it and killed a thousand men with it. Samson did this because the spirit came what? Upon him. So the spirit of God is powerful even when it's just upon you. And I showed you that illustration, right? Going back to the cup here. I can't pour out a lot. Oh my gosh. We're uh upon see this is Samson. The the the spirit is upon him and he's doing powerful wonderful works. But it's we got to it's just upon him, right? Oops. And again, if you want the spirit of God in you, you're going to have to pray and seek him. And we'll get into that in just a moment. Judges 16, Samson requested to be next to the pillars. And by the spirit of God, he broke down that whole temple. He tore down the temple of Deeon. He tore down. There were 3,000 people watching and they all died. They were enemies of of God's people. And God brought about a u a judgment upon the enemy through Samson because the spirit came upon him. It's important to note that Samson Samson would uh drink wine and he was a Nazerite. Nazerites are not supposed to drink even grape juice. Nazerites are not supposed to cut their hair. Nazerites uh they make a vow, right? And also he was going and spending time with a prostitute. Okay, we know what was going on exactly that thing right there. So you see there is a big difference. We're going to see a big difference between him and other people. And that spirit is coming upon him, but he is not responding. He is not behaving in a way uh that is in line with God. He's just being used. But I I want to be used by God, but I also want to follow and obey God. Amen. And we've got to make that transition from somebody whom the spirit moves upon to someone who the spirit moves in. So we want God in us, the spirit of God in us, not just upon us. But we also like it when the spirit moves upon us. Amen. Genesis 41:38. Pharaoh said to his servants, \"Can we find such a one as Joseph? A man in whom is the spirit of God?\" See, Pharaoh, he didn't know anything about the spirit. He didn't know anything about God. Pharaoh is he's a king. You know, maybe he did, but they had their own gods, right? But they could see through his revelation of the dream that that Pharaoh had given him, the interpretation that Joseph gave, he knew something was special about Joseph. And the writing here in Genesis, they were they were careful to use a different word saying in whom is the spirit of God. So Joseph had the spirit of God in him. Say it with me. In him. And God's question today is, do we have his spirit what in us? You know, is the spirit upon right here. Is the spirit upon the cup? Yeah, it's upon the cup. It's upon it. It's in there. It's upon it. Is it in it? Yeah. You got it in you. Got it upon you. You got to have I want a double, right? I want both. Now there was a young Hebrew man with us there, a servant of the captain of the guard. He interpreted our dreams for us just as he interpreted for us. So it happened. Pharaoh said to Joseph, \"I have had a dream.\" And Joseph answered Pharaoh, saying, \"It is not in me. God will give Pharaoh an answer of peace.\" I'm bringing out Genesis 41 here because there's a few things going on. First of all, Joseph was in prison. He was put in prison and he was a prisoner, right? Yes. He also while he was in prison, he started working for the prison guard. And so when he stepped up to the uh butler and the baker, they they the butler and the baker started to share their dream that they had. The butler and the baker. They referred to him as what? A servant of the captain of the guard. They did not refer to him as a what? Prisoner. Joseph walking around. They think that he is working in the prison. What a difference. Amen. You know, he he's not going around I'm a [Music] prisoner. I'm a prisoner. Oh, is that going to work? I'm in prison. Uh, is there anything I can do here? Oh, look at that. I can fix that. Hey, who are you? What are you doing? I'm just fixing this thing. I need you to fix something else. Hey, got to work. Instead of being at war, just Hey, is there something I can do in here? Look at this prison. Need some updates. Maybe I can paint. I can clean up. Right. So they knew Joseph as a servant of the captain of the guard first of all. Second all of all Joseph was why was he in prison? Was it justly? No. No. The me too movement hit him. believe all women potterers wives in lied through her teeth. You have homework to do, okay? If you don't know what I'm talking about, you need to go read this stuff. Genesis chapter 40. That's your homework. Look up what's going on. The Me Too movement hit Joseph and he was wrongly imprisoned, right? Uh he was a secondass citizen. He's a slave of Potterer, right? So, you know, what does this guy get them out of here? They threw him in prison wrongly, unjustly. And so, this uh Pharaoh is in charge of the justice system, is he not? Yes. So, Pharaoh comes and brings him up and he says, \"Okay, uh you know, I hear you know what you're talking about.\" And uh Joseph answers Pharaoh and he says, \"It is not in me.\" God will give Pharaoh an answer of what? An answer of what? Say it. peace. Joseph is talking peace with Pharaoh, the one who let him be in prison. You know, he could have been like, you know, your justice system, you you know, I can't stand I'm not helping you. But he didn't. He didn't. And uh maybe it would have been okay if he would have. You know, sometimes leaders need to hear it, but he didn't in this case. He gave him an answer of peace. What a very kind and uh response, wouldn't you say, for someone who's been a slave, someone who's been sold into slavery, somebody who's now standing before Pharaoh, uh for him to to talk to Pharaoh like that, that's pretty good. How many of us would do it like that? I don't know if I would. You're in prison. He's in prison for how long? Does anybody know? How long is he in prison? Two years. He's coming out of prison. You and they they they shave his head. They do all this stuff. They clean him up. He's like, \"Okay, what do you want with me now?\" He This is the way he responds. Would we respond this way? And he Why is he responding this way? He's responding because he has the spirit of God in him. Amen. Do you have Do we have the spirit of God in us? Hallelujah. Don't you want to act that way? I do. I want to have I want the spirit to have this kind of effect on me. Do you want to be someone who can handle bad things happening to them? Yes, I do. Don't you? I do. I do. Because bad things happen and we want to be able to handle it properly. Genesis 37:4. When his brothers saw that their father loved him more than all his brothers, they hated him and could not speak peaceibly to him. Uh Genesis 39:9, the wife of potterer said to Joseph, \"Lie with me.\" Joseph said, \"How then can I do this great wickedness and sin against God?\" And we see here because he had the spirit in him, he was able to handle his brothers who hated him. He didn't he didn't reject them. He didn't treat them wrong. He he wasn't mad at them. He treated them right even though they hated him and could not speak peaceibly. And you see that there's a contrast here. Somebody who has the spirit and somebody who is in Israel. They're they're brothers, right? And they're fighting like this. They're fighting with Joseph. And who responded right? The one who had the spirit in him. And a lot of people say, \"I've got the Holy Spirit. I'm filled with the Holy Spirit.\" This is how the spirit affects you. And is the Holy Spirit affecting you in this way? Because we can say we're filled with the Holy Spirit. You're a prophet and you act like an idiot and you talk like a idiot. And of course they turned on him. They sold him to slavery. They they wanted to kill him. They hated their brother. Potterer's wife. Um when she uh invited Joseph, he said, \"No, how can I do this great wickedness and sin against God?\" See, that's the spirit in you. You got you got that spirit in you. The spirit in you is going to say, \"No, I can't do this.\" How many of us need some conscience changing, some conviction in our hearts? Amen. When that spirit of God is in you, it affects your behavior. It affects your mind. Affect affects what you care about, affects what you think is right and wrong. And all of us need the spirit of God in us. I submit to you this morning, the spirit of God is very important. Psalms 105:19. This is a powerful scripture. Until that time, his word came to pass. The word of the Lord, what? Tested him. This is talking about Joseph. Joseph had been given a dream as a young person. He knew what God wanted to do in his life. He had an idea, maybe not clear, but he knew there was something special that God wanted to do with Joseph. But he had to be sold as a slave. He had to work as a slave for potterer. He had to be mistreated. He had to go to jail and imprison to to get to where God wanted to bring him. Amen. And he was able to do that because he had the spirit of God in him. Genesis 41:39, Pharaoh appointed Joseph as what? Second in command. He became number two in all of Egypt. Not just vice president. not vice president of the United States. They don't have any authority. Joseph was the president. It's just that Pharaoh was over his decisions. Amen. You understand that Joseph was making all the decisions. He was in charge. Genesis 50:1 19, Joseph said, \"Do not fear. As you meant evil against me, but God meant it for good. So do not fear. I will provide for you and your little ones. He's talking to his brothers who sold them into slavery. God is bringing restoration to him, his relationship with his brothers. Amen. Genesis 46:29, Joseph prepared his chariot, went up to meet Israel. His father in Gan fell on his neck and wept. And Israel said to Joseph, \"Now let me die since I've seen your face and now you are still I'm sorry I'm going through this fast.\" The point is Jo Joseph was restored back to even his father. He was taken and separated from his father. His father loved his son, but he was he his his brother sold him into sub. But God brought that all back. And that's it's important to understand that because when we have the spirit in us, God can work it things out. What what is the famous saying? I remember it since I was a kid. Uh something good for them that what is it? All things work together for good for them that love the Lord and are called according to his purpose. Joseph is an example of that. Amen. Better is the what? End of a thing than its beginning. In the beginning, Joseph was going through a tough time, but the end of it was a powerful restoration. Do we see that this morning? And how could he do this? Because of what? The spirit what? In him. In him. He is different than Samson. Samson had the spirit what? Upon him. Joseph had the spirit what? In him. Amen. Amen. Daniel chapter 4:9 last example. Daniel is another example. It says that uh this is Nebuchadnezzar. Daniel chapter 4. More homework for you. Daniel chapter 4 is a powerful story. It's one chapter. One of the best. This chapter should be for every reading throughout the world. Everybody in the world needs to read Daniel chapter 4 because every religion, everybody needs to hear this. The the uh you know God, he created everyone. You got to remember that it's not just for Christians. It's not just for God's people in Israel. This is the whole world. And this story about Nez Nebuchadnezzar having an encounter a a a hard to articulate right now. Nebuchadnezzar had a situation with God and it is powerful to read that whole thing. But in in part of it, Daniel chapter 4:9, he says to Daniel, whom he named Beltesar, Beltazar is his, you know, Babylon name, but Daniel is his Israeli name. Chief of the musicians, because I know that the spirit of the holy God is what? In you, no secret troubles you. Explain to me the visions of my dream that I have seen and its interpretation. Proverbs 27:2. One of the things that we want to recognize here is that Nebuchadnezzar the king is the one doing the praising here, right? Let another praise you and not your own mouth. A stranger not your own lips. Amen. Daniel didn't go around saying, \"I'm a prophet. I'm the man of God. I got the spirit of God in me. I'm awesome.\" When you see that, you better watch out. Amen. You know when somebody's got the spirit of God in them. Amen. They don't need to have an advertisement that says, \"I got the spirit of God in me and this jacket. They wanted me to wear this jacket. They wanted me to look nice.\" This doesn't mean I got the spirit of God in me. I've got I remember a powerful statement back in the day. It's not the suit, it's the fruit. Amen. It's not the suit, it's the fruit. It's not what you see on the outside, it's what the do they have the fruit bearing in their life. Daniel chapter 4:26, after you have come to know that heaven rules. So Daniel and Nebuchadnezzar are having this interaction. Daniel's giving them interpretation of the dream and Nebuchadnezzar is saying the spirit of God is in you and you have homework. I want you to tell me next week why that guy looks like that. Okay? And I know a lot of you know. Don't give any hints. Okay? Your homework is to read Daniel chapter 4. It is one chapter. It's like one page. You can read it in about five minutes. Okay? Okay. But next week, I want you to tell me why that man looks like that. All right. Now, also, I want you to see that guy down there is the king and that guy up there is the king. They're the same person. Okay? And I want you to tell me why. Moving on. Daniel had a reputation as a team in channel uh chapter 1 vers8. Daniel purposed in his heart that he would not defile himself. Say that with me. He what? He purposed. Say it with me. He purposed. What are you purposing? What are you deciding? What are your goals? What are you setting in your life? When you go to school as a a student, what is your purpose to go in there? Is it to go himhaw and and joke around and not care about your future? What is your purpose when you go to work? When you wake up and you got your kids, your family, is your purpose to be an example to them, to love them, your spouse, what is your purpose? Daniel purposed in his heart that he would not defile himself with the portion of the king's delicacies, nor the wine which he drank. He said, \"No, I don't want to do that.\" So early on as a teenager, Daniel is setting some uh boundaries and he's saying, \"I'm not going to do that.\" As a young man, he and his three companions sought God all night to know the king's dream and its interpretation. They received the vision and the interpretation. They saved themselves and the secular magicians and astrologers. If you remember that story, that's also homework. You can read all of Daniel. That's going to be homework. But Daniel chapter 4 for sure. Okay. Daniel and Shadrach, Meshach, and Abednego, they all sought God because Nebuchadnezzar had made a decree that all the astrologers and the magicians and the the seers would be killed. And so Daniel and three people, how many is that together? Four. Four. Four people stopped. saved everyone else. Four people because they sought God brought an answer to the king. Do you understand that the spirit of God is what? It's in him. 1st Samuel 14 chapter 6, I'm sorry, chapter 14:6. Jonathan said to his armor bearer, \"Come, let us go over to the outpost of these uncircumcised men. Perhaps the Lord will act on our behalf. Nothing can hinder the Lord from saving, whether by what? Many or by few. It's nothing for God to save with four people.\" Amen. Daniel chapter 5:13 as the worship team comes. The king said, \"I have heard of you that the spirit of God is in you and that light and understanding and excellent wisdom are found in you. The most high God gave Nebuchadnezzar your father a kingdom and majesty and glory and honor.\" In this situation, the son of Nebuchadnezzar, he is the son of the king. He is now the king Belshazar, right? He calls Daniel. If you remember this story in Daniel chapter 5, uh Belshazar is is drinking and they're they're praising the praise the God of gold. Praise the God of silver and they're using the cups from the the temple. And God says he he gets his finger out and he starts writing on the wall and everybody starts their knees are knocking. They start shaking. They see this writing on the wall. And so Belshazar calls Daniel. He says, 'I have heard of you that the spirit of God is what? Say it with me again. In you. I have heard that the spirit of God is what? In you. That light and understanding and excellent wisdom are found in you. And Daniel replied and he said to Belshazar, \"Your father, your father,\" when his heart was lifted up, he was deposed from his kingly throne, and they took his glory from him. But you, his son Belshazar, having not humbled your heart, although you knew all this, you have lifted up yourself against the Lord of heaven. And that's why this is happening. Sometimes the message isn't nice, but it's from God. And it's important how he respond to God's word. You see, Daniel had the spirit of God, but also he is letting them in on what God is saying. And though the spirit may come today and maybe you have the spirit in you today, what is God speaking and saying to you? Amen. Daniel had a reputation of having the spirit of God in him. And he did this by not defiling himself, by seeking God, by gaining understanding and wisdom. He worked. He stuck with God even when it was hard. As you know, you know about Daniel and the lions then, right? It was hard. He They threw him with the lions, but he stuck with God. He stayed praying. He had a habit of praying three times a day and they made a law against it. He stuck with it. He stayed with God. Amen. And God honored it. We're going to sing a song called Holy Spirit Rain Down. Whatever size cup you have this morning, I would invite you to turn it the proper way. Amen. If you have a little cup, turn it up. Let the spirit of God pour into you. And this week, start to expand your cup. Let the spirit of God be in you. You've got to dig yourself out. You raise your hand. Uh maybe after. Let me We're uh we're right in the throws here, right in the end. As young Christians, we can have the spirit in us. Amen. It's available to us. We can be powerful because of his spirit in us. We can steal and defeat the enemy. That's what we're seeing in these examples. So, I'd like to invite you to stand with me and let's invite the Holy Spirit to come. Amen. Holy Spirit rain down rain down. Oh comforter and friend. How we need your touch again. Holy Spirit rain down rain down. Let your power fall. Let your voice be heard. Come and change our hearts as we stand on your word. Holy [Music] Spirit, rain down. Now, we're going to sing this one more time. I know some of you may not have heard this song before, but this is a prayer and we were going to sing it a little slower and I want you to ask for God's spirit to come into you right now. Many of us this morning have already accepted Christ into our hearts and what's next? We've been baptized, many of us. What's next? We need the spirit of God in us. And so, we want to sing and ask and pray for that right now, inviting him to come. So, we're going to sing it a little slower. And let let this be a prayer from you right now as we sing this unto him. Holy Spirit, rain down. [Music] Rain down. Oh, and friend, how we need your touch again. Holy Spirit rain down rain down. Let your power fall. Let your voice be heard. Come and change our hearts as we stand on your word. Holy [Music] Spirit rain down. [Music] Who I have seen, no ear has heard, no mind can know what God has in store. So open up heaven, open wide over your church and over our lives. [Music] Holy [Applause] Spirit, rain down with our heads bow. Right now, we want to reach over to the person next to us and pray that God would put and pour his spirit into us. They would fill our cup that we would go and apply ourselves to expand. Let's lift up our voices one another right now. Lord God, I pray right now for Christine. I pray Lord God for Evelyn. Jesus, we pray for one another right now. Lord Jesus, we pray, Lord God, that your spirit would come, Lord, that it would fill up our cup, Lord Jesus, that it would fill up our spirit. Jesus, Lord, that we would have life in uses, Lord Jesus, that we would be able to pour it out to others, Jesus, Lord, that we be able to share, Lord, what you have done for us, God, that we be able to share. God is real to me. God is good. God loves me. Yes, Jesus, Lord, we pray, God. Oh, God. Lord, that you would fill our cup this morning, Jesus. Lord, we pray, Lord, also God, Lord, that we would not take this lightly, but Lord, that we would go home and expand, Lord Jesus, and dig out ourselves, God, and allow more of your spirit, Lord Jesus, to come in, Lord Jesus. Lord, applying ourselves by reading your word, praying, Lord God, seeking you, Lord God, coming to your house, Jesus, Lord, expanding, making it bigger and larger and God, inviting your spirit to come and fill us. Heavenly Father, we invite you right now and fill us. We want to thank you, oh Lord. God, Lord, we call on you, Lord of authority. We please Lord Jesus your spirit, your power. God, we pray for one another right now. We lift up our voices Jesus. Lord, we pray Lord Jes Lord that you would dig us out Lord Jesus that you would fill us Lord Jesus. Lord that you would transform our desires, our hunger, Lord God, what we desire Lord in us. Jesus Lord we pray right now Lord Jesus open up our eyes. Open up our understanding brought them forth in a day, in an hour that we are living in now. We know them, Lord. They're among us. Jesus, elevate them as you elevated Joseph to have an impact. God, have such an impact, Lord, upon our world. Joseph had an impact upon the world, Jesus. And he went through your processing plan, God. And you made him into something, Lord God, that no human hands could do, Jesus. You made him. You fashioned him by trial and fire. You fashioned him and you made him, God. Oh, we don't want to be a people, Lord, that are full of ourselves. And you bring us into places of trial and humility that we might be fashioned, Lord, to be vessels, not to be boastful, not to speak of our own arrogance, but to speak only those things that the Holy Spirit hears from Jesus Christ our Lord. We also want to come unto him. If anyone comes unto me, he said, \"Thirsts, yes, comes to me and drinks, it says that he'll put that water of life into us.\" So, let's also pray directly to Christ for ourselves, inviting him to fill us with his water. Lord God, we come before you right now. Lord Jesus, I come before you right now, Lord. We pray God for your drink Lord for your life Jesus to come Lord to me Jesus Lord we pray right now God heavenly father Jesus God lord that you would come Lord that you give us strength we need those we need your power we need your strength Jesus Jesus we pray for your spirit to get that river flowing in us again we have rivers of lifeord let's praise him let's lift up our voices together and thank him. We praise you. We praise you. We bless you. We exalt you out of our innermost being. Oh Lord, we praise you Jesus. How you break up the depths of the waters of life within us. For you said, Lord, you would find if any man thirst, let him come unto me and drink of those waters. We shall never thirst again, Lord God. We've got to remember the principles of your word. They work, Lord Jesus. They're living living waters. The word is a living water that springs up. Oh God, oh God, thank you Jesus. We have the living waters. Thank you Jesus. [Music] Thank you Jesus. Thank you Jesus. [Music] Thank you Jesus. Thank you Jesus. Thank you Jesus. Thank you Jesus. Thank you Jesus. Thank you. Thank you Jesus. Lori, would you please lift up your voice in closing? Lauren. flowing out. Thank you, Jesus. Your spirit indwelling, Father, so that those rivers touch people, that the word that goes forth is from the Holy Spirit, Father, that people are affected and they want to know more Jesus just like little girl with her arms up. Jesus, they ought to know. They ought to know that we are Christians, Jesus. They ought to know that we love you. They should see the sparkle in our eye from the Holy Spirit. They should see that sweetness. It should be a sweet aroma, Jesus. We just pray for that, Jesus, because we are to touch lives. We want to plant seeds and water, Jesus. We want to bring people into your kingdom because that's your will. You desire that. Jesus and that is your will. Father, we pray Jesus for our families Jesus. We are here. We intercede for our families and our friends Jesus in their time of needs. And father, I pray that in all seasons that the spirit of the living God, Jesus, resonates. And and Lord Jesus just absolutely emulates from all of our all of everything that we are, Jesus, so that we preach your word, Jesus, until you come again. Father, thank you, Father, for this message. We pray Jesus for a blessed Thank you for already blessing us. Your precious name we pray. Amen. Let your spirit rise with me. Let's sing that song one more time as we uh end here. Let your spirit rise within me. Let your spirit rise within me. You set my feet to dancing, my heart rejoicing, my mouth singing out your praise. Oh, let your spirit rise within me. Let your spirit rise in me. You said my feet are dancing and my heart rejoicing. My mouth singing out your praise. Hallelujah. Amen. Let's clap and thank Jesus this morning. Thank you, Jesus. Hallelujah. Amen. We need his spirit within us, rising within us. Amen. Amen. You may find your seats. Um, Adam, will you share your story, please, for for us? It's been about a year. I've been cancer free now. Uh, last year this time we were we were traveling. Um, and I left everybody in Georgia and flew back here to see the doctor for them to tell me that I didn't have cancer. Uh, they couldn't tell me phone, you know, that too easy. I had to fly all the way back to California. So, um, you know, I I had to call the way to Hammond. I couldn't go to my normal office. Nobody likes to go to Hammond, you know, but I did. And I just, it was a different doctor. I didn't know this guy. He comes in. Okay. Wow. I just flew all the way here, drove over there, rented a car, did all this stuff and I'm like I I didn't it just didn't really sink in. I'm just like, \"Okay, cool. Thanks.\" You know, and I went on my way. I came home. I, you know, spent the evening, ate my microwave pizza, watched a movie, you know, and uh the next day I flew back. I had to fly back to Georgia, meet up with the family. And I got to the airport. And as I was walking through the terminal, all of a sudden, it was like being filled up. It floating from the bottom. It was life and power. I felt like Samson. I was ready to knock something [Laughter] down. I'm just walking. And and it was also like going from like going from shades of gray back to [Music] color. For two years I was in shadows, shadow of death. And I came back to life that day. Praise the Lord. So, so I make it I make it to my gate and I sit down and I'm I'm just kind of coming down like okay and I'm just sitting there and all of a sudden then it started pouring down from the top and it was just joy and it and it and it just kept coming. I was like that little cup is it got all the way up here and started leaking out of my eyes and like okay I'm good like that's enough and uh it was all I could do not to be a complete puddle right here in the terminal. So I want to share that because I know I have a purpose. I'm still here. Amen. We all have a purpose. You have to seek it. God's not going to force you into anything. You know, we're not we're not worker ants. We have free will. You can choose. You do what you want. But if you want and you seek it, he will show you. He will show you that plan. So, I want to share that. Praise the Lord. Thank you. Leora, would you come up? We're gonna sing a song. You know it well. Those online want to thank you for joining us. Uh live control, you can cut it off. God bless you guys. Thank you very much. Let's just clap. This is amazing. Miracle. This is what we've cried out for. And I know we want to celebrate you tonight or today. Praise the Lord. Good morning. Good morning. Those online want to welcome you this morning. It's good to be in God's house. Amen. We're going to be reading out of the scriptures. First, we want to remind you that the Bible says where two or three are gathered. There he is in our midst. Amen. And before we get started praising God, we want to remind you the Bible says that he inhabits the praises of his people. Amen. Amen. Amen. So, let's get ready. Let's get give me some strumming. Give me Are you guys ready to worship? Hallelujah. Praise the Lord. We're going to be reading out of Mark this morning and Isaiah. Mark chapter 5 verse 2 says Jesus when he had stepped out of the boat. Jesus stepped out of the boat and he put his foot on the ground. Right. Immediately there met him out of the tomb as a man with an unclean spirit crying out with a loud voice saying, \"What have you to do with me?\" Jesus, son of the most high God. Jesus, all he did was step on the ground. Amen. Amen. And the guy with the demons like now, no, there was no earthquake. There was no RTOR scale. There was no uh the people weren't like, \"Oh, did you feel that 10.0 earthquake when Jesus stepped out?\" No, it was shaking the kingdom of darkness. Amen. And that is it's important. We need God to step down. We need him to put his feet in this place. We want him to shake the kingdom of darkness in our lives. We want him to break the things that may be holding a hold on us. Amen. Amen. We want God's authority and his stepping down in this place. Isaiah chapter 64. Oh, that you would what? Rend the heavens and come down. That's what we want this morning. Amen. Rend meaning he's going to leave the heavens. He's, you know, it's beautiful up there. It's glorious. He's got a great thing planned. He's making mansions for his people, but we want him to come down here. Amen. And he's like, \"Well, I got so much wonderful stuff up here.\" But he he does he does ren the heavens. Amen. We want him to step down that the mountains might shake at your presence, to make your name known to your adversaries, that the nations may tremble at your presence. You see, today in America and throughout the world, we have a big problem. We do not fear. We do not understand the terror and the trembling and the power of God. But Jesus, the father, the holy spirit, when they step down, you will understand. We will understand. And we want him to do that in this little place right here that we've got. The whole earth is his. But we want him to come and step down right here. Amen. Amen. Amen. So, let's stand. Let's worship him this morning. Hallelujah. Oh, let's lift up a joyful noise to the Lord this morning. Inviting him into this place. Yeah. Let's get excited. Not by might nor by power, but by uh oh, Jesus forgive me. Not by might, nor by power, but by my spirit, says the Lord. Oh, it's not by might, nor by power, but by my spirit, says the Lord. I'm getting Keep going. Keep going, man. I will build a road and make a way like a shining light till the perfect day. I will build my church again. I say by my spirit, sayeth the Lord. Not by might nor by power, but by thy spirit, says the Lord. Not by might nor by power, but by thy spirit, says the Lord. I will build a road and make a way like a shining light till a perfect day. I will build my church. Can I say by my spirit say the Lord? I will build a road and make a way like a shining light till a perfect day. I will build my church again I say by my spirit say the Lord. This is a church by your holy spirit blame. We have a burning desire to lift up Jesus name. Let the fire burn in every heart. Light the way it be the dark. Let the flame of love burn higher. This is a church. This is a church on [Music] fire. The Holy Spirit is here and his power is real. Anything can happen and it probably will. Something very good, something good's going on around here. There's a light that shines, makes the darkness appear. Power at work, but there's nothing appear. Something very good, something good going on around here. Oh, this is a church on fire. This is a Holy Spirit flame. We have a burning desire to lift up Jesus name. Let a fire burn in every heart. Light the way to defeat the dark. Let the flame of love burn higher. Let the flame of love burn higher. Oh, let the flame of love burn higher. This is a church. This is the church on fire. The Holy Spirit is here and his power is real. Anything can happen and it probably will. Something very good, something good is going on around here. There's a light that shines makes the darkness appear. A power at work, but there's nothing to fear. Something very good. Something good is going on around here. We are We are a church on fire. We are the Holy Spirit flame. We have a burning desire to lift up Jesus name. Let the fire burn in every heart. Light the way to beat the dark. Let the flame of love burn higher. This is a church. This is a church on fire. Let the fire burn in every heart. Light the way it be the dark. Let the flame of love burn higher. Oh, let the flame of love burn higher. Let the flame of love burn higher. This is a church. This is a church on fire. Hallelujah. Jesus, we bless you. We bless you. Hallelujah. We are you right now. Praise the Lord. Hallelujah. Thank you, Lord. Oh, let your spirit rise within me. Let your spirit rise within me. You set my feet to dancing in my heart rejoice and I'm singing out your praise. Let your spirit rise within me. Let your spirit rise within me. Kiss at my feet and dancing in my heart rejoicing on a mass singing out your praise. Let your spirit rise within me. Let your spirit rise. Let your spirit rise. All right, let's do those feet of dancing. You set my feet and dancing my heart rejoicing. I'm singing out your praise. Oh, let your spirit rise within me. Let your spirit rise within me. You said my feet are dancing, my heart rejoicing. My mouth singing out your praise. My mouth, my mouth singing out your praise. And my mouth singing out your praise. We holy praise. [Music] We call upon you today. You're wonderful, God. You're wonderful, Jesus. We exalt you. We exalt you. Oh, the testimony of Jesus is the spirit of prophecy. And the spirit is in this place. And the spirit is saying today, come and worship in spirit and in truth and give glory to God. We don't speak our words. We speak the word. And the word says that we can come boldly into his gates. Amen. And be filled with the spirit today. Hallelujah. As the spirit was moving over the waters, spirit come [Music] over. Come rest on us. Come rest on us. So come down, spirit, when you move, you make my heart pound when you fill the room. You're here and I know you are moving. I'm here and I know you will feel me. You'll come down, spirit, when you move, you make my heart when you build a room. You're here and I know you will feel me. I'm here and I know you will build me. Fill us a fresh Lord. [Music] Oh, as the spirit was moving over the water, spirit, come move over us. Come rest on us. Come rest on us. As the spirit was moving over the water, spirit come move over us. Come rest on us. Come rest on us. Oh, fire and wind. Won't you do it again? Open up the gates. Let heaven on in. Come rest on us. Come rest on us. So fire and wind, come and do it again. Open up the gates, let heaven on in. Come rest on us. Come rest on us. Oh come down, spirit. When you move, you make my heart pound. When you fill the room, you're here and I know you are moving. I'm here and I know you will fill me up now. Spirit, when you move, you make my heart pound. When you fill the room, you're here and I know you are moving. I'm here and I know you are fill me. Oh, fill us again. We pray oh God that your presence we are in this place. It's not by your might Lord Jesus. It's by your spirit Jesus. Holy Spirit we want to worship. Holy Spirit. Holy Spirit fire. I'm like a mighty wind. Lord, we need you today. We need you, Lord. Spirit, come rest on us. You're all we want. You're all we want. Holy Spirit, come rest on us. You're all we want. Oh, you're all we want. Oh, Holy Spirit, come rest on us. You're all we want. You're all we want. Holy Spirit, come rest on us. You're all we want. You're all we want. Come down, spirit, when you move. You make my heart pound when you fill the room. You're here and I know you are moving. I'm here and I know you will feel me. Come and fill us again, Lord. Let's lift up our voices. Let's worship Jesus. Let's lift our hands. Let's give him our all. Don't worry about the one next to you. Let's invite him. Let's be genuine. Let's be serious. Let's be intentional. We need the Holy Spirit. Oh, we need your spirit. So come down, spirit, when you move, you make my heart pound. When you fill the room, you're here and I know you are moving. I'm here and I know you will feel me. So come down, spirit, when you move, you make my heart pound. When you fill the room, you're here and I know you are moving. I'm here and I know you will fill me. Oh, come into our season. [Music] [Music] Jesus. Yes, Jesus. [Music] Yes. Oh, I love you. Let's lift up our voices and open up our mouths. God, we praise. We lift up. We invite you God. We thank you. We worship. We worship you Lord. Thank you Jesus. Praise you Lord. Hallelujah. Praise you Jesus. You fill this place. Hallelujah. We've come for a move. We've come for the Holy One. All we want, all we hunger for is you. [Music] Oh, we come with expected hearts undone, knowing who you are. Lord, we long for what only you can do. Only you. Fire on the altar, fresh wind blowing through. We're going to stay here until we encounter you. Make us an offering. Make us an upper room. We're going to stay here till we encounter [Music] you. Till we encounter you. Lift up your voices. Open up your heart. Make us desperate. Take our eyes. We're repentant. This is still your house. And you meant it when you said you'd pour your spirit out. Yes, Lord. Fire on the altar, fresh wind blowing through. We're going to stay here till we encounter you. Make us an offering. Make us another room. We're going to stay here till we encounter you. till we encounter you. Oh, we need a move of God. We need a move of God. We need a move of God. We're hungry. We're desperate. Lord, open in the heavens. We need a move of God in this city. We need a move of God in this church. We need a move of God. We're hungry. We're desperate for open the heavens. We need a move of God in our families. We need a move of God in our hearts. We need a move of God. We're hungry. We're desperate. Lord, open the heavens. Fire on the altar. Fresh wind blowing through. We're going to stay here till we encounter you. Make us an offering. Make us an upper room. We're going to stay here till we encounter [Music] you. Oh. Oh. Holy Spirit. Fire on the altar, fresh wind blowing through. We're going to stay here till we encounter you. Make us an offering. Make us an upper room. We're going to stay here till we encounter you. We need a move of God. We need a move of God. [Music] We need a move of God in this place. We need a move of God in our city. Jesus Jesus. God, we're reminded in the scriptures, Jesus, Lord, of what you did when you came. Oh Lord God, what you did, God, you opened the eyes of the blind. You opened the ears of the deaf. And God, you didn't do it just because you wanted to show that you could heal the body. But Lord, you did it because you wanted to show us this morning and throughout history and the h and in the future that you can open up the ears of the deaf God. God. And Lord, maybe right now, today, in this room, right now, on this date, God, we have a hard ear to hear, God. Lord, maybe today, we can't see exactly what it is that you want to do. See exactly what it is, how to walk in your way and in your path. But God, Lord, by your power, God, Lord, by your spirit, God, Lord, by your healing, you can come. You can open up our ears to hear. You can open up our spiritual eyes to see, Lord God, to change, Lord God, to get back on your path, God. Lord, to follow you with everything that we have, all of our heart. Jesus, Jesus, Lord, you have the power to heal the body. But Lord, more importantly, is the miracle of the changed person. The one who has been transformed. The one who is walking in the light of the Lord Jesus Christ. The one who is following God with all of their heart, all of their soul, all of their spirit. God, oh God, we want to be that changed person, God. Lord, we want that fulfilled in us, God. Jesus, Lord, God, no matter what the world has has the pressure that has come upon young people, God, Lord, by your healing power, by your powerful transformation, God, you can reach, Lord, the young people of our generation, Lord, you can reach those who are drug addicts, you can reach those, God, who are entrenched, God, because you have the power, Lord, to heal. You have the power, God, Lord Jesus, to do everything, Jesus, Jesus, to bring us to that new creation. Therefore, if any man is in Christ, he is a new creation. Old things have passed away. Behold, all things have become new. God. Oh God, we pray that we would respond not just looking for something to heal our body, our physical body, but something to heal the inside, the spirit inside of us, to transform, to change us, God. Oh God, we pray this morning. [Music] We need a move of God in our hearts. We need a move of God in this church. We need a move of God. We're hung. We're desperate. Lord, open the heavens. Fire on the altar. We're going to prove we're going to stay here till we encounter you. Make us an offering. Make us an upper room. We're going to stay here till we encounter you. Oh, till we encounter you, Jesus. Fire on the altar. Fresh wind blowing through. We're going to stay here till we encounter you. Make us an offering. Make us an upper room. We're going to stay here till we encounter you. Let's lift up our hands together. And let's just invite Jesus right now. And let's just say with our mouths, Lord God, we invite you this morning, Jesus. As they play one chord, nice and soft. God, we invite you right now. Lord Jesus, Holy Spirit, heavenly father, Jesus, son of God, the one who gave his life for us. God, we invite you right now. Lord, we invite you to step your foot down in this room. God, we invite you, Lord Jesus, to have your way, to speak your word. Lord Jesus, we pray this morning. Jesus, Jesus, Lord, we invite you. Lord, speak to us this morning. We thank you, Jesus. Fire on the altar, fresh wind blowing through. We're going to stay here till we encounter you. Make us an offering. Make us a Peru. We're going to stay here till we encounter you. [Music] Jesus. Jesus. God. Jesus. We need Jesus. God. Yes. Lord Jesus. We need your move, God. We need your move upon us. We need your move in our hearts, God. We need you, Lord Jesus, in this place, God. Please, we pray that we would no longer be satisfied. God, give us a hunger, every one of us, Lord. It says in this song, may we're hungry. We're desperate, God. Lord, we pray that we would become hungry and desperate for your spirit, for your truth, for your power, Lord Jesus. God, that we wouldn't be satisfied anymore with what we have. But we want to grow. We want to break through, Lord, like a plant, like a tree, breaking through, Lord Jesus, we want to break through this morning, Jesus. Lord, to have more of your life, to have more of your reign, to have more of your strength in us, Jesus. Please, God, we pray this morning. [Music] Not by might nor by power but by thy spirit says the Lord. Not by might nor by power but by thy spirit says the Lord. I will build a road and make a way like a shining light till a perfect day. I will build my church again. I say by my spirit say the Lord. I will build my church again. I say by my spirit say the Lord. Hallelujah. Let's thank you this morning. We thank you Jesus. We thank you God. We bless your name. Worthy, worthy are you Lord. Thank you Jesus. Thank you Jesus. Hallelujah. Wonderful Jesus. Thank you Lord. You may find your seats this morning."}