{"video_id": "uKBcG-OFjjU", "title": "What Does Being Saved Mean?", "published_at": "20250923", "transcript": "So, we're going to start with what does being saved mean? Excellent question. I had that same question when I was a young believer. Can you imagine? I was once a young believer. Yeah. 19 years old. I gave my I asked Jesus to come into my life. And lo and behold, I was shocked. He did. He was real. I got born again that night. Few weeks later, I got filled with the Holy Spirit. Spirit of love. God is love. The Holy Spirit is God's spirit. And because uh it's a spirit of love, I just figured everybody in the church was just A+ people. Boy, did I found out quick. It means you're going to you are rescued, set free from hellfire. Hell, the abiding place of the dead. and the eternal lake of fire where hell is cast into later. And you have the reward of heaven, the abiding place of the believer dead and a new heaven and earth when we resurrect. We take on that immortal body and we live with Christ forever and ever. That's what being saved means. You're not going to hell. You're not going to the lake of fire. You are when you die, you're going to go to heaven. So in uh Luke 16:22, I've preached this many times when I was 19 years old. The beggar died. Two people died. The beggar died and he was carried by angels to Abraham's bosom, heaven. The rich man died and he was buried. Big difference. Now a few years back I was on my deathbed with valley fever and they told me I only had certain time to live and uh I felt this depression on my bed. My wife used to come in and console me and comfort me and all that. And I thought it was her and I turned my head was turned away and I turned around and there's three spirit beings there. So this is a true scripture. And uh I knew that night or that day everyone it was that if I passed over this area that was over to their right and into that zone I was it was over. I just knew that. But I turned my head back the other way and going, \"Oh my god, am I leaving this earth or not?\" But anyway, uh they departed, didn't take me. My wife comes in and I said, \"Honey, dying is easy.\" And she goes, \"I don't want to hear that. I don't want to hear that at all.\" But it was it was just a simple transition from one area to another. And the angels carried the beggar to Abraham's bosom. So Abraham is alive. Even though he's been dead for hundreds of years, his spirit's still alive. In hell being in torments, the rich man sees Abraham a far off and Lazarus in his bosom or by his side. Okay? So they can see each other. So when you get up to heaven, you can see these people burning in the hell and you're going to be thank God that you straighten your life out. This is a very serious message. And theologians play games with salvation, but God doesn't. So he's burning in hell. He's in torments. And he said, \"Abraham, have mercy. All the crooks want mercy when they're trapped. You know, all the criminals want mercy, but they didn't give anybody mercy. He said, \"Send Lazarus with one drop of water and cool my just one drop.\" Well, one drop ain't going to do much, is it? But it shows you how horrible the torment was. Now, you say, \"How can that be?\" Our spirit young ones can think, can feel, can talk, can hear. Our spirit has everything that our body does. Only it can't die physically. Are you there? That's why now you see the seriousness of this. Salvation is not a thing to play a game with like being done in America. Everybody's relying on Ephesians 2:8. And Jesus commands men everywhere to what? Repent. Command. He's not suggesting. He's not suggesting, church. He is commanding that you turn from your sins back to God. Could that be an amen? >> And Ephesians 2:8 isn't going to do you a hill beans worth of good if you don't repent. And I talk with people every day on the internet from all religions, all walks of life, from Jews to Muslims to Baptists to Catholics and everything else. And let me tell you, there's a mixed up crowd out there. And they're messed up because they believe their church's doctrine of faith instead of the Bible's doctrine of faith. >> That was a good place for an amen. Does this church say amen? >> Amen. >> All right. Hallelujah. He says, \"I'm tormented in these flames.\" Remember Moses's and Elijah appeared to Jesus. They were still alive. Abraham's still alive. Abraham said, \"Son, I can't cross the gulf between you and me, and you can't come here. There's no such thing as purgatory. There's no such thing as the Mormons praying their people out of hell. It is a goof fix. I saw it. I experienced it. Once you go, you're gone. Are you there? >> Amen. >> Hallelujah. It's going to be something when you're up in heaven and you're seeing people down there suffering. And you're going to be so thankful that you listened. you are back in Alabama. I visited a lot of churches, talked to a lot of ministers, a lot of church leaders, and basically they say, \"You can't scare people into the kingdom.\" I said, \"That's exactly how I came in.\" That's true. I didn't want to go to hell. I don't want to burn in the lake of fire. So, I tested it out. I remember that night in church. I'm going to try this thing out. All right. And I came forward and the guy that led me to Christ knew what he was doing and he he led me through the scriptures and God came to me just changed my life and then the Holy Ghost revolutionized my life. And there was never any looking back. I never backslid. I never answered another salvation call. Oh, did I make mistakes? Yes, I did. As a young Christian, I made a lot of dumb mistakes. But I never I knew that I was going to heaven because I would repent from those mistakes and I would work on them. So, you know, when they gave alder calls, I never answered an alter call after that. I was born again. I was changed. I'm on my way upward. Could that be an amen? Amen. >> He says, \"Abraham, send Lazarus to testify to my five brothers so they don't come to this place.\" Well, it's a little late. You should have been testifying to him. But it's so serious. He's concerned about his brothers that are still on earth. This place is so horrible that he figures if somebody rose from the dead, his brother was listen. Abraham says they have Moses law and the prophets. Now, some churches don't even believe in the Old Testament. It's it the church world out there is insane. Jesus preached from the Old Testament. Jesus wrote the Old Testament. Are you there? Wow. But see, all these voices out there is really messing up America. Jesus himself said that he taught everything from Moses and the prophets concerning himself. All the Moses law, all the prophets wrote about Jesus Christ. And yet a lot of churches want to throw the Old Testament out. So you're throwing out the story and the promises and the prophecies about Jesus Christ. That make sense? Now you young ones, are you catching what I'm saying? Now you can be young and 40 years old. Just want you to know that. Hallelujah. He says, \"Let them hear them. Let them listen to, let them respond to Moses and the law.\" And that is the gospel message. Moses and the law and the prophets spoke of Jesus. Genesis spoke of Jesus at the very beginning. Jesus is all through the Old Testament. And John 1:1, John 1 1-18 says, \"God became flesh and dwelt amongst us. Who became flesh and dwelt amongst us? Who? The scripture said, \"God became flesh and dwelt amongst us.\" Now, I'm asking you a question. Who dwelt amongst us? >> God. And we knew him as >> the Lord Jesus Christ. Yes, you guys are smarter than a lot of people. God didn't send no substitute. He came himself in a fleshly body to die. And so the rich man says, \"No, no, no. Father Abraham, if one went from the dead, they would repent.\" See, listen, respond. The word here there means to listen to respond. It's not anybody can hear, but not everybody listens. Are you guys listening tonight? >> Hallelujah. >> Yeah. They would repent. And what does command God command all men everywhere to do? >> Repent. Command. No suggestion. But if they hear not Moses, they don't listen and respond to Moses and the prophets, they won't listen and respond. They won't be persuaded if one rose from the dead. Jesus rose from the dead. And he brought a whole slew of patriarchs with him. When uh when he died, the graves were open. And when he rose, those people come out of the graves and appeared unto many in Jerusalem. And so that's the first resurrection. And that's another message. I got to watch myself. That is the first resurrection. Okay, that one in Revelations 20 is talking about this resurrection, not some prophetic idea they come up with. Now, so far so good. This is serious business. You need to know what save means. You need to know why. It's a serious business. Now, eternal punishment for not listening and responding. Death and hell are cast into the lake of fire. So when you go to hell, when Jesus comes back, hell and death and Satan and the false prophet are going to be cast into the lake of fire that burns forever and ever and ever. And they say, \"Oh, that's just parables. That's just fiction stories. Yeah, tell that to the rich man. It's still there. See, we believe what we want to believe. But the Bible's very clear. And it says this is the second death. It's the death of the spirit. The spirit never dies, but the torment, the punishment forever carries on. In Revelation 20:14, all not written in the book of life was cast into the eternal lake of fire. How do you get written in the book book of life? Anybody know? Anybody want to take a stab at it? Believe on Jesus. That's right. Put your trust in Jesus and back it up. We're also saved from sin. Sin is the violation of God's law. If you break God's law, that's sin. Yes, sir. >> That's a good question. What say you guys? >> There's more. If you're trusting, what are you going to do? You're going to follow through. You're going to repent. You're going to confess your sin. You're going to get water baptized. Ain't that right? You're going to do what the scriptures say to do because you're trusting Jesus. You're trusting his word of truth. But it starts, see, faith comes by hearing the word. But faith comes by hearing the word of truth. If you're not hearing truth, you're going to have faith in untruth. Are you with me? >> And I can prove it. The Hindus do all kinds of crazy things. They sprinkle their vegetables with cow manure to purify them because they were taught by the Hindu priests that that's what you do. Okay? They they have faith in that. The atheists have faith that there's no God. It's faith. They believe there's no God. So, you got to have when when you hear the gospel message of truth, God will put faith in you and cause you to what? Respond. You listen and you respond. Good question. And it also says they that know to do good and do it not to them it is sin. The wages of pay and payment of sin is death in the lake of fire. Romans 6:23 Matthew 25:46. That's the payment for sin. So being saved is you're rescued, set free from that payment, that punishment of sin. And you're set free from the control of sin. You don't have to walk in sin anymore. And and you'll grow through it. At least I did. Maybe you guys just popcorn right into righteousness, but I didn't. I grew into it. I grew into righteousness. How many glad God gives you time to grow? Yes. Yes. Satan will always come by and say, \"See, you're no good. You're not believer. You're not a Christian. You just give up.\" Oh, no. No, no, no, no, no, no. I'm just I'm going to give it God's adjusting me. I just need an attitude adjustment. >> You're also saved from Satan. Acts 26:18. Paul was sent to preach the gospel, to turn people from darkness to light, to open their eyes, to turn them from the power of Satan to the power of God. and receive forgiveness of sin. So all Satan, listen young ones, all Satan can do is tempt you and test you. That's all he can do. And if you know his gimmicks, you'll just ignore him. He's nothing. Okay? He can't afflict you. He can't do anything without God's permission. And if you read the book of Job, Satan is totally under God's authority. He can only do what God says. Okay, you can do that. All right? And so you're free from Satan. So quit lifting him up. Quit talking about Satan's chasing me and Satan did this. No. No. You're free. And he's going to save you from the wrath of God. This is very important. Now hang on here. In Romans 5:9, he said, \"We're justified by his blood and we're saved from the wrath by Jesus Christ.\" Now, this wrath is God dealing with you personally. And not necessarily you, but those that don't follow him. He'll bring sickness. He'll bring financial disaster. He'll bring problems in the home. He He will let Satan do his thing. But if you believe in him and you follow him, you are set free from that wrath here on earth that God uses to correct his people. Are you with me? Do you understand that? That should be very comforting to you. And why these sinners go through such things? I, you know, I had brothers that went through things that they'd never had to go through if they were believers. Now, believers go through things, but it isn't because they're sinning. It's because they're living for God. There's a big difference. And then he says, Jesus Christ who delivers us from the wrath to come. There is a day of wrath coming at before Jesus returns. And God is going to pour out his plagues and his uh judgments upon this earth and show everybody like he did in Egypt with the 10 plagues that he is God. That day of wrath, you don't have to rapture out to get by this. He'll get you right through it. Was Israel raptured out to get out of the judgments of Egypt? >> No. This rapture thing is a bunch of nonsense. Okay. It is not taught in the Bible at all. It was fabricated by Darby over a hundred years ago and uh people got popular with it and all that. But you read Jesus and his second coming and you'll never see anything about a rapture. They have to take Daniel, stretch him over to the end time and do all kinds of twisting of scripture to get that to happen. We don't know if there's just seven years of tribul. We don't know how long this tribulation, this day of wrath, is going to last. But we do know his people are kept through it. If you read Revelations, right, and this verse says what? You are free. You're saved from the day of wrath. You don't have to worry about it. He's going to keep you. Does God have the power to do that? >> Yes. >> Yes. Does God have the power to save you? >> I mean, this salvation that you're you're you're experiences because God has the power to save you. And all you had to do is respond. Okay? Obeying God's word and living right also saves us and gives us eternal life. 1 Timothy 4:16. That That's why Christians need to be reading the Bible. Most Christians do not read their Bible daily. It's sad. They wait for the preacher or somebody on the radio or TV to get them pumped up. You can't get more pumped up than reading that Bible. God wrote it. He backs it up. And if you take the time to read that book from beginning to end and then study it, you will grow into a mature, stable, solid Christian. >> Hallelujah. I've read it 135 times plus. I stopped, as I said, counting at 135 because it sounded like I was bragging, so I'd stopped counting. But that thing feeds you. that that is spiritual food for you >> and people are into prayer. Let me tell you, I can't read the book without praying. Praying is asking. There's several ways to pray. One of them is asking. I go, God, what are you saying here? Exactly. I mean, I'm praying. Ain't that right? I mean, I don't have to get down. Oh, God. You open that book up, you're going to say, \"God, what in the world are you talking about?\" How many read enough of the Bible to No, that's true. Yeah. And he will slowly open your understanding. Okay. If you continue in the doctrine, you'll save yourself and all who hear you. Isn't it important for us to continue it in Christ's doctrine so that others can also be saved? >> Definitely. So, how many are going to make a new commitment to read the Bible through once a year? >> Come on. Once a year. >> Hallelujah. If I read it through twice at 82, you youngans can read that thing. Matthew 25:46, the unrighteous go into everlasting punishment, the righteous under life eternal. Righteousness is important. You got to understand there's two kinds of righteousness. Anybody know what they are? Going once, going twice, bound. The first righteousness is imputed righteousness by the blood of Christ, his death. We are righteous. Okay? When we accept him, we are righteous. It's imputed to us. It's put on our account. And we may still curse and swear and do stupid things, but that imputed righteous covers us until we grow into he that do doeth righteous is righteous even as Christ is righteous. >> Was Christ righteous? >> Not just imputed. >> Yeah. He lived a righteous life and so can you. Don't you believe these Baptists and these people that say you cannot you can't be a righteous person. You can. The church is the biggest discourager of the brethren. >> You can't be perfect. You can't be righteous. If you say you you don't have sin, you're a liar. And there's none righteous. Know not one. Well, why in the world I get saved? If I got to walk in sin, what in the world I did I get saved for? Are you there? I told you there's a lot of voices out there and you need to tune in to God's voice and that Bible."}